[NoCoverage] StringLiteral
src/main/api/client.ts:1:18
-const API_BASE = "/api";
+const API_BASE = "";
 
 export interface Assessment {

[NoCoverage] BlockStatement
src/main/api/client.ts:23:65
   subconcept_label: string | null;
 }
 
-export async function fetchAssessments(): Promise<Assessment[]> {
-  const res = await fetch(`${API_BASE}/assessments`);
-  return res.json();
-}
+export async function fetchAssessments(): Promise<Assessment[]> {}
 
 export async function fetchQuestions(

[NoCoverage] BlockStatement
src/main/api/client.ts:30:24
 
 export async function fetchQuestions(
   assessmentId: string,
-): Promise<Question[]> {
-  const res = await fetch(`${API_BASE}/assessments/${assessmentId}/questions`);
-  return res.json();
-}
+): Promise<Question[]> {}
 
 export async function fetchQuestionConcepts(

[NoCoverage] BlockStatement
src/main/api/client.ts:37:31
 
 export async function fetchQuestionConcepts(
   questionId: string,
-): Promise<QuestionConcept[]> {
-  const res = await fetch(`${API_BASE}/questions/${questionId}/concepts`);
-  return res.json();
-}
+): Promise<QuestionConcept[]> {}
 
 export interface UserStateResponse {

[NoCoverage] BlockStatement
src/main/api/client.ts:50:38
 
 export async function fetchUserState(
   userid: number,
-): Promise<UserStateResponse | null> {
-  const res = await fetch(`${API_BASE}/user-state/${userid}`);
-  if (res.status === 404) return null;
-  if (!res.ok)
-    throw new Error(`Failed to fetch user state for userid ${userid}`);
-  return res.json();
-}
+): Promise<UserStateResponse | null> {}
 
 export async function saveUserState(body: {

[NoCoverage] ConditionalExpression
src/main/api/client.ts:52:7
   userid: number,
 ): Promise<UserStateResponse | null> {
   const res = await fetch(`${API_BASE}/user-state/${userid}`);
-  if (res.status === 404) return null;
+  if (false) return null;
   if (!res.ok)
     throw new Error(`Failed to fetch user state for userid ${userid}`);

[NoCoverage] EqualityOperator
src/main/api/client.ts:52:7
   userid: number,
 ): Promise<UserStateResponse | null> {
   const res = await fetch(`${API_BASE}/user-state/${userid}`);
-  if (res.status === 404) return null;
+  if (res.status !== 404) return null;
   if (!res.ok)
     throw new Error(`Failed to fetch user state for userid ${userid}`);

[NoCoverage] ConditionalExpression
src/main/api/client.ts:53:7
 ): Promise<UserStateResponse | null> {
   const res = await fetch(`${API_BASE}/user-state/${userid}`);
   if (res.status === 404) return null;
-  if (!res.ok)
+  if (true)
     throw new Error(`Failed to fetch user state for userid ${userid}`);
   return res.json();

[NoCoverage] ConditionalExpression
src/main/api/client.ts:53:7
 ): Promise<UserStateResponse | null> {
   const res = await fetch(`${API_BASE}/user-state/${userid}`);
   if (res.status === 404) return null;
-  if (!res.ok)
+  if (false)
     throw new Error(`Failed to fetch user state for userid ${userid}`);
   return res.json();

[NoCoverage] StringLiteral
src/main/api/client.ts:54:21
   const res = await fetch(`${API_BASE}/user-state/${userid}`);
   if (res.status === 404) return null;
   if (!res.ok)
-    throw new Error(`Failed to fetch user state for userid ${userid}`);
+    throw new Error(``);
   return res.json();
 }

[NoCoverage] BlockStatement
src/main/api/client.ts:63:19
   starred_ids: string[];
   detail_cards: unknown[];
   mastered_subconcepts: string[];
-}): Promise<void> {
-  const res = await fetch(`${API_BASE}/user-state`, {
-    method: "POST",
-    headers: { "Content-Type": "application/json" },
-    body: JSON.stringify(body),
-  });
-  if (!res.ok)
-    throw new Error(`Failed to save user state for userid ${body.userid}`);
-}
+}): Promise<void> {}
 
 export async function logUserActivity(body: {

[NoCoverage] ObjectLiteral
src/main/api/client.ts:64:53
   detail_cards: unknown[];
   mastered_subconcepts: string[];
 }): Promise<void> {
-  const res = await fetch(`${API_BASE}/user-state`, {
-    method: "POST",
-    headers: { "Content-Type": "application/json" },
-    body: JSON.stringify(body),
-  });
+  const res = await fetch(`${API_BASE}/user-state`, {});
   if (!res.ok)
     throw new Error(`Failed to save user state for userid ${body.userid}`);

[NoCoverage] StringLiteral
src/main/api/client.ts:64:27
   detail_cards: unknown[];
   mastered_subconcepts: string[];
 }): Promise<void> {
-  const res = await fetch(`${API_BASE}/user-state`, {
+  const res = await fetch(``, {
     method: "POST",
     headers: { "Content-Type": "application/json" },

[NoCoverage] BooleanLiteral
src/main/api/client.ts:69:7
     headers: { "Content-Type": "application/json" },
     body: JSON.stringify(body),
   });
-  if (!res.ok)
+  if (res.ok)
     throw new Error(`Failed to save user state for userid ${body.userid}`);
 }

[NoCoverage] ConditionalExpression
src/main/api/client.ts:69:7
     headers: { "Content-Type": "application/json" },
     body: JSON.stringify(body),
   });
-  if (!res.ok)
+  if (true)
     throw new Error(`Failed to save user state for userid ${body.userid}`);
 }

[NoCoverage] BlockStatement
src/main/api/client.ts:77:19
   userid: number;
   event_type: string;
   payload: object;
-}): Promise<void> {
-  const res = await fetch(`${API_BASE}/user-activity`, {
-    method: "POST",
-    headers: { "Content-Type": "application/json" },
-    body: JSON.stringify(body),
-  });
-  if (!res.ok)
-    throw new Error(`Failed to log user activity for userid ${body.userid}`);
-}
+}): Promise<void> {}
 

[NoCoverage] StringLiteral
src/main/api/client.ts:84:21
     body: JSON.stringify(body),
   });
   if (!res.ok)
-    throw new Error(`Failed to log user activity for userid ${body.userid}`);
+    throw new Error(``);
 }
 
