[NoCoverage] BlockStatement
src/main/components/ConsentScreen.tsx:6:29
 export default function ConsentScreen() {
   const { data: systemInfo } = useSystemInfo();
 
-  const handleLogin = () => {
-    window.location.href =
-      systemInfo?.oauthLogin ?? "/oauth2/authorization/google";
-  };
+  const handleLogin = () => {};
 
   return (

[NoCoverage] StringLiteral
src/main/components/ConsentScreen.tsx:26:22
         style={{
           background: "#fff",
           borderRadius: 12,
-          borderTop: "1.5px solid #1E293B",
+          borderTop: "",
           borderLeft: "1.5px solid #1E293B",
           borderRight: "4px solid #1E293B",

[NoCoverage] StringLiteral
src/main/components/ConsentScreen.tsx:42:20
             fontFamily: "Helvetica, Arial, sans-serif",
             fontWeight: 800,
             fontSize: 30,
-            color: "#1E293B",
+            color: "",
             background: "#d9f9ff",
             padding: "10px 14px",

[NoCoverage] StringLiteral
src/main/components/ConsentScreen.tsx:44:22
             fontSize: 30,
             color: "#1E293B",
             background: "#d9f9ff",
-            padding: "10px 14px",
+            padding: "",
             borderRadius: 8,
             borderTop: "1.5px solid #1E293B",
