[NoCoverage] BooleanLiteral
src/main/components/AssessmentSelect.tsx:15:40
   selectedAssessmentId,
   onSelect,
 }: AssessmentSelectProps) {
-  const [isOpen, setIsOpen] = useState(false);
+  const [isOpen, setIsOpen] = useState(true);
   const containerRef = useRef<HTMLDivElement>(null);
 

[NoCoverage] ConditionalExpression
src/main/components/AssessmentSelect.tsx:19:29
   const containerRef = useRef<HTMLDivElement>(null);
 
   const selectedName =
-    assessments.find((a) => a.id === selectedAssessmentId)?.name ?? "";
+    assessments.find((a) => true)?.name ?? "";
 
   useEffect(() => {

[NoCoverage] OptionalChaining
src/main/components/AssessmentSelect.tsx:19:5
   const containerRef = useRef<HTMLDivElement>(null);
 
   const selectedName =
-    assessments.find((a) => a.id === selectedAssessmentId)?.name ?? "";
+    assessments.find(a => a.id === selectedAssessmentId).name ?? "";
 
   useEffect(() => {

[NoCoverage] BlockStatement
src/main/components/AssessmentSelect.tsx:21:19
   const selectedName =
     assessments.find((a) => a.id === selectedAssessmentId)?.name ?? "";
 
-  useEffect(() => {
-    const handler = (e: MouseEvent) => {
-      if (
-        containerRef.current &&
-        !containerRef.current.contains(e.target as Node)
-      ) {
-        setIsOpen(false);
-      }
-    };
-    document.addEventListener("mousedown", handler, true);
-    return () => document.removeEventListener("mousedown", handler, true);
-  }, []);
+  useEffect(() => {}, []);
 
   return (

[NoCoverage] BlockStatement
src/main/components/AssessmentSelect.tsx:22:40
     assessments.find((a) => a.id === selectedAssessmentId)?.name ?? "";
 
   useEffect(() => {
-    const handler = (e: MouseEvent) => {
-      if (
-        containerRef.current &&
-        !containerRef.current.contains(e.target as Node)
-      ) {
-        setIsOpen(false);
-      }
-    };
+    const handler = (e: MouseEvent) => {};
     document.addEventListener("mousedown", handler, true);
     return () => document.removeEventListener("mousedown", handler, true);

[NoCoverage] ConditionalExpression
src/main/components/AssessmentSelect.tsx:24:9
   useEffect(() => {
     const handler = (e: MouseEvent) => {
       if (
-        containerRef.current &&
-        !containerRef.current.contains(e.target as Node)
+        true
       ) {
         setIsOpen(false);

[NoCoverage] BlockStatement
src/main/components/AssessmentSelect.tsx:26:9
       if (
         containerRef.current &&
         !containerRef.current.contains(e.target as Node)
-      ) {
-        setIsOpen(false);
-      }
+      ) {}
     };
     document.addEventListener("mousedown", handler, true);

[NoCoverage] BooleanLiteral
src/main/components/AssessmentSelect.tsx:27:19
         containerRef.current &&
         !containerRef.current.contains(e.target as Node)
       ) {
-        setIsOpen(false);
+        setIsOpen(true);
       }
     };

[NoCoverage] BooleanLiteral
src/main/components/AssessmentSelect.tsx:30:53
         setIsOpen(false);
       }
     };
-    document.addEventListener("mousedown", handler, true);
+    document.addEventListener("mousedown", handler, false);
     return () => document.removeEventListener("mousedown", handler, true);
   }, []);

[NoCoverage] StringLiteral
src/main/components/AssessmentSelect.tsx:30:31
         setIsOpen(false);
       }
     };
-    document.addEventListener("mousedown", handler, true);
+    document.addEventListener("", handler, true);
     return () => document.removeEventListener("mousedown", handler, true);
   }, []);

[NoCoverage] ArrowFunction
src/main/components/AssessmentSelect.tsx:31:12
       }
     };
     document.addEventListener("mousedown", handler, true);
-    return () => document.removeEventListener("mousedown", handler, true);
+    return () => undefined;
   }, []);
 

[NoCoverage] BooleanLiteral
src/main/components/AssessmentSelect.tsx:31:69
       }
     };
     document.addEventListener("mousedown", handler, true);
-    return () => document.removeEventListener("mousedown", handler, true);
+    return () => document.removeEventListener("mousedown", handler, false);
   }, []);
 

[NoCoverage] ArrayDeclaration
src/main/components/AssessmentSelect.tsx:32:6
     };
     document.addEventListener("mousedown", handler, true);
     return () => document.removeEventListener("mousedown", handler, true);
-  }, []);
+  }, ["Stryker was here"]);
 
   return (

[NoCoverage] StringLiteral
src/main/components/AssessmentSelect.tsx:35:48
   }, []);
 
   return (
-    <div ref={containerRef} style={{ position: "relative", minWidth: 200 }}>
+    <div ref={containerRef} style={{ position: "", minWidth: 200 }}>
       <div
         onClick={() => setIsOpen((o) => !o)}

[NoCoverage] ArrowFunction
src/main/components/AssessmentSelect.tsx:37:34
   return (
     <div ref={containerRef} style={{ position: "relative", minWidth: 200 }}>
       <div
-        onClick={() => setIsOpen((o) => !o)}
+        onClick={() => setIsOpen(() => undefined)}
         style={{
           width: "100%",

[NoCoverage] ArrowFunction
src/main/components/AssessmentSelect.tsx:37:18
   return (
     <div ref={containerRef} style={{ position: "relative", minWidth: 200 }}>
       <div
-        onClick={() => setIsOpen((o) => !o)}
+        onClick={() => undefined}
         style={{
           width: "100%",

[NoCoverage] ObjectLiteral
src/main/components/AssessmentSelect.tsx:38:16
     <div ref={containerRef} style={{ position: "relative", minWidth: 200 }}>
       <div
         onClick={() => setIsOpen((o) => !o)}
-        style={{
-          width: "100%",
-          height: 28,
-          padding: "0px 10px",
-          fontFamily: "Helvetica, Arial, sans-serif",
-          fontSize: 13,
-          background: "#ffffff",
-          color: selectedAssessmentId ? "#1E293B" : "#94A3B8",
-          border: "1px solid #000000",
-          borderRadius: 6,
-          cursor: "pointer",
-          boxSizing: "border-box",
-          display: "flex",
-          alignItems: "center",
-          justifyContent: "space-between",
-          userSelect: "none",
-        }}
+        style={{}}
       >
         <span>{selectedName || "Select assessment…"}</span>

[NoCoverage] StringLiteral
src/main/components/AssessmentSelect.tsx:39:18
       <div
         onClick={() => setIsOpen((o) => !o)}
         style={{
-          width: "100%",
+          width: "",
           height: 28,
           padding: "0px 10px",

[NoCoverage] StringLiteral
src/main/components/AssessmentSelect.tsx:45:53
           fontFamily: "Helvetica, Arial, sans-serif",
           fontSize: 13,
           background: "#ffffff",
-          color: selectedAssessmentId ? "#1E293B" : "#94A3B8",
+          color: selectedAssessmentId ? "#1E293B" : "",
           border: "1px solid #000000",
           borderRadius: 6,

[NoCoverage] StringLiteral
src/main/components/AssessmentSelect.tsx:48:19
           color: selectedAssessmentId ? "#1E293B" : "#94A3B8",
           border: "1px solid #000000",
           borderRadius: 6,
-          cursor: "pointer",
+          cursor: "",
           boxSizing: "border-box",
           display: "flex",

[NoCoverage] StringLiteral
src/main/components/AssessmentSelect.tsx:49:22
           border: "1px solid #000000",
           borderRadius: 6,
           cursor: "pointer",
-          boxSizing: "border-box",
+          boxSizing: "",
           display: "flex",
           alignItems: "center",

[NoCoverage] StringLiteral
src/main/components/AssessmentSelect.tsx:50:20
           borderRadius: 6,
           cursor: "pointer",
           boxSizing: "border-box",
-          display: "flex",
+          display: "",
           alignItems: "center",
           justifyContent: "space-between",

[NoCoverage] LogicalOperator
src/main/components/AssessmentSelect.tsx:56:16
           userSelect: "none",
         }}
       >
-        <span>{selectedName || "Select assessment…"}</span>
+        <span>{selectedName && "Select assessment…"}</span>
         <svg
           width="12"

[NoCoverage] ConditionalExpression
src/main/components/AssessmentSelect.tsx:56:16
           userSelect: "none",
         }}
       >
-        <span>{selectedName || "Select assessment…"}</span>
+        <span>{false}</span>
         <svg
           width="12"

[NoCoverage] ObjectLiteral
src/main/components/AssessmentSelect.tsx:66:18
           strokeWidth="2"
           strokeLinecap="round"
           strokeLinejoin="round"
-          style={{
-            flexShrink: 0,
-            transform: isOpen ? "rotate(180deg)" : "none",
-            transition: "transform 0.15s",
-          }}
+          style={{}}
         >
           <polyline points="6 9 12 15 18 9" />

[NoCoverage] EqualityOperator
src/main/components/AssessmentSelect.tsx:76:18
         </svg>
       </div>
 
-      {isOpen && assessments.length > 0 && (
+      {isOpen && assessments.length >= 0 && (
         <div
           style={{

[NoCoverage] ConditionalExpression
src/main/components/AssessmentSelect.tsx:76:18
         </svg>
       </div>
 
-      {isOpen && assessments.length > 0 && (
+      {isOpen && true && (
         <div
           style={{

[NoCoverage] StringLiteral
src/main/components/AssessmentSelect.tsx:84:21
             left: 0,
             right: 0,
             background: "#fff",
-            border: "1px solid #E2E8F0",
+            border: "",
             borderRadius: 6,
             boxShadow: "0 4px 16px rgba(0,0,0,0.1)",

[NoCoverage] StringLiteral
src/main/components/AssessmentSelect.tsx:89:24
             boxShadow: "0 4px 16px rgba(0,0,0,0.1)",
             zIndex: 100,
             maxHeight: 260,
-            overflowY: "auto",
+            overflowY: "",
           }}
         >

[NoCoverage] BlockStatement
src/main/components/AssessmentSelect.tsx:95:34
           {assessments.map((a, i) => (
             <div
               key={a.id}
-              onMouseDown={() => {
-                onSelect(a.id);
-                setIsOpen(false);
-              }}
+              onMouseDown={() => {}}
               style={{
                 padding: "4px 8px",

[NoCoverage] BooleanLiteral
src/main/components/AssessmentSelect.tsx:97:27
               key={a.id}
               onMouseDown={() => {
                 onSelect(a.id);
-                setIsOpen(false);
+                setIsOpen(true);
               }}
               style={{

[NoCoverage] ObjectLiteral
src/main/components/AssessmentSelect.tsx:99:22
                 onSelect(a.id);
                 setIsOpen(false);
               }}
-              style={{
-                padding: "4px 8px",
-                fontSize: 12,
-                cursor: "pointer",
-                color: "#1E293B",
-                background: a.id === selectedAssessmentId ? "#EFF6FF" : "#fff",
-                borderBottom:
-                  i < assessments.length - 1 ? "1px solid #F1F5F9" : "none",
-              }}
+              style={{}}
               onMouseEnter={(e) =>
                 (e.currentTarget.style.background = "#F8FAFC")

[NoCoverage] StringLiteral
src/main/components/AssessmentSelect.tsx:100:26
                 setIsOpen(false);
               }}
               style={{
-                padding: "4px 8px",
+                padding: "",
                 fontSize: 12,
                 cursor: "pointer",

[NoCoverage] EqualityOperator
src/main/components/AssessmentSelect.tsx:104:29
                 fontSize: 12,
                 cursor: "pointer",
                 color: "#1E293B",
-                background: a.id === selectedAssessmentId ? "#EFF6FF" : "#fff",
+                background: a.id !== selectedAssessmentId ? "#EFF6FF" : "#fff",
                 borderBottom:
                   i < assessments.length - 1 ? "1px solid #F1F5F9" : "none",

[NoCoverage] ConditionalExpression
src/main/components/AssessmentSelect.tsx:104:29
                 fontSize: 12,
                 cursor: "pointer",
                 color: "#1E293B",
-                background: a.id === selectedAssessmentId ? "#EFF6FF" : "#fff",
+                background: true ? "#EFF6FF" : "#fff",
                 borderBottom:
                   i < assessments.length - 1 ? "1px solid #F1F5F9" : "none",

[NoCoverage] ConditionalExpression
src/main/components/AssessmentSelect.tsx:106:19
                 color: "#1E293B",
                 background: a.id === selectedAssessmentId ? "#EFF6FF" : "#fff",
                 borderBottom:
-                  i < assessments.length - 1 ? "1px solid #F1F5F9" : "none",
+                  false ? "1px solid #F1F5F9" : "none",
               }}
               onMouseEnter={(e) =>

[NoCoverage] ArithmeticOperator
src/main/components/AssessmentSelect.tsx:106:23
                 color: "#1E293B",
                 background: a.id === selectedAssessmentId ? "#EFF6FF" : "#fff",
                 borderBottom:
-                  i < assessments.length - 1 ? "1px solid #F1F5F9" : "none",
+                  i < assessments.length + 1 ? "1px solid #F1F5F9" : "none",
               }}
               onMouseEnter={(e) =>

[NoCoverage] ArrowFunction
src/main/components/AssessmentSelect.tsx:108:29
                 borderBottom:
                   i < assessments.length - 1 ? "1px solid #F1F5F9" : "none",
               }}
-              onMouseEnter={(e) =>
-                (e.currentTarget.style.background = "#F8FAFC")
+              onMouseEnter={() => undefined
               }
               onMouseLeave={(e) =>

[NoCoverage] ArrowFunction
src/main/components/AssessmentSelect.tsx:111:29
               onMouseEnter={(e) =>
                 (e.currentTarget.style.background = "#F8FAFC")
               }
-              onMouseLeave={(e) =>
-                (e.currentTarget.style.background =
-                  a.id === selectedAssessmentId ? "#EFF6FF" : "#fff")
+              onMouseLeave={() => undefined
               }
             >

[NoCoverage] ConditionalExpression
src/main/components/AssessmentSelect.tsx:113:19
               }
               onMouseLeave={(e) =>
                 (e.currentTarget.style.background =
-                  a.id === selectedAssessmentId ? "#EFF6FF" : "#fff")
+                  false ? "#EFF6FF" : "#fff")
               }
             >

[NoCoverage] ConditionalExpression
src/main/components/AssessmentSelect.tsx:113:19
               }
               onMouseLeave={(e) =>
                 (e.currentTarget.style.background =
-                  a.id === selectedAssessmentId ? "#EFF6FF" : "#fff")
+                  true ? "#EFF6FF" : "#fff")
               }
             >
