[NoCoverage] BlockStatement
main/components/Nav/AppNavbar.tsx:15:30
       systemInfo?.oauthLogin ?? "/oauth2/authorization/google";
   };
 
-  const handleLogout = () => {
-    logout.mutate();
-  };
+  const handleLogout = () => {};
 
   return (

[Survived] ObjectLiteral
main/components/Nav/AppNavbar.tsx:21:14
 
   return (
     <header
-      style={{
-        background: "#ffffff",
-        borderBottom: "1px solid var(--border)",
-      }}
+      style={{}}
     >
       <div

[Survived] StringLiteral
main/components/Nav/AppNavbar.tsx:22:21
   return (
     <header
       style={{
-        background: "#ffffff",
+        background: "",
         borderBottom: "1px solid var(--border)",
       }}

[Survived] ObjectLiteral
main/components/Nav/AppNavbar.tsx:27:16
       }}
     >
       <div
-        style={{
-          width: "1126px",
-          maxWidth: "100%",
-          margin: "0 auto",
-          display: "flex",
-          alignItems: "center",
-          justifyContent: "space-between",
-          gap: "16px",
-          padding: "16px 20px",
-        }}
+        style={{}}
       >
         <Link

[Survived] StringLiteral
main/components/Nav/AppNavbar.tsx:30:19
         style={{
           width: "1126px",
           maxWidth: "100%",
-          margin: "0 auto",
+          margin: "",
           display: "flex",
           alignItems: "center",

[Survived] StringLiteral
main/components/Nav/AppNavbar.tsx:35:20
           alignItems: "center",
           justifyContent: "space-between",
           gap: "16px",
-          padding: "16px 20px",
+          padding: "",
         }}
       >

[Survived] StringLiteral
main/components/Nav/AppNavbar.tsx:41:20
         <Link
           to="/"
           style={{
-            color: "#1E293B",
+            color: "",
             fontSize: "1.5rem",
             fontWeight: 700,

[Survived] StringLiteral
main/components/Nav/AppNavbar.tsx:42:23
           to="/"
           style={{
             color: "#1E293B",
-            fontSize: "1.5rem",
+            fontSize: "",
             fontWeight: 700,
             textDecoration: "none",

[Survived] StringLiteral
main/components/Nav/AppNavbar.tsx:44:29
             color: "#1E293B",
             fontSize: "1.5rem",
             fontWeight: 700,
-            textDecoration: "none",
+            textDecoration: "",
           }}
         >

[Survived] StringLiteral
main/components/Nav/AppNavbar.tsx:59:25
         </span>
         <div
           style={{
-            marginLeft: "auto",
+            marginLeft: "",
             display: "flex",
             alignItems: "center",

[Survived] StringLiteral
main/components/Nav/AppNavbar.tsx:60:22
         <div
           style={{
             marginLeft: "auto",
-            display: "flex",
+            display: "",
             alignItems: "center",
             gap: "12px",

[Survived] OptionalChaining
main/components/Nav/AppNavbar.tsx:65:12
             gap: "12px",
           }}
         >
-          {currentUser?.loggedIn ? (
+          {currentUser.loggedIn ? (
             <>
               <span style={{ color: "#475569", fontSize: "0.9rem" }}>

[Survived] StringLiteral
main/components/Nav/AppNavbar.tsx:67:58
         >
           {currentUser?.loggedIn ? (
             <>
-              <span style={{ color: "#475569", fontSize: "0.9rem" }}>
+              <span style={{ color: "#475569", fontSize: "" }}>
                 {
                   (currentUser.root as { user?: { email?: string } })?.user

[Survived] OptionalChaining
main/components/Nav/AppNavbar.tsx:69:19
             <>
               <span style={{ color: "#475569", fontSize: "0.9rem" }}>
                 {
-                  (currentUser.root as { user?: { email?: string } })?.user
+                  (currentUser.root as {
+  user?: {
+    email?: string;
+  };
+}).user
                     ?.email
                 }

[Survived] OptionalChaining
main/components/Nav/AppNavbar.tsx:69:19
             <>
               <span style={{ color: "#475569", fontSize: "0.9rem" }}>
                 {
-                  (currentUser.root as { user?: { email?: string } })?.user
-                    ?.email
+                  (currentUser.root as {
+  user?: {
+    email?: string;
+  };
+})?.user.email
                 }
               </span>

[Survived] StringLiteral
main/components/Nav/AppNavbar.tsx:78:26
                 style={{
                   padding: "6px 14px",
                   background: "#1E293B",
-                  color: "#ffffff",
+                  color: "",
                   border: "none",
                   borderRadius: "6px",

[Survived] StringLiteral
main/components/Nav/AppNavbar.tsx:80:33
                   background: "#1E293B",
                   color: "#ffffff",
                   border: "none",
-                  borderRadius: "6px",
+                  borderRadius: "",
                   cursor: "pointer",
                   fontSize: "0.875rem",

[Survived] StringLiteral
main/components/Nav/AppNavbar.tsx:94:29
               onClick={handleLogin}
               style={{
                 padding: "6px 14px",
-                background: "#1E293B",
+                background: "",
                 color: "#ffffff",
                 border: "none",

[Survived] StringLiteral
main/components/Nav/AppNavbar.tsx:99:27
                 border: "none",
                 borderRadius: "6px",
                 cursor: "pointer",
-                fontSize: "0.875rem",
+                fontSize: "",
                 fontWeight: 600,
               }}
