[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:74:65
   onPaneClick?: () => void;
 }
 
-function toPastel(hex: string, strength: number = 0.35): string {
-  const r = parseInt(hex.slice(1, 3), 16);
-  const g = parseInt(hex.slice(3, 5), 16);
-  const b = parseInt(hex.slice(5, 7), 16);
-  const pr = Math.round(r * strength + 255 * (1 - strength));
-  const pg = Math.round(g * strength + 255 * (1 - strength));
-  const pb = Math.round(b * strength + 255 * (1 - strength));
-  return `rgb(${pr}, ${pg}, ${pb})`;
-}
+function toPastel(hex: string, strength: number = 0.35): string {}
 
 const DeleteDetailContext = createContext<(id: string) => void>(() => {});

[NoCoverage] MethodExpression
src/main/components/ConceptGraph.tsx:75:22
 }
 
 function toPastel(hex: string, strength: number = 0.35): string {
-  const r = parseInt(hex.slice(1, 3), 16);
+  const r = parseInt(hex, 16);
   const g = parseInt(hex.slice(3, 5), 16);
   const b = parseInt(hex.slice(5, 7), 16);

[NoCoverage] MethodExpression
src/main/components/ConceptGraph.tsx:76:22
 
 function toPastel(hex: string, strength: number = 0.35): string {
   const r = parseInt(hex.slice(1, 3), 16);
-  const g = parseInt(hex.slice(3, 5), 16);
+  const g = parseInt(hex, 16);
   const b = parseInt(hex.slice(5, 7), 16);
   const pr = Math.round(r * strength + 255 * (1 - strength));

[NoCoverage] MethodExpression
src/main/components/ConceptGraph.tsx:77:22
 function toPastel(hex: string, strength: number = 0.35): string {
   const r = parseInt(hex.slice(1, 3), 16);
   const g = parseInt(hex.slice(3, 5), 16);
-  const b = parseInt(hex.slice(5, 7), 16);
+  const b = parseInt(hex, 16);
   const pr = Math.round(r * strength + 255 * (1 - strength));
   const pg = Math.round(g * strength + 255 * (1 - strength));

[NoCoverage] ArithmeticOperator
src/main/components/ConceptGraph.tsx:78:25
   const r = parseInt(hex.slice(1, 3), 16);
   const g = parseInt(hex.slice(3, 5), 16);
   const b = parseInt(hex.slice(5, 7), 16);
-  const pr = Math.round(r * strength + 255 * (1 - strength));
+  const pr = Math.round(r / strength + 255 * (1 - strength));
   const pg = Math.round(g * strength + 255 * (1 - strength));
   const pb = Math.round(b * strength + 255 * (1 - strength));

[NoCoverage] ArithmeticOperator
src/main/components/ConceptGraph.tsx:78:25
   const r = parseInt(hex.slice(1, 3), 16);
   const g = parseInt(hex.slice(3, 5), 16);
   const b = parseInt(hex.slice(5, 7), 16);
-  const pr = Math.round(r * strength + 255 * (1 - strength));
+  const pr = Math.round(r * strength - 255 * (1 - strength));
   const pg = Math.round(g * strength + 255 * (1 - strength));
   const pb = Math.round(b * strength + 255 * (1 - strength));

[NoCoverage] ArithmeticOperator
src/main/components/ConceptGraph.tsx:79:25
   const g = parseInt(hex.slice(3, 5), 16);
   const b = parseInt(hex.slice(5, 7), 16);
   const pr = Math.round(r * strength + 255 * (1 - strength));
-  const pg = Math.round(g * strength + 255 * (1 - strength));
+  const pg = Math.round(g * strength - 255 * (1 - strength));
   const pb = Math.round(b * strength + 255 * (1 - strength));
   return `rgb(${pr}, ${pg}, ${pb})`;

[NoCoverage] ArithmeticOperator
src/main/components/ConceptGraph.tsx:79:40
   const g = parseInt(hex.slice(3, 5), 16);
   const b = parseInt(hex.slice(5, 7), 16);
   const pr = Math.round(r * strength + 255 * (1 - strength));
-  const pg = Math.round(g * strength + 255 * (1 - strength));
+  const pg = Math.round(g * strength + 255 / (1 - strength));
   const pb = Math.round(b * strength + 255 * (1 - strength));
   return `rgb(${pr}, ${pg}, ${pb})`;

[NoCoverage] ArithmeticOperator
src/main/components/ConceptGraph.tsx:80:40
   const b = parseInt(hex.slice(5, 7), 16);
   const pr = Math.round(r * strength + 255 * (1 - strength));
   const pg = Math.round(g * strength + 255 * (1 - strength));
-  const pb = Math.round(b * strength + 255 * (1 - strength));
+  const pb = Math.round(b * strength + 255 / (1 - strength));
   return `rgb(${pr}, ${pg}, ${pb})`;
 }

[NoCoverage] ArithmeticOperator
src/main/components/ConceptGraph.tsx:80:47
   const b = parseInt(hex.slice(5, 7), 16);
   const pr = Math.round(r * strength + 255 * (1 - strength));
   const pg = Math.round(g * strength + 255 * (1 - strength));
-  const pb = Math.round(b * strength + 255 * (1 - strength));
+  const pb = Math.round(b * strength + 255 * (1 + strength));
   return `rgb(${pr}, ${pg}, ${pb})`;
 }

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:87:30
 const DeleteDetailContext = createContext<(id: string) => void>(() => {});
 
 const LEVELS = [
-  { label: "Level 5", color: "#2bcd9c" },
+  { label: "Level 5", color: "" },
   { label: "Level 4", color: "#fe9a71" },
   { label: "Level 3", color: "#93ebff" },

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:88:30
 
 const LEVELS = [
   { label: "Level 5", color: "#2bcd9c" },
-  { label: "Level 4", color: "#fe9a71" },
+  { label: "Level 4", color: "" },
   { label: "Level 3", color: "#93ebff" },
   { label: "Level 2", color: "#feaef2" },

[NoCoverage] ObjectLiteral
src/main/components/ConceptGraph.tsx:89:3
 const LEVELS = [
   { label: "Level 5", color: "#2bcd9c" },
   { label: "Level 4", color: "#fe9a71" },
-  { label: "Level 3", color: "#93ebff" },
+  {},
   { label: "Level 2", color: "#feaef2" },
   { label: "Level 1", color: "#c99ffe" },

[NoCoverage] ObjectLiteral
src/main/components/ConceptGraph.tsx:90:3
   { label: "Level 5", color: "#2bcd9c" },
   { label: "Level 4", color: "#fe9a71" },
   { label: "Level 3", color: "#93ebff" },
-  { label: "Level 2", color: "#feaef2" },
+  {},
   { label: "Level 1", color: "#c99ffe" },
 ];

[NoCoverage] BooleanLiteral
src/main/components/ConceptGraph.tsx:95:42
 ];
 
 function LevelLegend() {
-  const [hovered, setHovered] = useState(false);
+  const [hovered, setHovered] = useState(true);
   return (
     <div

[NoCoverage] ArrowFunction
src/main/components/ConceptGraph.tsx:98:21
   const [hovered, setHovered] = useState(false);
   return (
     <div
-      onMouseEnter={() => setHovered(true)}
+      onMouseEnter={() => undefined}
       onMouseLeave={() => setHovered(false)}
       style={{

[NoCoverage] BooleanLiteral
src/main/components/ConceptGraph.tsx:98:38
   const [hovered, setHovered] = useState(false);
   return (
     <div
-      onMouseEnter={() => setHovered(true)}
+      onMouseEnter={() => setHovered(false)}
       onMouseLeave={() => setHovered(false)}
       style={{

[NoCoverage] ArrowFunction
src/main/components/ConceptGraph.tsx:99:21
   return (
     <div
       onMouseEnter={() => setHovered(true)}
-      onMouseLeave={() => setHovered(false)}
+      onMouseLeave={() => undefined}
       style={{
         background: "rgba(255,255,255,0.92)",

[NoCoverage] BooleanLiteral
src/main/components/ConceptGraph.tsx:99:38
   return (
     <div
       onMouseEnter={() => setHovered(true)}
-      onMouseLeave={() => setHovered(false)}
+      onMouseLeave={() => setHovered(true)}
       style={{
         background: "rgba(255,255,255,0.92)",

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:105:22
         borderRadius: 10,
         borderTop: "1.5px solid #1E293B",
         borderLeft: "1.5px solid #1E293B",
-        borderRight: "4px solid #1E293B",
+        borderRight: "",
         borderBottom: "4px solid #1E293B",
         padding: "8px",

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:107:18
         borderLeft: "1.5px solid #1E293B",
         borderRight: "4px solid #1E293B",
         borderBottom: "4px solid #1E293B",
-        padding: "8px",
+        padding: "",
         display: "flex",
         flexDirection: "column",

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:108:18
         borderRight: "4px solid #1E293B",
         borderBottom: "4px solid #1E293B",
         padding: "8px",
-        display: "flex",
+        display: "",
         flexDirection: "column",
         gap: 6,

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:114:17
         width: hovered ? 100 : 44,
         transition: "width 0.2s ease",
         overflow: "hidden",
-        cursor: "default",
+        cursor: "",
       }}
     >

[NoCoverage] ObjectLiteral
src/main/components/ConceptGraph.tsx:118:29
       }}
     >
       {LEVELS.map((level, i) => (
-        <div key={i} style={{ display: "flex", alignItems: "center", gap: 8 }}>
+        <div key={i} style={{}}>
           <div
             style={{

[NoCoverage] ObjectLiteral
src/main/components/ConceptGraph.tsx:120:20
       {LEVELS.map((level, i) => (
         <div key={i} style={{ display: "flex", alignItems: "center", gap: 8 }}>
           <div
-            style={{
-              width: 22,
-              height: 22,
-              borderRadius: 5,
-              background: level.color,
-              border: "1.5px solid #1E293B",
-              flexShrink: 0,
-            }}
+            style={{}}
           />
           <span

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:134:22
               fontFamily: "Helvetica, Arial, sans-serif",
               fontSize: 13,
               fontWeight: 600,
-              color: "#1E293B",
+              color: "",
               whiteSpace: "nowrap",
               overflow: "hidden",

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:135:27
               fontSize: 13,
               fontWeight: 600,
               color: "#1E293B",
-              whiteSpace: "nowrap",
+              whiteSpace: "",
               overflow: "hidden",
               width: hovered ? 72 : 0,

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:136:25
               fontWeight: 600,
               color: "#1E293B",
               whiteSpace: "nowrap",
-              overflow: "hidden",
+              overflow: "",
               width: hovered ? 72 : 0,
               opacity: hovered ? 1 : 0,

[NoCoverage] BooleanLiteral
src/main/components/ConceptGraph.tsx:151:42
 }
 
 function ResetButton({ onReset }: { onReset: () => void }) {
-  const [hovered, setHovered] = useState(false);
+  const [hovered, setHovered] = useState(true);
   return (
     <div

[NoCoverage] BooleanLiteral
src/main/components/ConceptGraph.tsx:155:38
   return (
     <div
       onClick={onReset}
-      onMouseEnter={() => setHovered(true)}
+      onMouseEnter={() => setHovered(false)}
       onMouseLeave={() => setHovered(false)}
       style={{

[NoCoverage] ArrowFunction
src/main/components/ConceptGraph.tsx:155:21
   return (
     <div
       onClick={onReset}
-      onMouseEnter={() => setHovered(true)}
+      onMouseEnter={() => undefined}
       onMouseLeave={() => setHovered(false)}
       style={{

[NoCoverage] ObjectLiteral
src/main/components/ConceptGraph.tsx:157:14
       onClick={onReset}
       onMouseEnter={() => setHovered(true)}
       onMouseLeave={() => setHovered(false)}
-      style={{
-        background: "rgba(255,255,255,0.92)",
-        borderRadius: 10,
-        borderTop: "1.5px solid #1E293B",
-        borderLeft: "1.5px solid #1E293B",
-        borderRight: "4px solid #1E293B",
-        borderBottom: "4px solid #1E293B",
-        padding: "8px",
-        display: "flex",
-        alignItems: "center",
-        gap: 4,
-        width: hovered ? 180 : 44,
-        transition: "width 0.2s ease",
-        overflow: "hidden",
-        cursor: "pointer",
-      }}
+      style={{}}
     >
       <svg

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:163:23
         borderTop: "1.5px solid #1E293B",
         borderLeft: "1.5px solid #1E293B",
         borderRight: "4px solid #1E293B",
-        borderBottom: "4px solid #1E293B",
+        borderBottom: "",
         padding: "8px",
         display: "flex",

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:171:17
         width: hovered ? 180 : 44,
         transition: "width 0.2s ease",
         overflow: "hidden",
-        cursor: "pointer",
+        cursor: "",
       }}
     >

[NoCoverage] ObjectLiteral
src/main/components/ConceptGraph.tsx:183:16
         strokeWidth="2"
         strokeLinecap="round"
         strokeLinejoin="round"
-        style={{ flexShrink: 0 }}
+        style={{}}
       >
         <path d="M23 4v6h-6" />

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:190:23
       </svg>
       <span
         style={{
-          fontFamily: "Helvetica, Arial, sans-serif",
+          fontFamily: "",
           fontSize: 13,
           fontWeight: 600,

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:198:23
           overflow: "hidden",
           width: hovered ? 180 : 0,
           opacity: hovered ? 1 : 0,
-          transition: "width 0.2s ease, opacity 0.15s ease",
+          transition: "",
         }}
       >

[NoCoverage] LogicalOperator
src/main/components/ConceptGraph.tsx:223:21
     | ((sub: string) => void)
     | undefined;
 
-  const showColor = !hasSelection || highlighted;
+  const showColor = !hasSelection && highlighted;
 
   return (

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:223:21
     | ((sub: string) => void)
     | undefined;
 
-  const showColor = !hasSelection || highlighted;
+  const showColor = false;
 
   return (

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:231:20
         width: 280,
         borderRadius: 10,
         overflow: "hidden",
-        borderTop: "1.5px solid #1E293B",
+        borderTop: "",
         borderLeft: "1.5px solid #1E293B",
         borderRight: "4px solid #1E293B",

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:232:21
         borderRadius: 10,
         overflow: "hidden",
         borderTop: "1.5px solid #1E293B",
-        borderLeft: "1.5px solid #1E293B",
+        borderLeft: "",
         borderRight: "4px solid #1E293B",
         borderBottom: "4px solid #1E293B",

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:236:11
         borderRight: "4px solid #1E293B",
         borderBottom: "4px solid #1E293B",
         boxShadow:
-          highlighted && hasSelection
+          false
             ? `0 0 0 6px ${color}50, 0 4px 16px rgba(0,0,0,0.2)`
             : showColor

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:236:11
         borderRight: "4px solid #1E293B",
         borderBottom: "4px solid #1E293B",
         boxShadow:
-          highlighted && hasSelection
+          true
             ? `0 0 0 6px ${color}50, 0 4px 16px rgba(0,0,0,0.2)`
             : showColor

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:237:15
         borderBottom: "4px solid #1E293B",
         boxShadow:
           highlighted && hasSelection
-            ? `0 0 0 6px ${color}50, 0 4px 16px rgba(0,0,0,0.2)`
+            ? ``
             : showColor
               ? "0 3px 12px rgba(0,0,0,0.18)"

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:239:17
           highlighted && hasSelection
             ? `0 0 0 6px ${color}50, 0 4px 16px rgba(0,0,0,0.2)`
             : showColor
-              ? "0 3px 12px rgba(0,0,0,0.18)"
+              ? ""
               : "0 2px 8px rgba(0,0,0,0.1)",
         opacity: hasSelection && !highlighted ? 0.25 : 1,

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:240:17
             ? `0 0 0 6px ${color}50, 0 4px 16px rgba(0,0,0,0.2)`
             : showColor
               ? "0 3px 12px rgba(0,0,0,0.18)"
-              : "0 2px 8px rgba(0,0,0,0.1)",
+              : "",
         opacity: hasSelection && !highlighted ? 0.25 : 1,
         cursor: "pointer",

[NoCoverage] BooleanLiteral
src/main/components/ConceptGraph.tsx:241:34
             : showColor
               ? "0 3px 12px rgba(0,0,0,0.18)"
               : "0 2px 8px rgba(0,0,0,0.1)",
-        opacity: hasSelection && !highlighted ? 0.25 : 1,
+        opacity: hasSelection && highlighted ? 0.25 : 1,
         cursor: "pointer",
         transition: "opacity 0.25s, box-shadow 0.25s",

[NoCoverage] LogicalOperator
src/main/components/ConceptGraph.tsx:241:18
             : showColor
               ? "0 3px 12px rgba(0,0,0,0.18)"
               : "0 2px 8px rgba(0,0,0,0.1)",
-        opacity: hasSelection && !highlighted ? 0.25 : 1,
+        opacity: hasSelection || !highlighted ? 0.25 : 1,
         cursor: "pointer",
         transition: "opacity 0.25s, box-shadow 0.25s",

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:256:26
       <div
         style={{
           background: showColor ? color : "#94A3B8",
-          letterSpacing: "0.03em",
+          letterSpacing: "",
           fontFamily: "Helvetica, Arial, sans-serif",
           color: "#000000",

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:260:26
           fontFamily: "Helvetica, Arial, sans-serif",
           color: "#000000",
           paddingTop: "27px",
-          paddingBottom: "6px",
+          paddingBottom: "",
           paddingLeft: "14px",
           paddingRight: "14px",

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:264:22
           paddingLeft: "14px",
           paddingRight: "14px",
           lineHeight: 1.1,
-          textAlign: "left",
+          textAlign: "",
           fontSize: 28,
           fontWeight: 700,

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:269:21
           fontWeight: 700,
           whiteSpace: "pre-line",
           transition: "background 0.25s",
-          position: "relative",
+          position: "",
         }}
       >

[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:274:27
       >
         {label}
         <div
-          onClick={(e) => {
-            e.stopPropagation();
-            onStarClick();
-          }}
+          onClick={(e) => {}}
           style={{
             position: "absolute",

[NoCoverage] ObjectLiteral
src/main/components/ConceptGraph.tsx:278:18
             e.stopPropagation();
             onStarClick();
           }}
-          style={{
-            position: "absolute",
-            top: 12,
-            right: 12,
-            width: 28,
-            height: 28,
-            borderRadius: 6,
-            border: "2px solid #1E293B",
-            background: starred ? "#FACC15" : "#ffffff",
-            display: "flex",
-            alignItems: "center",
-            justifyContent: "center",
-            cursor: "pointer",
-            flexShrink: 0,
-          }}
+          style={{}}
         >
           <svg

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:285:21
             width: 28,
             height: 28,
             borderRadius: 6,
-            border: "2px solid #1E293B",
+            border: "",
             background: starred ? "#FACC15" : "#ffffff",
             display: "flex",

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:287:22
             borderRadius: 6,
             border: "2px solid #1E293B",
             background: starred ? "#FACC15" : "#ffffff",
-            display: "flex",
+            display: "",
             alignItems: "center",
             justifyContent: "center",

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:298:41
             width="14"
             height="14"
             viewBox="0 0 24 24"
-            fill={starred ? "#1E293B" : "none"}
+            fill={starred ? "#1E293B" : ""}
             stroke="#1E293B"
             strokeWidth="2"

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:312:32
       <div
         style={{
           display: "grid",
-          gridTemplateColumns: "1fr",
+          gridTemplateColumns: "",
           gap: 2,
           background: showColor ? `${color}55` : "#CBD5E140",

[NoCoverage] BooleanLiteral
src/main/components/ConceptGraph.tsx:319:63
         }}
       >
         {subconcepts.map((sub, i) => {
-          const isMastered = masteredSubconcepts?.has(sub) ?? false;
+          const isMastered = masteredSubconcepts?.has(sub) ?? true;
           return (
             <div

[NoCoverage] OptionalChaining
src/main/components/ConceptGraph.tsx:319:30
         }}
       >
         {subconcepts.map((sub, i) => {
-          const isMastered = masteredSubconcepts?.has(sub) ?? false;
+          const isMastered = masteredSubconcepts.has(sub) ?? false;
           return (
             <div

[NoCoverage] OptionalChaining
src/main/components/ConceptGraph.tsx:325:29
               key={i}
               style={{
                 position: "relative",
-                background: highlightedSubconcepts?.has(sub)
+                background: highlightedSubconcepts.has(sub)
                   ? toPastel(color)
                   : "#fff",

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:328:26
                 background: highlightedSubconcepts?.has(sub)
                   ? toPastel(color)
                   : "#fff",
-                padding: "5px 6px",
+                padding: "",
                 textAlign: "center",
                 fontFamily: "Helvetica, Arial, sans-serif",

[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:339:33
               }}
             >
               <div
-                onClick={(e) => {
-                  e.stopPropagation();
-                  onSubconceptMastered?.(sub);
-                }}
+                onClick={(e) => {}}
                 style={{
                   position: "absolute",

[NoCoverage] OptionalChaining
src/main/components/ConceptGraph.tsx:341:19
               <div
                 onClick={(e) => {
                   e.stopPropagation();
-                  onSubconceptMastered?.(sub);
+                  onSubconceptMastered(sub);
                 }}
                 style={{

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:346:24
                 style={{
                   position: "absolute",
                   left: 6,
-                  top: "50%",
+                  top: "",
                   transform: "translateY(-50%)",
                   width: 14,

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:356:28
                   borderRight: "2.5px solid #1E293B",
                   borderBottom: "2.5px solid #1E293B",
                   background: isMastered ? color : "#ffffff",
-                  display: "flex",
+                  display: "",
                   alignItems: "center",
                   justifyContent: "center",

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:363:18
                   flexShrink: 0,
                 }}
               >
-                {isMastered && (
-                  <svg
-                    width="8"
-                    height="8"
-                    viewBox="0 0 12 12"
-                    fill="none"
-                    stroke="#1E293B"
-                    strokeWidth="2.5"
-                    strokeLinecap="round"
-                    strokeLinejoin="round"
-                  >
-                    <polyline points="2 6 5 9 10 3" />
-                  </svg>
-                )}
+                {false}
               </div>
               {sub}

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:363:18
                   flexShrink: 0,
                 }}
               >
-                {isMastered && (
-                  <svg
-                    width="8"
-                    height="8"
-                    viewBox="0 0 12 12"
-                    fill="none"
-                    stroke="#1E293B"
-                    strokeWidth="2.5"
-                    strokeLinecap="round"
-                    strokeLinejoin="round"
-                  >
-                    <polyline points="2 6 5 9 10 3" />
-                  </svg>
-                )}
+                {true}
               </div>
               {sub}

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:388:45
         id="top"
         type="source"
         position={Position.Top}
-        style={{ opacity: 0, pointerEvents: "none" }}
+        style={{ opacity: 0, pointerEvents: "" }}
       />
     </div>

[NoCoverage] BooleanLiteral
src/main/components/ConceptGraph.tsx:396:52
 
 function DetailNode({ data, id }: NodeProps) {
   const onDelete = useContext(DeleteDetailContext);
-  const [closeHovered, setCloseHovered] = useState(false);
+  const [closeHovered, setCloseHovered] = useState(true);
 
   const cardType = data.cardType as string;

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:403:44
   const conceptColor = data.conceptColor as string;
   const greyed = data.greyed as boolean | undefined;
   const bgColor = greyed ? "#f1f5f9" : toPastel(conceptColor);
-  const borderColor = greyed ? "#cbd5e1" : "#000000";
+  const borderColor = greyed ? "#cbd5e1" : "";
   const pillBg = greyed ? "#cbd5e1" : conceptColor;
   const textColor = greyed ? "#94a3b8" : "#1E293B";

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:411:17
     <div
       style={{
         background: bgColor,
-        border: `1px solid ${borderColor}`,
+        border: ``,
         borderRadius: 8,
         width: 250,

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:415:19
         borderRadius: 8,
         width: 250,
         padding: "10px 10px",
-        position: "relative",
+        position: "",
         textAlign: "left",
       }}

[NoCoverage] BooleanLiteral
src/main/components/ConceptGraph.tsx:423:24
         id="bottom"
         type="target"
         position={Position.Bottom}
-        isConnectable={false}
+        isConnectable={true}
         style={{ opacity: 0, pointerEvents: "none" }}
       />

[NoCoverage] ObjectLiteral
src/main/components/ConceptGraph.tsx:424:16
         type="target"
         position={Position.Bottom}
         isConnectable={false}
-        style={{ opacity: 0, pointerEvents: "none" }}
+        style={{}}
       />
 

[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:429:25
 
       {/* X button */}
       <div
-        onClick={(e) => {
-          e.stopPropagation();
-          onDelete(id);
-        }}
+        onClick={(e) => {}}
         onMouseEnter={() => setCloseHovered(true)}
         onMouseLeave={() => setCloseHovered(false)}

[NoCoverage] BooleanLiteral
src/main/components/ConceptGraph.tsx:433:45
           e.stopPropagation();
           onDelete(id);
         }}
-        onMouseEnter={() => setCloseHovered(true)}
+        onMouseEnter={() => setCloseHovered(false)}
         onMouseLeave={() => setCloseHovered(false)}
         style={{

[NoCoverage] ArrowFunction
src/main/components/ConceptGraph.tsx:433:23
           e.stopPropagation();
           onDelete(id);
         }}
-        onMouseEnter={() => setCloseHovered(true)}
+        onMouseEnter={() => undefined}
         onMouseLeave={() => setCloseHovered(false)}
         style={{

[NoCoverage] ArrowFunction
src/main/components/ConceptGraph.tsx:434:23
           onDelete(id);
         }}
         onMouseEnter={() => setCloseHovered(true)}
-        onMouseLeave={() => setCloseHovered(false)}
+        onMouseLeave={() => undefined}
         style={{
           position: "absolute",

[NoCoverage] BooleanLiteral
src/main/components/ConceptGraph.tsx:434:45
           onDelete(id);
         }}
         onMouseEnter={() => setCloseHovered(true)}
-        onMouseLeave={() => setCloseHovered(false)}
+        onMouseLeave={() => setCloseHovered(true)}
         style={{
           position: "absolute",

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:444:24
           borderRadius: 5,
           borderTop: "1.5px solid #1E293B",
           borderLeft: "1.5px solid #1E293B",
-          borderRight: "3px solid #1E293B",
+          borderRight: "",
           borderBottom: "3px solid #1E293B",
           background: closeHovered ? "#ef4444" : "#ffffff",

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:446:50
           borderLeft: "1.5px solid #1E293B",
           borderRight: "3px solid #1E293B",
           borderBottom: "3px solid #1E293B",
-          background: closeHovered ? "#ef4444" : "#ffffff",
+          background: closeHovered ? "#ef4444" : "",
           display: "flex",
           alignItems: "center",

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:447:20
           borderRight: "3px solid #1E293B",
           borderBottom: "3px solid #1E293B",
           background: closeHovered ? "#ef4444" : "#ffffff",
-          display: "flex",
+          display: "",
           alignItems: "center",
           justifyContent: "center",

[NoCoverage] ObjectLiteral
src/main/components/ConceptGraph.tsx:472:16
 
       {/* Pill label */}
       <span
-        style={{
-          background: pillBg,
-          borderRadius: 100,
-          padding: "2px 10px",
-          border: `1px solid ${borderColor}`,
-          fontFamily: "Helvetica, Arial, sans-serif",
-          fontSize: 15,
-          fontWeight: 700,
-          color: textColor,
-          whiteSpace: "nowrap",
-          display: "inline-block",
-          marginBottom: 6,
-          marginRight: 20,
-        }}
+        style={{}}
       >
         {cardType}

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:475:20
         style={{
           background: pillBg,
           borderRadius: 100,
-          padding: "2px 10px",
+          padding: "",
           border: `1px solid ${borderColor}`,
           fontFamily: "Helvetica, Arial, sans-serif",

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:476:19
           background: pillBg,
           borderRadius: 100,
           padding: "2px 10px",
-          border: `1px solid ${borderColor}`,
+          border: ``,
           fontFamily: "Helvetica, Arial, sans-serif",
           fontSize: 15,
