[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:477:23
           borderRadius: 100,
           padding: "2px 10px",
           border: `1px solid ${borderColor}`,
-          fontFamily: "Helvetica, Arial, sans-serif",
+          fontFamily: "",
           fontSize: 15,
           fontWeight: 700,

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:481:23
           fontSize: 15,
           fontWeight: 700,
           color: textColor,
-          whiteSpace: "nowrap",
+          whiteSpace: "",
           display: "inline-block",
           marginBottom: 6,

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:494:23
       <div
         style={{
           paddingLeft: 6,
-          fontFamily: "Helvetica, Arial, sans-serif",
+          fontFamily: "",
           fontSize: 13,
           fontWeight: 700,

[NoCoverage] ObjectLiteral
src/main/components/ConceptGraph.tsx:506:16
 
       {/* Content */}
       <div
-        style={{
-          paddingLeft: 6,
-          paddingRight: 6,
-          fontFamily: "Helvetica, Arial, sans-serif",
-          fontSize: 13,
-          color: textColor,
-          lineHeight: 1.5,
-        }}
+        style={{}}
       >
         {cardType === "Example" ? (

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:509:23
         style={{
           paddingLeft: 6,
           paddingRight: 6,
-          fontFamily: "Helvetica, Arial, sans-serif",
+          fontFamily: "",
           fontSize: 13,
           color: textColor,

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:515:10
           lineHeight: 1.5,
         }}
       >
-        {cardType === "Example" ? (
+        {false ? (
           <pre
             style={{

[NoCoverage] EqualityOperator
src/main/components/ConceptGraph.tsx:515:10
           lineHeight: 1.5,
         }}
       >
-        {cardType === "Example" ? (
+        {cardType !== "Example" ? (
           <pre
             style={{

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:518:27
         {cardType === "Example" ? (
           <pre
             style={{
-              fontFamily: "monospace",
+              fontFamily: "",
               fontSize: 12,
               background: "#e2e8f0",

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:520:27
             style={{
               fontFamily: "monospace",
               fontSize: 12,
-              background: "#e2e8f0",
+              background: "",
               border: "1px solid #000000",
               borderRadius: 6,

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:530:14
               lineHeight: 1.5,
             }}
           >
-            {(data.cardContent as string) ||
-              `Example for "${itemLabel}" will appear here.`}
+            {false}
           </pre>
         ) : (

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:530:14
               lineHeight: 1.5,
             }}
           >
-            {(data.cardContent as string) ||
-              `Example for "${itemLabel}" will appear here.`}
+            {true}
           </pre>
         ) : (

[NoCoverage] LogicalOperator
src/main/components/ConceptGraph.tsx:542:14
               lineHeight: 1.5,
             }}
           >
-            {(data.cardContent as string) ||
-              `${cardType} for "${itemLabel}" will appear here.`}
+            {data.cardContent as string && `${cardType} for "${itemLabel}" will appear here.`}
           </div>
         )}

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:542:14
               lineHeight: 1.5,
             }}
           >
-            {(data.cardContent as string) ||
-              `${cardType} for "${itemLabel}" will appear here.`}
+            {true}
           </div>
         )}

[NoCoverage] EqualityOperator
src/main/components/ConceptGraph.tsx:577:24
 }: ConceptGraphProps) {
   const [nodes, setNodes, onNodesChange] = useNodesState(initialNodes);
   const [edges, setEdges, onEdgesChange] = useEdgesState(initialEdges);
-  const hasSelection = highlightedIds.size > 0;
+  const hasSelection = highlightedIds.size <= 0;
   const restoredRef = useRef(false);
   const nodesRef = useRef(nodes);

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:577:24
 }: ConceptGraphProps) {
   const [nodes, setNodes, onNodesChange] = useNodesState(initialNodes);
   const [edges, setEdges, onEdgesChange] = useEdgesState(initialEdges);
-  const hasSelection = highlightedIds.size > 0;
+  const hasSelection = true;
   const restoredRef = useRef(false);
   const nodesRef = useRef(nodes);

[NoCoverage] BooleanLiteral
src/main/components/ConceptGraph.tsx:578:30
   const [nodes, setNodes, onNodesChange] = useNodesState(initialNodes);
   const [edges, setEdges, onEdgesChange] = useEdgesState(initialEdges);
   const hasSelection = highlightedIds.size > 0;
-  const restoredRef = useRef(false);
+  const restoredRef = useRef(true);
   const nodesRef = useRef(nodes);
   useEffect(() => {

[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:580:19
   const hasSelection = highlightedIds.size > 0;
   const restoredRef = useRef(false);
   const nodesRef = useRef(nodes);
-  useEffect(() => {
-    nodesRef.current = nodes;
-  }, [nodes]);
+  useEffect(() => {}, [nodes]);
 
   const highlightedIdsRef = useRef(highlightedIds);

[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:585:19
   }, [nodes]);
 
   const highlightedIdsRef = useRef(highlightedIds);
-  useEffect(() => {
-    highlightedIdsRef.current = highlightedIds;
-  }, [highlightedIds]);
+  useEffect(() => {}, [highlightedIds]);
 
   useEffect(() => {

[NoCoverage] ArrayDeclaration
src/main/components/ConceptGraph.tsx:587:6
   const highlightedIdsRef = useRef(highlightedIds);
   useEffect(() => {
     highlightedIdsRef.current = highlightedIds;
-  }, [highlightedIds]);
+  }, []);
 
   useEffect(() => {

[NoCoverage] LogicalOperator
src/main/components/ConceptGraph.tsx:590:9
   }, [highlightedIds]);
 
   useEffect(() => {
-    if (restoredRef.current || !restoredDetailCards?.length) return;
+    if (restoredRef.current && !restoredDetailCards?.length) return;
     restoredRef.current = true;
 

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:590:9
   }, [highlightedIds]);
 
   useEffect(() => {
-    if (restoredRef.current || !restoredDetailCards?.length) return;
+    if (true) return;
     restoredRef.current = true;
 

[NoCoverage] BooleanLiteral
src/main/components/ConceptGraph.tsx:591:27
 
   useEffect(() => {
     if (restoredRef.current || !restoredDetailCards?.length) return;
-    restoredRef.current = true;
+    restoredRef.current = false;
 
     const newNodes = restoredDetailCards.map((card, i) => {

[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:593:59
     if (restoredRef.current || !restoredDetailCards?.length) return;
     restoredRef.current = true;
 
-    const newNodes = restoredDetailCards.map((card, i) => {
-      const concept = majorConcepts.find((c) => c.id === card.conceptId);
-      const conceptLabel = concept?.label.replace(/\n/g, " ") ?? "";
-      const isConceptItself = card.itemLabel === conceptLabel;
-      const contentKey = isConceptItself
-        ? card.conceptId
-        : `${card.conceptId}:${card.itemLabel}`;
-      const cardContent =
-        conceptContent[contentKey]?.[cardKeyMap[card.cardType]] ?? "";
-
-      return {
-        id: `detail-restored-${i}-${card.cardType}-${card.itemLabel}`,
-        type: "detail" as const,
-        position: { x: card.posX, y: card.posY },
-        data: {
-          cardType: card.cardType,
-          itemLabel: card.itemLabel,
-          conceptId: card.conceptId,
-          conceptColor: card.conceptColor,
-          cardContent,
-        },
-      };
-    });
+    const newNodes = restoredDetailCards.map((card, i) => {});
     const newEdges = restoredDetailCards.map((card, i) => ({
       id: `edge-restored-${i}`,

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:594:49
     restoredRef.current = true;
 
     const newNodes = restoredDetailCards.map((card, i) => {
-      const concept = majorConcepts.find((c) => c.id === card.conceptId);
+      const concept = majorConcepts.find((c) => true);
       const conceptLabel = concept?.label.replace(/\n/g, " ") ?? "";
       const isConceptItself = card.itemLabel === conceptLabel;

[NoCoverage] EqualityOperator
src/main/components/ConceptGraph.tsx:594:49
     restoredRef.current = true;
 
     const newNodes = restoredDetailCards.map((card, i) => {
-      const concept = majorConcepts.find((c) => c.id === card.conceptId);
+      const concept = majorConcepts.find((c) => c.id !== card.conceptId);
       const conceptLabel = concept?.label.replace(/\n/g, " ") ?? "";
       const isConceptItself = card.itemLabel === conceptLabel;

[NoCoverage] LogicalOperator
src/main/components/ConceptGraph.tsx:595:28
 
     const newNodes = restoredDetailCards.map((card, i) => {
       const concept = majorConcepts.find((c) => c.id === card.conceptId);
-      const conceptLabel = concept?.label.replace(/\n/g, " ") ?? "";
+      const conceptLabel = concept?.label.replace(/\n/g, " ") && "";
       const isConceptItself = card.itemLabel === conceptLabel;
       const contentKey = isConceptItself

[NoCoverage] OptionalChaining
src/main/components/ConceptGraph.tsx:595:28
 
     const newNodes = restoredDetailCards.map((card, i) => {
       const concept = majorConcepts.find((c) => c.id === card.conceptId);
-      const conceptLabel = concept?.label.replace(/\n/g, " ") ?? "";
+      const conceptLabel = concept.label.replace(/\n/g, " ") ?? "";
       const isConceptItself = card.itemLabel === conceptLabel;
       const contentKey = isConceptItself

[NoCoverage] EqualityOperator
src/main/components/ConceptGraph.tsx:596:31
     const newNodes = restoredDetailCards.map((card, i) => {
       const concept = majorConcepts.find((c) => c.id === card.conceptId);
       const conceptLabel = concept?.label.replace(/\n/g, " ") ?? "";
-      const isConceptItself = card.itemLabel === conceptLabel;
+      const isConceptItself = card.itemLabel !== conceptLabel;
       const contentKey = isConceptItself
         ? card.conceptId

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:596:31
     const newNodes = restoredDetailCards.map((card, i) => {
       const concept = majorConcepts.find((c) => c.id === card.conceptId);
       const conceptLabel = concept?.label.replace(/\n/g, " ") ?? "";
-      const isConceptItself = card.itemLabel === conceptLabel;
+      const isConceptItself = false;
       const contentKey = isConceptItself
         ? card.conceptId

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:599:11
       const isConceptItself = card.itemLabel === conceptLabel;
       const contentKey = isConceptItself
         ? card.conceptId
-        : `${card.conceptId}:${card.itemLabel}`;
+        : ``;
       const cardContent =
         conceptContent[contentKey]?.[cardKeyMap[card.cardType]] ?? "";

[NoCoverage] LogicalOperator
src/main/components/ConceptGraph.tsx:601:9
         ? card.conceptId
         : `${card.conceptId}:${card.itemLabel}`;
       const cardContent =
-        conceptContent[contentKey]?.[cardKeyMap[card.cardType]] ?? "";
+        conceptContent[contentKey]?.[cardKeyMap[card.cardType]] && "";
 
       return {

[NoCoverage] OptionalChaining
src/main/components/ConceptGraph.tsx:601:9
         ? card.conceptId
         : `${card.conceptId}:${card.itemLabel}`;
       const cardContent =
-        conceptContent[contentKey]?.[cardKeyMap[card.cardType]] ?? "";
+        conceptContent[contentKey][cardKeyMap[card.cardType]] ?? "";
 
       return {

[NoCoverage] ObjectLiteral
src/main/components/ConceptGraph.tsx:606:19
       return {
         id: `detail-restored-${i}-${card.cardType}-${card.itemLabel}`,
         type: "detail" as const,
-        position: { x: card.posX, y: card.posY },
+        position: {},
         data: {
           cardType: card.cardType,

[NoCoverage] ArrowFunction
src/main/components/ConceptGraph.tsx:616:46
         },
       };
     });
-    const newEdges = restoredDetailCards.map((card, i) => ({
-      id: `edge-restored-${i}`,
-      source: card.conceptId,
-      target: newNodes[i].id,
-      targetHandle: "bottom",
-      type: "smooth",
-      style: {
-        stroke: card.conceptColor,
-        strokeWidth: 4,
-        strokeDasharray: "4 2",
-      },
-      markerEnd: { type: MarkerType.ArrowClosed, color: card.conceptColor },
-      data: { conceptColor: card.conceptColor },
-    }));
+    const newEdges = restoredDetailCards.map(() => undefined);
 
     setNodes((prev) => [...prev, ...newNodes]);

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:620:21
       id: `edge-restored-${i}`,
       source: card.conceptId,
       target: newNodes[i].id,
-      targetHandle: "bottom",
+      targetHandle: "",
       type: "smooth",
       style: {

[NoCoverage] ObjectLiteral
src/main/components/ConceptGraph.tsx:627:18
         strokeWidth: 4,
         strokeDasharray: "4 2",
       },
-      markerEnd: { type: MarkerType.ArrowClosed, color: card.conceptColor },
+      markerEnd: {},
       data: { conceptColor: card.conceptColor },
     }));

[NoCoverage] ObjectLiteral
src/main/components/ConceptGraph.tsx:628:13
         strokeDasharray: "4 2",
       },
       markerEnd: { type: MarkerType.ArrowClosed, color: card.conceptColor },
-      data: { conceptColor: card.conceptColor },
+      data: {},
     }));
 

[NoCoverage] ArrowFunction
src/main/components/ConceptGraph.tsx:631:14
       data: { conceptColor: card.conceptColor },
     }));
 
-    setNodes((prev) => [...prev, ...newNodes]);
+    setNodes(() => undefined);
     setEdges((prev) => [...prev, ...newEdges]);
   }, [restoredDetailCards, setNodes, setEdges]);

[NoCoverage] ArrowFunction
src/main/components/ConceptGraph.tsx:632:14
     }));
 
     setNodes((prev) => [...prev, ...newNodes]);
-    setEdges((prev) => [...prev, ...newEdges]);
+    setEdges(() => undefined);
   }, [restoredDetailCards, setNodes, setEdges]);
 

[NoCoverage] ArrayDeclaration
src/main/components/ConceptGraph.tsx:632:24
     }));
 
     setNodes((prev) => [...prev, ...newNodes]);
-    setEdges((prev) => [...prev, ...newEdges]);
+    setEdges((prev) => []);
   }, [restoredDetailCards, setNodes, setEdges]);
 

[NoCoverage] ArrayDeclaration
src/main/components/ConceptGraph.tsx:633:6
 
     setNodes((prev) => [...prev, ...newNodes]);
     setEdges((prev) => [...prev, ...newEdges]);
-  }, [restoredDetailCards, setNodes, setEdges]);
+  }, []);
 
   const rfInstance = useRef<ReactFlowInstance<Node, Edge> | null>(null);

[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:637:41
 
   const rfInstance = useRef<ReactFlowInstance<Node, Edge> | null>(null);
 
-  const handleReset = useCallback(() => {
-    setNodes(initialNodes);
-    setEdges(initialEdges);
-    onReset();
-    setTimeout(() => rfInstance.current?.fitView({ padding: 0.08 }), 50);
-  }, [onReset, setNodes, setEdges]);
+  const handleReset = useCallback(() => {}, [onReset, setNodes, setEdges]);
 
   const handleDeleteDetail = useCallback(

[NoCoverage] OptionalChaining
src/main/components/ConceptGraph.tsx:641:22
     setNodes(initialNodes);
     setEdges(initialEdges);
     onReset();
-    setTimeout(() => rfInstance.current?.fitView({ padding: 0.08 }), 50);
+    setTimeout(() => rfInstance.current.fitView({ padding: 0.08 }), 50);
   }, [onReset, setNodes, setEdges]);
 

[NoCoverage] ArrowFunction
src/main/components/ConceptGraph.tsx:641:16
     setNodes(initialNodes);
     setEdges(initialEdges);
     onReset();
-    setTimeout(() => rfInstance.current?.fitView({ padding: 0.08 }), 50);
+    setTimeout(() => undefined, 50);
   }, [onReset, setNodes, setEdges]);
 

[NoCoverage] ArrayDeclaration
src/main/components/ConceptGraph.tsx:642:6
     setEdges(initialEdges);
     onReset();
     setTimeout(() => rfInstance.current?.fitView({ padding: 0.08 }), 50);
-  }, [onReset, setNodes, setEdges]);
+  }, []);
 
   const handleDeleteDetail = useCallback(

[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:645:21
   }, [onReset, setNodes, setEdges]);
 
   const handleDeleteDetail = useCallback(
-    (id: string) => {
-      setNodes((nds) => {
-        const node = nds.find((n) => n.id === id);
-        if (node?.data) {
-          onDetailDeleted?.(
-            node.data.cardType as string,
-            node.data.itemLabel as string,
-          );
-        }
-        return nds.filter((n) => n.id !== id);
-      });
-      setEdges((eds) => eds.filter((e) => e.source !== id && e.target !== id));
-    },
+    (id: string) => {},
     [setNodes, setEdges, onDetailDeleted],
   );

[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:646:25
 
   const handleDeleteDetail = useCallback(
     (id: string) => {
-      setNodes((nds) => {
-        const node = nds.find((n) => n.id === id);
-        if (node?.data) {
-          onDetailDeleted?.(
-            node.data.cardType as string,
-            node.data.itemLabel as string,
-          );
-        }
-        return nds.filter((n) => n.id !== id);
-      });
+      setNodes((nds) => {});
       setEdges((eds) => eds.filter((e) => e.source !== id && e.target !== id));
     },

[NoCoverage] EqualityOperator
src/main/components/ConceptGraph.tsx:647:38
   const handleDeleteDetail = useCallback(
     (id: string) => {
       setNodes((nds) => {
-        const node = nds.find((n) => n.id === id);
+        const node = nds.find((n) => n.id !== id);
         if (node?.data) {
           onDetailDeleted?.(

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:647:38
   const handleDeleteDetail = useCallback(
     (id: string) => {
       setNodes((nds) => {
-        const node = nds.find((n) => n.id === id);
+        const node = nds.find((n) => false);
         if (node?.data) {
           onDetailDeleted?.(

[NoCoverage] OptionalChaining
src/main/components/ConceptGraph.tsx:648:13
     (id: string) => {
       setNodes((nds) => {
         const node = nds.find((n) => n.id === id);
-        if (node?.data) {
+        if (node.data) {
           onDetailDeleted?.(
             node.data.cardType as string,

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:648:13
     (id: string) => {
       setNodes((nds) => {
         const node = nds.find((n) => n.id === id);
-        if (node?.data) {
+        if (true) {
           onDetailDeleted?.(
             node.data.cardType as string,

[NoCoverage] OptionalChaining
src/main/components/ConceptGraph.tsx:649:11
       setNodes((nds) => {
         const node = nds.find((n) => n.id === id);
         if (node?.data) {
-          onDetailDeleted?.(
-            node.data.cardType as string,
-            node.data.itemLabel as string,
-          );
+          onDetailDeleted(node.data.cardType as string, node.data.itemLabel as string);
         }
         return nds.filter((n) => n.id !== id);

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:654:34
             node.data.itemLabel as string,
           );
         }
-        return nds.filter((n) => n.id !== id);
+        return nds.filter((n) => false);
       });
       setEdges((eds) => eds.filter((e) => e.source !== id && e.target !== id));

[NoCoverage] MethodExpression
src/main/components/ConceptGraph.tsx:654:16
             node.data.itemLabel as string,
           );
         }
-        return nds.filter((n) => n.id !== id);
+        return nds;
       });
       setEdges((eds) => eds.filter((e) => e.source !== id && e.target !== id));

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:656:43
         }
         return nds.filter((n) => n.id !== id);
       });
-      setEdges((eds) => eds.filter((e) => e.source !== id && e.target !== id));
+      setEdges((eds) => eds.filter((e) => false));
     },
     [setNodes, setEdges, onDetailDeleted],

[NoCoverage] LogicalOperator
src/main/components/ConceptGraph.tsx:656:43
         }
         return nds.filter((n) => n.id !== id);
       });
-      setEdges((eds) => eds.filter((e) => e.source !== id && e.target !== id));
+      setEdges((eds) => eds.filter((e) => e.source !== id || e.target !== id));
     },
     [setNodes, setEdges, onDetailDeleted],

[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:661:58
     [setNodes, setEdges, onDetailDeleted],
   );
 
-  const onDragOver = useCallback((e: React.DragEvent) => {
-    e.preventDefault();
-    e.dataTransfer.dropEffect = "move";
-  }, []);
+  const onDragOver = useCallback((e: React.DragEvent) => {}, []);
 
   const onDrop = useCallback(

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:670:11
     (e: React.DragEvent) => {
       e.preventDefault();
       const raw = e.dataTransfer.getData("application/scaffold-card");
-      if (!raw) return;
+      if (true) return;
 
       const { cardType, itemLabel, conceptId, conceptColor, cardContent } =

[NoCoverage] BooleanLiteral
src/main/components/ConceptGraph.tsx:670:11
     (e: React.DragEvent) => {
       e.preventDefault();
       const raw = e.dataTransfer.getData("application/scaffold-card");
-      if (!raw) return;
+      if (raw) return;
 
       const { cardType, itemLabel, conceptId, conceptColor, cardContent } =

[NoCoverage] OptionalChaining
src/main/components/ConceptGraph.tsx:674:24
 
       const { cardType, itemLabel, conceptId, conceptColor, cardContent } =
         JSON.parse(raw);
-      const position = rfInstance.current?.screenToFlowPosition({
+      const position = rfInstance.current.screenToFlowPosition({
         x: e.clientX,
         y: e.clientY,

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:678:11
         x: e.clientX,
         y: e.clientY,
       });
-      if (!position) return;
+      if (true) return;
 
       const nodeId = `detail-${Date.now()}`;

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:678:11
         x: e.clientX,
         y: e.clientY,
       });
-      if (!position) return;
+      if (false) return;
 
       const nodeId = `detail-${Date.now()}`;

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:680:22
       });
       if (!position) return;
 
-      const nodeId = `detail-${Date.now()}`;
+      const nodeId = ``;
 
       const isHighlighted = highlightedIdsRef.current.has(conceptId);

[NoCoverage] EqualityOperator
src/main/components/ConceptGraph.tsx:683:31
       const nodeId = `detail-${Date.now()}`;
 
       const isHighlighted = highlightedIdsRef.current.has(conceptId);
-      const hasSelectionNow = highlightedIdsRef.current.size > 0;
+      const hasSelectionNow = highlightedIdsRef.current.size >= 0;
       const edgeColor =
         hasSelectionNow && !isHighlighted ? "#cbd5e1" : conceptColor;

[NoCoverage] EqualityOperator
src/main/components/ConceptGraph.tsx:683:31
       const nodeId = `detail-${Date.now()}`;
 
       const isHighlighted = highlightedIdsRef.current.has(conceptId);
-      const hasSelectionNow = highlightedIdsRef.current.size > 0;
+      const hasSelectionNow = highlightedIdsRef.current.size <= 0;
       const edgeColor =
         hasSelectionNow && !isHighlighted ? "#cbd5e1" : conceptColor;

[NoCoverage] BooleanLiteral
src/main/components/ConceptGraph.tsx:685:28
       const isHighlighted = highlightedIdsRef.current.has(conceptId);
       const hasSelectionNow = highlightedIdsRef.current.size > 0;
       const edgeColor =
-        hasSelectionNow && !isHighlighted ? "#cbd5e1" : conceptColor;
+        hasSelectionNow && isHighlighted ? "#cbd5e1" : conceptColor;
 
       setNodes((nds) => [

[NoCoverage] LogicalOperator
src/main/components/ConceptGraph.tsx:685:9
       const isHighlighted = highlightedIdsRef.current.has(conceptId);
       const hasSelectionNow = highlightedIdsRef.current.size > 0;
       const edgeColor =
-        hasSelectionNow && !isHighlighted ? "#cbd5e1" : conceptColor;
+        hasSelectionNow || !isHighlighted ? "#cbd5e1" : conceptColor;
 
       setNodes((nds) => [

[NoCoverage] ArrowFunction
src/main/components/ConceptGraph.tsx:687:16
       const edgeColor =
         hasSelectionNow && !isHighlighted ? "#cbd5e1" : conceptColor;
 
-      setNodes((nds) => [
-        ...nds,
-        {
-          id: nodeId,
-          type: "detail",
-          position,
-          data: { cardType, itemLabel, conceptColor, cardContent, conceptId },
-        },
-      ]);
+      setNodes(() => undefined);
 
       setEdges((eds) => [

[NoCoverage] ObjectLiteral
src/main/components/ConceptGraph.tsx:689:9
 
       setNodes((nds) => [
         ...nds,
-        {
-          id: nodeId,
-          type: "detail",
-          position,
-          data: { cardType, itemLabel, conceptColor, cardContent, conceptId },
-        },
+        {},
       ]);
 

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:691:17
         ...nds,
         {
           id: nodeId,
-          type: "detail",
+          type: "",
           position,
           data: { cardType, itemLabel, conceptColor, cardContent, conceptId },

[NoCoverage] ArrowFunction
src/main/components/ConceptGraph.tsx:697:16
         },
       ]);
 
-      setEdges((eds) => [
-        ...eds,
-        {
-          id: `detail-edge-${nodeId}`,
-          source: conceptId,
-          target: nodeId,
-          targetHandle: "bottom",
-          type: "smooth",
-          style: { stroke: edgeColor, strokeWidth: 4, strokeDasharray: "4 2" },
-          markerEnd: { type: MarkerType.ArrowClosed, color: edgeColor },
-          data: { conceptColor },
-        },
-      ]);
+      setEdges(() => undefined);
 
       onDetailAdded?.({

[NoCoverage] ArrayDeclaration
src/main/components/ConceptGraph.tsx:697:25
         },
       ]);
 
-      setEdges((eds) => [
-        ...eds,
-        {
-          id: `detail-edge-${nodeId}`,
-          source: conceptId,
-          target: nodeId,
-          targetHandle: "bottom",
-          type: "smooth",
-          style: { stroke: edgeColor, strokeWidth: 4, strokeDasharray: "4 2" },
-          markerEnd: { type: MarkerType.ArrowClosed, color: edgeColor },
-          data: { conceptColor },
-        },
-      ]);
+      setEdges((eds) => []);
 
       onDetailAdded?.({

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:700:15
       setEdges((eds) => [
         ...eds,
         {
-          id: `detail-edge-${nodeId}`,
+          id: ``,
           source: conceptId,
           target: nodeId,

[NoCoverage] OptionalChaining
src/main/components/ConceptGraph.tsx:711:7
         },
       ]);
 
-      onDetailAdded?.({
-        cardType,
-        itemLabel,
-        conceptId,
-        conceptColor,
-        posX: position.x,
-        posY: position.y,
-      });
+      onDetailAdded({
+  cardType,
+  itemLabel,
+  conceptId,
+  conceptColor,
+  posX: position.x,
+  posY: position.y
+});
     },
     [setNodes, setEdges, onDetailAdded],

[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:726:25
   // Update node appearance when highlighted set changes
   useEffect(() => {
     setNodes((nds) =>
-      nds.map((node) => {
-        if (node.type === "detail") {
-          const greyed =
-            hasSelection && !highlightedIds.has(node.data.conceptId as string);
-          return {
-            ...node,
-            style: { ...node.style, opacity: greyed ? 0.5 : 1 },
-            data: { ...node.data, greyed },
-          };
-        }
-        return {
-          ...node,
-          data: {
-            ...node.data,
-            highlighted: highlightedIds.has(node.id),
-            hasSelection,
-            highlightedSubconcepts:
-              highlightedSubconcepts.get(node.id) ?? new Set(),
-            starred: starredIds.has(node.id),
-            onStarClick: () => onStarClick(node.id),
-            masteredSubconcepts: masteredSubconcepts,
-            onSubconceptMastered: (sub: string) => onSubconceptMastered(sub),
-          },
-        };
-      }),
+      nds.map((node) => {}),
     );
   }, [

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:727:13
   useEffect(() => {
     setNodes((nds) =>
       nds.map((node) => {
-        if (node.type === "detail") {
+        if (true) {
           const greyed =
             hasSelection && !highlightedIds.has(node.data.conceptId as string);

[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:727:37
   useEffect(() => {
     setNodes((nds) =>
       nds.map((node) => {
-        if (node.type === "detail") {
-          const greyed =
-            hasSelection && !highlightedIds.has(node.data.conceptId as string);
-          return {
-            ...node,
-            style: { ...node.style, opacity: greyed ? 0.5 : 1 },
-            data: { ...node.data, greyed },
-          };
-        }
+        if (node.type === "detail") {}
         return {
           ...node,

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:729:13
       nds.map((node) => {
         if (node.type === "detail") {
           const greyed =
-            hasSelection && !highlightedIds.has(node.data.conceptId as string);
+            true;
           return {
             ...node,

[NoCoverage] LogicalOperator
src/main/components/ConceptGraph.tsx:729:13
       nds.map((node) => {
         if (node.type === "detail") {
           const greyed =
-            hasSelection && !highlightedIds.has(node.data.conceptId as string);
+            hasSelection || !highlightedIds.has(node.data.conceptId as string);
           return {
             ...node,
