[NoCoverage] ObjectLiteral
src/main/components/ConceptGraph.tsx:732:20
             hasSelection && !highlightedIds.has(node.data.conceptId as string);
           return {
             ...node,
-            style: { ...node.style, opacity: greyed ? 0.5 : 1 },
+            style: {},
             data: { ...node.data, greyed },
           };

[NoCoverage] ObjectLiteral
src/main/components/ConceptGraph.tsx:736:16
             data: { ...node.data, greyed },
           };
         }
-        return {
-          ...node,
-          data: {
-            ...node.data,
-            highlighted: highlightedIds.has(node.id),
-            hasSelection,
-            highlightedSubconcepts:
-              highlightedSubconcepts.get(node.id) ?? new Set(),
-            starred: starredIds.has(node.id),
-            onStarClick: () => onStarClick(node.id),
-            masteredSubconcepts: masteredSubconcepts,
-            onSubconceptMastered: (sub: string) => onSubconceptMastered(sub),
-          },
-        };
+        return {};
       }),
     );

[NoCoverage] ObjectLiteral
src/main/components/ConceptGraph.tsx:738:17
         }
         return {
           ...node,
-          data: {
-            ...node.data,
-            highlighted: highlightedIds.has(node.id),
-            hasSelection,
-            highlightedSubconcepts:
-              highlightedSubconcepts.get(node.id) ?? new Set(),
-            starred: starredIds.has(node.id),
-            onStarClick: () => onStarClick(node.id),
-            masteredSubconcepts: masteredSubconcepts,
-            onSubconceptMastered: (sub: string) => onSubconceptMastered(sub),
-          },
+          data: {},
         };
       }),

[NoCoverage] LogicalOperator
src/main/components/ConceptGraph.tsx:743:15
             highlighted: highlightedIds.has(node.id),
             hasSelection,
             highlightedSubconcepts:
-              highlightedSubconcepts.get(node.id) ?? new Set(),
+              highlightedSubconcepts.get(node.id) && new Set(),
             starred: starredIds.has(node.id),
             onStarClick: () => onStarClick(node.id),

[NoCoverage] ArrowFunction
src/main/components/ConceptGraph.tsx:745:26
             highlightedSubconcepts:
               highlightedSubconcepts.get(node.id) ?? new Set(),
             starred: starredIds.has(node.id),
-            onStarClick: () => onStarClick(node.id),
+            onStarClick: () => undefined,
             masteredSubconcepts: masteredSubconcepts,
             onSubconceptMastered: (sub: string) => onSubconceptMastered(sub),

[NoCoverage] ArrowFunction
src/main/components/ConceptGraph.tsx:747:35
             starred: starredIds.has(node.id),
             onStarClick: () => onStarClick(node.id),
             masteredSubconcepts: masteredSubconcepts,
-            onSubconceptMastered: (sub: string) => onSubconceptMastered(sub),
+            onSubconceptMastered: () => undefined,
           },
         };

[NoCoverage] ArrayDeclaration
src/main/components/ConceptGraph.tsx:752:6
         };
       }),
     );
-  }, [
-    highlightedIds,
-    hasSelection,
-    highlightedSubconcepts,
-    starredIds,
-    masteredSubconcepts,
-    onSubconceptMastered,
-    onStarClick,
-    setNodes,
-  ]);
+  }, []);
 
   // Update edge appearance when highlighted set changes

[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:765:24
 
   // Update edge appearance when highlighted set changes
   useEffect(() => {
-    if (!hasSelection) {
-      setEdges((eds) => [
-        ...initialEdges,
-        ...eds
-          .filter(
-            (e) =>
-              e.id.startsWith("detail-edge-") ||
-              e.id.startsWith("edge-restored-"),
-          )
-          .map((e) => {
-            const color = (e.data?.conceptColor as string) ?? "#64748B";
-            return {
-              ...e,
-              style: { stroke: color, strokeWidth: 4, strokeDasharray: "4 2" },
-              markerEnd: { type: MarkerType.ArrowClosed, color },
-            };
-          }),
-      ]);
-      return;
-    }
+    if (!hasSelection) {}
     setEdges((eds) => [
       ...prereqEdgeData.map((e) => {

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:765:9
 
   // Update edge appearance when highlighted set changes
   useEffect(() => {
-    if (!hasSelection) {
+    if (false) {
       setEdges((eds) => [
         ...initialEdges,

[NoCoverage] ArrowFunction
src/main/components/ConceptGraph.tsx:766:16
   // Update edge appearance when highlighted set changes
   useEffect(() => {
     if (!hasSelection) {
-      setEdges((eds) => [
-        ...initialEdges,
-        ...eds
-          .filter(
-            (e) =>
-              e.id.startsWith("detail-edge-") ||
-              e.id.startsWith("edge-restored-"),
-          )
-          .map((e) => {
-            const color = (e.data?.conceptColor as string) ?? "#64748B";
-            return {
-              ...e,
-              style: { stroke: color, strokeWidth: 4, strokeDasharray: "4 2" },
-              markerEnd: { type: MarkerType.ArrowClosed, color },
-            };
-          }),
-      ]);
+      setEdges(() => undefined);
       return;
     }

[NoCoverage] MethodExpression
src/main/components/ConceptGraph.tsx:768:12
     if (!hasSelection) {
       setEdges((eds) => [
         ...initialEdges,
-        ...eds
-          .filter(
-            (e) =>
-              e.id.startsWith("detail-edge-") ||
-              e.id.startsWith("edge-restored-"),
-          )
+        ...eds
           .map((e) => {
             const color = (e.data?.conceptColor as string) ?? "#64748B";

[NoCoverage] ArrowFunction
src/main/components/ConceptGraph.tsx:770:13
         ...initialEdges,
         ...eds
           .filter(
-            (e) =>
-              e.id.startsWith("detail-edge-") ||
-              e.id.startsWith("edge-restored-"),
+            () => undefined,
           )
           .map((e) => {

[NoCoverage] LogicalOperator
src/main/components/ConceptGraph.tsx:771:15
         ...eds
           .filter(
             (e) =>
-              e.id.startsWith("detail-edge-") ||
-              e.id.startsWith("edge-restored-"),
+              e.id.startsWith("detail-edge-") && e.id.startsWith("edge-restored-"),
           )
           .map((e) => {

[NoCoverage] MethodExpression
src/main/components/ConceptGraph.tsx:771:15
         ...eds
           .filter(
             (e) =>
-              e.id.startsWith("detail-edge-") ||
+              e.id.endsWith("detail-edge-") ||
               e.id.startsWith("edge-restored-"),
           )

[NoCoverage] MethodExpression
src/main/components/ConceptGraph.tsx:772:15
           .filter(
             (e) =>
               e.id.startsWith("detail-edge-") ||
-              e.id.startsWith("edge-restored-"),
+              e.id.endsWith("edge-restored-"),
           )
           .map((e) => {

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:772:31
           .filter(
             (e) =>
               e.id.startsWith("detail-edge-") ||
-              e.id.startsWith("edge-restored-"),
+              e.id.startsWith(""),
           )
           .map((e) => {

[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:774:23
               e.id.startsWith("detail-edge-") ||
               e.id.startsWith("edge-restored-"),
           )
-          .map((e) => {
-            const color = (e.data?.conceptColor as string) ?? "#64748B";
-            return {
-              ...e,
-              style: { stroke: color, strokeWidth: 4, strokeDasharray: "4 2" },
-              markerEnd: { type: MarkerType.ArrowClosed, color },
-            };
-          }),
+          .map((e) => {}),
       ]);
       return;

[NoCoverage] LogicalOperator
src/main/components/ConceptGraph.tsx:775:27
               e.id.startsWith("edge-restored-"),
           )
           .map((e) => {
-            const color = (e.data?.conceptColor as string) ?? "#64748B";
+            const color = e.data?.conceptColor as string && "#64748B";
             return {
               ...e,

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:775:63
               e.id.startsWith("edge-restored-"),
           )
           .map((e) => {
-            const color = (e.data?.conceptColor as string) ?? "#64748B";
+            const color = (e.data?.conceptColor as string) ?? "";
             return {
               ...e,

[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:786:36
       return;
     }
     setEdges((eds) => [
-      ...prereqEdgeData.map((e) => {
-        const isHighlighted =
-          highlightedIds.has(e.source) && highlightedIds.has(e.target);
-        const color =
-          majorConcepts.find((c) => c.id === e.source)?.color ?? "#64748B";
-        return {
-          id: `prereq-${e.source}-${e.target}`,
-          source: e.source,
-          target: e.target,
-          sourceHandle: "top",
-          targetHandle: "bottom",
-          type: "dashed",
-          animated: isHighlighted,
-          style: {
-            stroke: isHighlighted ? color : "#CBD5E1",
-            strokeWidth: isHighlighted ? 5 : 4,
-            strokeDasharray: isHighlighted ? undefined : "5 3",
-            opacity: isHighlighted ? 1 : 0.2,
-          },
-          markerEnd: {
-            type: MarkerType.ArrowClosed,
-            color: isHighlighted ? color : "#CBD5E1",
-          },
-        };
-      }),
+      ...prereqEdgeData.map((e) => {}),
       ...eds
         .filter(

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:788:11
     setEdges((eds) => [
       ...prereqEdgeData.map((e) => {
         const isHighlighted =
-          highlightedIds.has(e.source) && highlightedIds.has(e.target);
+          false;
         const color =
           majorConcepts.find((c) => c.id === e.source)?.color ?? "#64748B";

[NoCoverage] LogicalOperator
src/main/components/ConceptGraph.tsx:788:11
     setEdges((eds) => [
       ...prereqEdgeData.map((e) => {
         const isHighlighted =
-          highlightedIds.has(e.source) && highlightedIds.has(e.target);
+          highlightedIds.has(e.source) || highlightedIds.has(e.target);
         const color =
           majorConcepts.find((c) => c.id === e.source)?.color ?? "#64748B";

[NoCoverage] LogicalOperator
src/main/components/ConceptGraph.tsx:790:11
         const isHighlighted =
           highlightedIds.has(e.source) && highlightedIds.has(e.target);
         const color =
-          majorConcepts.find((c) => c.id === e.source)?.color ?? "#64748B";
+          majorConcepts.find(c => c.id === e.source)?.color && "#64748B";
         return {
           id: `prereq-${e.source}-${e.target}`,

[NoCoverage] ArrowFunction
src/main/components/ConceptGraph.tsx:790:30
         const isHighlighted =
           highlightedIds.has(e.source) && highlightedIds.has(e.target);
         const color =
-          majorConcepts.find((c) => c.id === e.source)?.color ?? "#64748B";
+          majorConcepts.find(() => undefined)?.color ?? "#64748B";
         return {
           id: `prereq-${e.source}-${e.target}`,

[NoCoverage] ObjectLiteral
src/main/components/ConceptGraph.tsx:805:22
             strokeDasharray: isHighlighted ? undefined : "5 3",
             opacity: isHighlighted ? 1 : 0.2,
           },
-          markerEnd: {
-            type: MarkerType.ArrowClosed,
-            color: isHighlighted ? color : "#CBD5E1",
-          },
+          markerEnd: {},
         };
       }),

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:807:44
           },
           markerEnd: {
             type: MarkerType.ArrowClosed,
-            color: isHighlighted ? color : "#CBD5E1",
+            color: isHighlighted ? color : "",
           },
         };

[NoCoverage] MethodExpression
src/main/components/ConceptGraph.tsx:811:10
           },
         };
       }),
-      ...eds
-        .filter(
-          (e) =>
-            e.id.startsWith("detail-edge-") ||
-            e.id.startsWith("edge-restored-"),
-        )
+      ...eds
         .map((e) => {
           const isHighlighted = highlightedIds.has(e.source);

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:814:13
       ...eds
         .filter(
           (e) =>
-            e.id.startsWith("detail-edge-") ||
-            e.id.startsWith("edge-restored-"),
+            true,
         )
         .map((e) => {

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:814:13
       ...eds
         .filter(
           (e) =>
-            e.id.startsWith("detail-edge-") ||
-            e.id.startsWith("edge-restored-"),
+            false,
         )
         .map((e) => {

[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:817:21
             e.id.startsWith("detail-edge-") ||
             e.id.startsWith("edge-restored-"),
         )
-        .map((e) => {
-          const isHighlighted = highlightedIds.has(e.source);
-          const color = (e.data?.conceptColor as string) ?? "#64748B";
-          return {
-            ...e,
-            style: {
-              stroke: isHighlighted ? color : "#cbd5e1",
-              strokeWidth: 4,
-              strokeDasharray: "4 2",
-            },
-            markerEnd: {
-              type: MarkerType.ArrowClosed,
-              color: isHighlighted ? color : "#cbd5e1",
-            },
-          };
-        }),
+        .map((e) => {}),
     ]);
   }, [highlightedIds, hasSelection, setEdges]);

[NoCoverage] LogicalOperator
src/main/components/ConceptGraph.tsx:819:25
         )
         .map((e) => {
           const isHighlighted = highlightedIds.has(e.source);
-          const color = (e.data?.conceptColor as string) ?? "#64748B";
+          const color = e.data?.conceptColor as string && "#64748B";
           return {
             ...e,

[NoCoverage] ObjectLiteral
src/main/components/ConceptGraph.tsx:820:18
         .map((e) => {
           const isHighlighted = highlightedIds.has(e.source);
           const color = (e.data?.conceptColor as string) ?? "#64748B";
-          return {
-            ...e,
-            style: {
-              stroke: isHighlighted ? color : "#cbd5e1",
-              strokeWidth: 4,
-              strokeDasharray: "4 2",
-            },
-            markerEnd: {
-              type: MarkerType.ArrowClosed,
-              color: isHighlighted ? color : "#cbd5e1",
-            },
-          };
+          return {};
         }),
     ]);

[NoCoverage] ObjectLiteral
src/main/components/ConceptGraph.tsx:822:20
           const color = (e.data?.conceptColor as string) ?? "#64748B";
           return {
             ...e,
-            style: {
-              stroke: isHighlighted ? color : "#cbd5e1",
-              strokeWidth: 4,
-              strokeDasharray: "4 2",
-            },
+            style: {},
             markerEnd: {
               type: MarkerType.ArrowClosed,

[NoCoverage] ObjectLiteral
src/main/components/ConceptGraph.tsx:827:24
               strokeWidth: 4,
               strokeDasharray: "4 2",
             },
-            markerEnd: {
-              type: MarkerType.ArrowClosed,
-              color: isHighlighted ? color : "#cbd5e1",
-            },
+            markerEnd: {},
           };
         }),

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:829:46
             },
             markerEnd: {
               type: MarkerType.ArrowClosed,
-              color: isHighlighted ? color : "#cbd5e1",
+              color: isHighlighted ? color : "",
             },
           };

[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:837:43
   }, [highlightedIds, hasSelection, setEdges]);
 
   const onNodeClick = useCallback(
-    (_e: React.MouseEvent, node: Node) => {
-      if (node.type === "detail") return;
-      onConceptClick(node.id);
-    },
+    (_e: React.MouseEvent, node: Node) => {},
     [onConceptClick],
   );

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:838:11
 
   const onNodeClick = useCallback(
     (_e: React.MouseEvent, node: Node) => {
-      if (node.type === "detail") return;
+      if (false) return;
       onConceptClick(node.id);
     },

[NoCoverage] EqualityOperator
src/main/components/ConceptGraph.tsx:838:11
 
   const onNodeClick = useCallback(
     (_e: React.MouseEvent, node: Node) => {
-      if (node.type === "detail") return;
+      if (node.type !== "detail") return;
       onConceptClick(node.id);
     },

[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:845:32
   );
 
   const handleNodesChange = useCallback(
-    (changes: NodeChange[]) => {
-      onNodesChange(changes);
-      changes.forEach((change) => {
-        if (
-          change.type === "position" &&
-          change.dragging === false &&
-          change.position
-        ) {
-          const node = nodesRef.current.find((n) => n.id === change.id);
-          if (node?.type === "detail") {
-            onDetailMoved?.(
-              node.data.cardType as string,
-              node.data.itemLabel as string,
-              change.position.x,
-              change.position.y,
-            );
-          }
-        }
-      });
-    },
+    (changes: NodeChange[]) => {},
     [onNodesChange, onDetailMoved],
   );

[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:847:35
   const handleNodesChange = useCallback(
     (changes: NodeChange[]) => {
       onNodesChange(changes);
-      changes.forEach((change) => {
-        if (
-          change.type === "position" &&
-          change.dragging === false &&
-          change.position
-        ) {
-          const node = nodesRef.current.find((n) => n.id === change.id);
-          if (node?.type === "detail") {
-            onDetailMoved?.(
-              node.data.cardType as string,
-              node.data.itemLabel as string,
-              change.position.x,
-              change.position.y,
-            );
-          }
-        }
-      });
+      changes.forEach((change) => {});
     },
     [onNodesChange, onDetailMoved],

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:849:11
       onNodesChange(changes);
       changes.forEach((change) => {
         if (
-          change.type === "position" &&
-          change.dragging === false &&
-          change.position
+          true
         ) {
           const node = nodesRef.current.find((n) => n.id === change.id);

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:849:11
       onNodesChange(changes);
       changes.forEach((change) => {
         if (
-          change.type === "position" &&
-          change.dragging === false &&
+          true &&
           change.position
         ) {

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:850:11
       changes.forEach((change) => {
         if (
           change.type === "position" &&
-          change.dragging === false &&
+          true &&
           change.position
         ) {

[NoCoverage] EqualityOperator
src/main/components/ConceptGraph.tsx:850:11
       changes.forEach((change) => {
         if (
           change.type === "position" &&
-          change.dragging === false &&
+          change.dragging !== false &&
           change.position
         ) {

[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:852:11
           change.type === "position" &&
           change.dragging === false &&
           change.position
-        ) {
-          const node = nodesRef.current.find((n) => n.id === change.id);
-          if (node?.type === "detail") {
-            onDetailMoved?.(
-              node.data.cardType as string,
-              node.data.itemLabel as string,
-              change.position.x,
-              change.position.y,
-            );
-          }
-        }
+        ) {}
       });
     },

[NoCoverage] ArrowFunction
src/main/components/ConceptGraph.tsx:853:46
           change.dragging === false &&
           change.position
         ) {
-          const node = nodesRef.current.find((n) => n.id === change.id);
+          const node = nodesRef.current.find(() => undefined);
           if (node?.type === "detail") {
             onDetailMoved?.(

[NoCoverage] ConditionalExpression
src/main/components/ConceptGraph.tsx:853:53
           change.dragging === false &&
           change.position
         ) {
-          const node = nodesRef.current.find((n) => n.id === change.id);
+          const node = nodesRef.current.find((n) => true);
           if (node?.type === "detail") {
             onDetailMoved?.(

[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:854:40
           change.position
         ) {
           const node = nodesRef.current.find((n) => n.id === change.id);
-          if (node?.type === "detail") {
-            onDetailMoved?.(
-              node.data.cardType as string,
-              node.data.itemLabel as string,
-              change.position.x,
-              change.position.y,
-            );
-          }
+          if (node?.type === "detail") {}
         }
       });

[NoCoverage] OptionalChaining
src/main/components/ConceptGraph.tsx:854:15
           change.position
         ) {
           const node = nodesRef.current.find((n) => n.id === change.id);
-          if (node?.type === "detail") {
+          if (node.type === "detail") {
             onDetailMoved?.(
               node.data.cardType as string,

[NoCoverage] OptionalChaining
src/main/components/ConceptGraph.tsx:855:13
         ) {
           const node = nodesRef.current.find((n) => n.id === change.id);
           if (node?.type === "detail") {
-            onDetailMoved?.(
-              node.data.cardType as string,
-              node.data.itemLabel as string,
-              change.position.x,
-              change.position.y,
-            );
+            onDetailMoved(node.data.cardType as string, node.data.itemLabel as string, change.position.x, change.position.y);
           }
         }

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:870:62
 
   return (
     <DeleteDetailContext.Provider value={handleDeleteDetail}>
-      <div style={{ width: "100%", height: "100%", position: "relative" }}>
+      <div style={{ width: "100%", height: "100%", position: "" }}>
         <div
           style={{

[NoCoverage] ObjectLiteral
src/main/components/ConceptGraph.tsx:872:18
     <DeleteDetailContext.Provider value={handleDeleteDetail}>
       <div style={{ width: "100%", height: "100%", position: "relative" }}>
         <div
-          style={{
-            position: "absolute",
-            alignItems: "flex-end",
-            top: 12,
-            right: 12,
-            zIndex: 10,
-            display: "flex",
-            flexDirection: "column",
-            gap: 8,
-          }}
+          style={{}}
         >
           <ResetButton onReset={handleReset} />

[NoCoverage] StringLiteral
src/main/components/ConceptGraph.tsx:874:25
         <div
           style={{
             position: "absolute",
-            alignItems: "flex-end",
+            alignItems: "",
             top: 12,
             right: 12,

[NoCoverage] BooleanLiteral
src/main/components/ConceptGraph.tsx:892:29
           onNodesChange={handleNodesChange}
           onEdgesChange={onEdgesChange}
           nodeTypes={nodeTypes}
-          nodesConnectable={false}
+          nodesConnectable={true}
           onNodeClick={onNodeClick}
           onInit={(instance: ReactFlowInstance<Node, Edge>) => {

[NoCoverage] BlockStatement
src/main/components/ConceptGraph.tsx:894:64
           nodeTypes={nodeTypes}
           nodesConnectable={false}
           onNodeClick={onNodeClick}
-          onInit={(instance: ReactFlowInstance<Node, Edge>) => {
-            rfInstance.current = instance;
-          }}
+          onInit={(instance: ReactFlowInstance<Node, Edge>) => {}}
           onDrop={onDrop}
           onDragOver={onDragOver}
