[NoCoverage] BooleanLiteral
src/main/components/QuestionSearch.tsx:18:40
   disabled,
 }: QuestionSearchProps) {
   const [inputValue, setInputValue] = useState("");
-  const [isOpen, setIsOpen] = useState(false);
+  const [isOpen, setIsOpen] = useState(true);
   const containerRef = useRef<HTMLDivElement>(null);
 

[NoCoverage] BlockStatement
src/main/components/QuestionSearch.tsx:22:19
   const containerRef = useRef<HTMLDivElement>(null);
 
   // Reset when the questions list changes (new assessment selected)
-  useEffect(() => {
-    // eslint-disable-next-line react-hooks/set-state-in-effect
-    setInputValue("");
-    setIsOpen(false);
-  }, [questions]);
+  useEffect(() => {}, [questions]);
 
   // Reset if question is cleared externally

[NoCoverage] StringLiteral
src/main/components/QuestionSearch.tsx:24:19
   // Reset when the questions list changes (new assessment selected)
   useEffect(() => {
     // eslint-disable-next-line react-hooks/set-state-in-effect
-    setInputValue("");
+    setInputValue("Stryker was here!");
     setIsOpen(false);
   }, [questions]);

[NoCoverage] BooleanLiteral
src/main/components/QuestionSearch.tsx:25:15
   useEffect(() => {
     // eslint-disable-next-line react-hooks/set-state-in-effect
     setInputValue("");
-    setIsOpen(false);
+    setIsOpen(true);
   }, [questions]);
 

[NoCoverage] BlockStatement
src/main/components/QuestionSearch.tsx:29:19
   }, [questions]);
 
   // Reset if question is cleared externally
-  useEffect(() => {
-    // eslint-disable-next-line react-hooks/set-state-in-effect
-    if (!selectedQuestionId) setInputValue("");
-  }, [selectedQuestionId]);
+  useEffect(() => {}, [selectedQuestionId]);
 
   // Close dropdown on outside click

[NoCoverage] BooleanLiteral
src/main/components/QuestionSearch.tsx:31:9
   // Reset if question is cleared externally
   useEffect(() => {
     // eslint-disable-next-line react-hooks/set-state-in-effect
-    if (!selectedQuestionId) setInputValue("");
+    if (selectedQuestionId) setInputValue("");
   }, [selectedQuestionId]);
 

[NoCoverage] ConditionalExpression
src/main/components/QuestionSearch.tsx:31:9
   // Reset if question is cleared externally
   useEffect(() => {
     // eslint-disable-next-line react-hooks/set-state-in-effect
-    if (!selectedQuestionId) setInputValue("");
+    if (true) setInputValue("");
   }, [selectedQuestionId]);
 

[NoCoverage] BlockStatement
src/main/components/QuestionSearch.tsx:35:19
   }, [selectedQuestionId]);
 
   // Close dropdown on outside click
-  useEffect(() => {
-    const handler = (e: MouseEvent) => {
-      if (
-        containerRef.current &&
-        !containerRef.current.contains(e.target as Node)
-      ) {
-        setIsOpen(false);
-      }
-    };
-    document.addEventListener("mousedown", handler, true);
-    return () => document.removeEventListener("mousedown", handler, true);
-  }, []);
+  useEffect(() => {}, []);
 
   const filtered = questions.filter((q) =>

[NoCoverage] ArrowFunction
src/main/components/QuestionSearch.tsx:48:37
     return () => document.removeEventListener("mousedown", handler, true);
   }, []);
 
-  const filtered = questions.filter((q) =>
-    q.title.toLowerCase().includes(inputValue.toLowerCase()),
+  const filtered = questions.filter(() => undefined,
   );
 

[NoCoverage] MethodExpression
src/main/components/QuestionSearch.tsx:48:20
     return () => document.removeEventListener("mousedown", handler, true);
   }, []);
 
-  const filtered = questions.filter((q) =>
-    q.title.toLowerCase().includes(inputValue.toLowerCase()),
-  );
+  const filtered = questions;
 
   const handleSelect = (q: Question) => {

[NoCoverage] MethodExpression
src/main/components/QuestionSearch.tsx:49:5
   }, []);
 
   const filtered = questions.filter((q) =>
-    q.title.toLowerCase().includes(inputValue.toLowerCase()),
+    q.title.toUpperCase().includes(inputValue.toLowerCase()),
   );
 

[NoCoverage] MethodExpression
src/main/components/QuestionSearch.tsx:49:36
   }, []);
 
   const filtered = questions.filter((q) =>
-    q.title.toLowerCase().includes(inputValue.toLowerCase()),
+    q.title.toLowerCase().includes(inputValue.toUpperCase()),
   );
 

[NoCoverage] BlockStatement
src/main/components/QuestionSearch.tsx:52:41
     q.title.toLowerCase().includes(inputValue.toLowerCase()),
   );
 
-  const handleSelect = (q: Question) => {
-    setInputValue(q.title);
-    setIsOpen(false);
-    onSelect(q.id);
-  };
+  const handleSelect = (q: Question) => {};
 
   const handleChange = (e: React.ChangeEvent<HTMLInputElement>) => {

[NoCoverage] BooleanLiteral
src/main/components/QuestionSearch.tsx:54:15
 
   const handleSelect = (q: Question) => {
     setInputValue(q.title);
-    setIsOpen(false);
+    setIsOpen(true);
     onSelect(q.id);
   };

[NoCoverage] BlockStatement
src/main/components/QuestionSearch.tsx:58:68
     onSelect(q.id);
   };
 
-  const handleChange = (e: React.ChangeEvent<HTMLInputElement>) => {
-    setInputValue(e.target.value);
-    setIsOpen(true);
-    if (!e.target.value) onSelect("");
-  };
+  const handleChange = (e: React.ChangeEvent<HTMLInputElement>) => {};
 
   const inputStyle: React.CSSProperties = {

[NoCoverage] BooleanLiteral
src/main/components/QuestionSearch.tsx:60:15
 
   const handleChange = (e: React.ChangeEvent<HTMLInputElement>) => {
     setInputValue(e.target.value);
-    setIsOpen(true);
+    setIsOpen(false);
     if (!e.target.value) onSelect("");
   };

[NoCoverage] BooleanLiteral
src/main/components/QuestionSearch.tsx:61:9
   const handleChange = (e: React.ChangeEvent<HTMLInputElement>) => {
     setInputValue(e.target.value);
     setIsOpen(true);
-    if (!e.target.value) onSelect("");
+    if (e.target.value) onSelect("");
   };
 

[NoCoverage] ConditionalExpression
src/main/components/QuestionSearch.tsx:61:9
   const handleChange = (e: React.ChangeEvent<HTMLInputElement>) => {
     setInputValue(e.target.value);
     setIsOpen(true);
-    if (!e.target.value) onSelect("");
+    if (false) onSelect("");
   };
 

[NoCoverage] StringLiteral
src/main/components/QuestionSearch.tsx:65:12
   };
 
   const inputStyle: React.CSSProperties = {
-    width: "100%",
+    width: "",
     height: 28,
     padding: "0px 10px",

[NoCoverage] StringLiteral
src/main/components/QuestionSearch.tsx:67:14
   const inputStyle: React.CSSProperties = {
     width: "100%",
     height: 28,
-    padding: "0px 10px",
+    padding: "",
     fontFamily: "Helvetica, Arial, sans-serif",
     fontSize: 13,

[NoCoverage] StringLiteral
src/main/components/QuestionSearch.tsx:71:12
     fontFamily: "Helvetica, Arial, sans-serif",
     fontSize: 13,
     background: disabled ? "#ffffff" : "#ffffff",
-    color: "#1E293B",
+    color: "",
     border: "1px solid #000000",
     borderRadius: 6,

[NoCoverage] StringLiteral
src/main/components/QuestionSearch.tsx:74:14
     color: "#1E293B",
     border: "1px solid #000000",
     borderRadius: 6,
-    outline: "none",
+    outline: "",
     cursor: disabled ? "not-allowed" : "text",
     boxSizing: "border-box",

[NoCoverage] StringLiteral
src/main/components/QuestionSearch.tsx:76:16
     borderRadius: 6,
     outline: "none",
     cursor: disabled ? "not-allowed" : "text",
-    boxSizing: "border-box",
+    boxSizing: "",
   };
 

[NoCoverage] StringLiteral
src/main/components/QuestionSearch.tsx:80:48
   };
 
   return (
-    <div ref={containerRef} style={{ position: "relative", minWidth: 240 }}>
+    <div ref={containerRef} style={{ position: "", minWidth: 240 }}>
       {/* Input + clear button wrapper */}
       <div style={{ position: "relative" }}>

[NoCoverage] StringLiteral
src/main/components/QuestionSearch.tsx:82:31
   return (
     <div ref={containerRef} style={{ position: "relative", minWidth: 240 }}>
       {/* Input + clear button wrapper */}
-      <div style={{ position: "relative" }}>
+      <div style={{ position: "" }}>
         <input
           type="text"

[NoCoverage] BlockStatement
src/main/components/QuestionSearch.tsx:87:26
           type="text"
           value={inputValue}
           onChange={handleChange}
-          onFocus={() => {
-            if (!disabled) setIsOpen(true);
-          }}
+          onFocus={() => {}}
           onKeyDown={(e) => {
             if (e.key === "Enter" && filtered.length > 0)

[NoCoverage] BooleanLiteral
src/main/components/QuestionSearch.tsx:88:38
           value={inputValue}
           onChange={handleChange}
           onFocus={() => {
-            if (!disabled) setIsOpen(true);
+            if (!disabled) setIsOpen(false);
           }}
           onKeyDown={(e) => {

[NoCoverage] ConditionalExpression
src/main/components/QuestionSearch.tsx:88:17
           value={inputValue}
           onChange={handleChange}
           onFocus={() => {
-            if (!disabled) setIsOpen(true);
+            if (true) setIsOpen(true);
           }}
           onKeyDown={(e) => {

[NoCoverage] BlockStatement
src/main/components/QuestionSearch.tsx:90:29
           onFocus={() => {
             if (!disabled) setIsOpen(true);
           }}
-          onKeyDown={(e) => {
-            if (e.key === "Enter" && filtered.length > 0)
-              handleSelect(filtered[0]);
-            if (e.key === "Escape") setIsOpen(false);
-          }}
+          onKeyDown={(e) => {}}
           placeholder={
             disabled

[NoCoverage] ConditionalExpression
src/main/components/QuestionSearch.tsx:91:17
             if (!disabled) setIsOpen(true);
           }}
           onKeyDown={(e) => {
-            if (e.key === "Enter" && filtered.length > 0)
+            if (true)
               handleSelect(filtered[0]);
             if (e.key === "Escape") setIsOpen(false);

[NoCoverage] ConditionalExpression
src/main/components/QuestionSearch.tsx:91:17
             if (!disabled) setIsOpen(true);
           }}
           onKeyDown={(e) => {
-            if (e.key === "Enter" && filtered.length > 0)
+            if (true && filtered.length > 0)
               handleSelect(filtered[0]);
             if (e.key === "Escape") setIsOpen(false);

[NoCoverage] ConditionalExpression
src/main/components/QuestionSearch.tsx:93:17
           onKeyDown={(e) => {
             if (e.key === "Enter" && filtered.length > 0)
               handleSelect(filtered[0]);
-            if (e.key === "Escape") setIsOpen(false);
+            if (true) setIsOpen(false);
           }}
           placeholder={

[NoCoverage] ConditionalExpression
src/main/components/QuestionSearch.tsx:93:17
           onKeyDown={(e) => {
             if (e.key === "Enter" && filtered.length > 0)
               handleSelect(filtered[0]);
-            if (e.key === "Escape") setIsOpen(false);
+            if (false) setIsOpen(false);
           }}
           placeholder={

[NoCoverage] StringLiteral
src/main/components/QuestionSearch.tsx:97:17
           }}
           placeholder={
             disabled
-              ? "Select assessment to pick question"
+              ? ""
               : "Search questions…"
           }

[NoCoverage] ConditionalExpression
src/main/components/QuestionSearch.tsx:103:10
           disabled={disabled}
           style={{ ...inputStyle, paddingRight: inputValue ? 28 : 10 }}
         />
-        {inputValue && (
-          <button
-            onMouseDown={(e) => {
-              e.preventDefault();
-              setInputValue("");
-              setIsOpen(false);
-              onSelect("");
-            }}
-            style={{
-              position: "absolute",
-              right: 6,
-              top: "50%",
-              transform: "translateY(-50%)",
-              background: "none",
-              border: "none",
-              cursor: "pointer",
-              color: "#94A3B8",
-              fontSize: 14,
-              lineHeight: 1,
-              padding: 2,
-            }}
-          >
-            ✕
-          </button>
-        )}
+        {false}
       </div>
 

[NoCoverage] LogicalOperator
src/main/components/QuestionSearch.tsx:103:10
           disabled={disabled}
           style={{ ...inputStyle, paddingRight: inputValue ? 28 : 10 }}
         />
-        {inputValue && (
-          <button
-            onMouseDown={(e) => {
-              e.preventDefault();
-              setInputValue("");
-              setIsOpen(false);
-              onSelect("");
-            }}
-            style={{
-              position: "absolute",
-              right: 6,
-              top: "50%",
-              transform: "translateY(-50%)",
-              background: "none",
-              border: "none",
-              cursor: "pointer",
-              color: "#94A3B8",
-              fontSize: 14,
-              lineHeight: 1,
-              padding: 2,
-            }}
-          >
-            ✕
-          </button>
-        )}
+        {inputValue || <button onMouseDown={e => {
+  e.preventDefault();
+  setInputValue("");
+  setIsOpen(false);
+  onSelect("");
+}} style={{
+  position: "absolute",
+  right: 6,
+  top: "50%",
+  transform: "translateY(-50%)",
+  background: "none",
+  border: "none",
+  cursor: "pointer",
+  color: "#94A3B8",
+  fontSize: 14,
+  lineHeight: 1,
+  padding: 2
+}}>
+            ✕
+          </button>}
       </div>
 

[NoCoverage] BlockStatement
src/main/components/QuestionSearch.tsx:105:33
         />
         {inputValue && (
           <button
-            onMouseDown={(e) => {
-              e.preventDefault();
-              setInputValue("");
-              setIsOpen(false);
-              onSelect("");
-            }}
+            onMouseDown={(e) => {}}
             style={{
               position: "absolute",

[NoCoverage] StringLiteral
src/main/components/QuestionSearch.tsx:107:29
           <button
             onMouseDown={(e) => {
               e.preventDefault();
-              setInputValue("");
+              setInputValue("Stryker was here!");
               setIsOpen(false);
               onSelect("");

[NoCoverage] ObjectLiteral
src/main/components/QuestionSearch.tsx:111:20
               setIsOpen(false);
               onSelect("");
             }}
-            style={{
-              position: "absolute",
-              right: 6,
-              top: "50%",
-              transform: "translateY(-50%)",
-              background: "none",
-              border: "none",
-              cursor: "pointer",
-              color: "#94A3B8",
-              fontSize: 14,
-              lineHeight: 1,
-              padding: 2,
-            }}
+            style={{}}
           >
             ✕

[NoCoverage] StringLiteral
src/main/components/QuestionSearch.tsx:114:20
             style={{
               position: "absolute",
               right: 6,
-              top: "50%",
+              top: "",
               transform: "translateY(-50%)",
               background: "none",

[NoCoverage] StringLiteral
src/main/components/QuestionSearch.tsx:115:26
               position: "absolute",
               right: 6,
               top: "50%",
-              transform: "translateY(-50%)",
+              transform: "",
               background: "none",
               border: "none",

[NoCoverage] ConditionalExpression
src/main/components/QuestionSearch.tsx:130:31
         )}
       </div>
 
-      {isOpen && !disabled && filtered.length > 0 && (
+      {isOpen && !disabled && true && (
         <div
           style={{

[NoCoverage] LogicalOperator
src/main/components/QuestionSearch.tsx:130:8
         )}
       </div>
 
-      {isOpen && !disabled && filtered.length > 0 && (
+      {isOpen || !disabled && filtered.length > 0 && (
         <div
           style={{

[NoCoverage] StringLiteral
src/main/components/QuestionSearch.tsx:140:24
             background: "#fff",
             border: "1px solid #E2E8F0",
             borderRadius: 6,
-            boxShadow: "0 4px 16px rgba(0,0,0,0.1)",
+            boxShadow: "",
             zIndex: 100,
             maxHeight: 260,

[NoCoverage] ArrowFunction
src/main/components/QuestionSearch.tsx:146:25
             overflowY: "auto",
           }}
         >
-          {filtered.map((q, i) => (
-            <div
-              key={q.id}
-              onMouseDown={() => handleSelect(q)}
-              style={{
-                padding: "4px 8px",
-                fontSize: 12,
-                cursor: "pointer",
-                color: "#1E293B",
-                background: q.id === selectedQuestionId ? "#EFF6FF" : "#fff",
-                borderBottom:
-                  i < filtered.length - 1 ? "1px solid #F1F5F9" : "none",
-              }}
-              onMouseEnter={(e) =>
-                (e.currentTarget.style.background = "#F8FAFC")
-              }
-              onMouseLeave={(e) =>
-                (e.currentTarget.style.background =
-                  q.id === selectedQuestionId ? "#EFF6FF" : "#fff")
-              }
-            >
-              {q.title}
-            </div>
-          ))}
+          {filtered.map(() => undefined)}
         </div>
       )}

[NoCoverage] ArrowFunction
src/main/components/QuestionSearch.tsx:149:28
           {filtered.map((q, i) => (
             <div
               key={q.id}
-              onMouseDown={() => handleSelect(q)}
+              onMouseDown={() => undefined}
               style={{
                 padding: "4px 8px",

[NoCoverage] ConditionalExpression
src/main/components/QuestionSearch.tsx:155:29
                 fontSize: 12,
                 cursor: "pointer",
                 color: "#1E293B",
-                background: q.id === selectedQuestionId ? "#EFF6FF" : "#fff",
+                background: true ? "#EFF6FF" : "#fff",
                 borderBottom:
                   i < filtered.length - 1 ? "1px solid #F1F5F9" : "none",

[NoCoverage] EqualityOperator
src/main/components/QuestionSearch.tsx:155:29
                 fontSize: 12,
                 cursor: "pointer",
                 color: "#1E293B",
-                background: q.id === selectedQuestionId ? "#EFF6FF" : "#fff",
+                background: q.id !== selectedQuestionId ? "#EFF6FF" : "#fff",
                 borderBottom:
                   i < filtered.length - 1 ? "1px solid #F1F5F9" : "none",

[NoCoverage] EqualityOperator
src/main/components/QuestionSearch.tsx:157:19
                 color: "#1E293B",
                 background: q.id === selectedQuestionId ? "#EFF6FF" : "#fff",
                 borderBottom:
-                  i < filtered.length - 1 ? "1px solid #F1F5F9" : "none",
+                  i <= filtered.length - 1 ? "1px solid #F1F5F9" : "none",
               }}
               onMouseEnter={(e) =>

[NoCoverage] ConditionalExpression
src/main/components/QuestionSearch.tsx:157:19
                 color: "#1E293B",
                 background: q.id === selectedQuestionId ? "#EFF6FF" : "#fff",
                 borderBottom:
-                  i < filtered.length - 1 ? "1px solid #F1F5F9" : "none",
+                  false ? "1px solid #F1F5F9" : "none",
               }}
               onMouseEnter={(e) =>

[NoCoverage] StringLiteral
src/main/components/QuestionSearch.tsx:160:53
                   i < filtered.length - 1 ? "1px solid #F1F5F9" : "none",
               }}
               onMouseEnter={(e) =>
-                (e.currentTarget.style.background = "#F8FAFC")
+                (e.currentTarget.style.background = "")
               }
               onMouseLeave={(e) =>

[NoCoverage] ArrowFunction
src/main/components/QuestionSearch.tsx:162:29
               onMouseEnter={(e) =>
                 (e.currentTarget.style.background = "#F8FAFC")
               }
-              onMouseLeave={(e) =>
-                (e.currentTarget.style.background =
-                  q.id === selectedQuestionId ? "#EFF6FF" : "#fff")
+              onMouseLeave={() => undefined
               }
             >

[NoCoverage] ConditionalExpression
src/main/components/QuestionSearch.tsx:164:19
               }
               onMouseLeave={(e) =>
                 (e.currentTarget.style.background =
-                  q.id === selectedQuestionId ? "#EFF6FF" : "#fff")
+                  true ? "#EFF6FF" : "#fff")
               }
             >

[NoCoverage] EqualityOperator
src/main/components/QuestionSearch.tsx:164:19
               }
               onMouseLeave={(e) =>
                 (e.currentTarget.style.background =
-                  q.id === selectedQuestionId ? "#EFF6FF" : "#fff")
+                  q.id !== selectedQuestionId ? "#EFF6FF" : "#fff")
               }
             >

[NoCoverage] LogicalOperator
src/main/components/QuestionSearch.tsx:173:8
         </div>
       )}
 
-      {isOpen && !disabled && filtered.length === 0 && inputValue && (
-        <div
-          style={{
-            position: "absolute",
-            top: "calc(100% + 4px)",
-            left: 0,
-            right: 0,
-            background: "#fff",
-            border: "1px solid #E2E8F0",
-            borderRadius: 6,
-            padding: "8px 12px",
-            fontSize: 13,
-            color: "#94A3B8",
-            zIndex: 100,
-          }}
-        >
-          No questions match "{inputValue}"
-        </div>
-      )}
+      {isOpen && !disabled && filtered.length === 0 && inputValue || <div style={{
+  position: "absolute",
+  top: "calc(100% + 4px)",
+  left: 0,
+  right: 0,
+  background: "#fff",
+  border: "1px solid #E2E8F0",
+  borderRadius: 6,
+  padding: "8px 12px",
+  fontSize: 13,
+  color: "#94A3B8",
+  zIndex: 100
+}}>
+          No questions match "{inputValue}"
+        </div>}
     </div>
   );

[NoCoverage] EqualityOperator
src/main/components/QuestionSearch.tsx:173:31
         </div>
       )}
 
-      {isOpen && !disabled && filtered.length === 0 && inputValue && (
+      {isOpen && !disabled && filtered.length !== 0 && inputValue && (
         <div
           style={{

[NoCoverage] ObjectLiteral
src/main/components/QuestionSearch.tsx:175:18
 
       {isOpen && !disabled && filtered.length === 0 && inputValue && (
         <div
-          style={{
-            position: "absolute",
-            top: "calc(100% + 4px)",
-            left: 0,
-            right: 0,
-            background: "#fff",
-            border: "1px solid #E2E8F0",
-            borderRadius: 6,
-            padding: "8px 12px",
-            fontSize: 13,
-            color: "#94A3B8",
-            zIndex: 100,
-          }}
+          style={{}}
         >
           No questions match "{inputValue}"
