[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:21:18
     description:
       "Numeric data types are used to store numbers in Python. Integers are whole numbers. Floats, or floating point numbers, are numbers with a decimal point. Both can be positive or negative.",
     example: "29\n-6.88888",
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
   "data-types:Strings": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:33:14
   "data-types:Booleans": {
     description:
       "A boolean data type can only be one of two values: True or False. The value must be capitalized with no quotation marks around it.",
-    example: "True\nFalse",
+    example: "",
     practiceUrl: "https://us.prairielearn.com/",
   },

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:43:7
     description:
     example:
-      'int_variable = 5\nstring_variable = "CS 8"\nboolean_variable = True',
+      "",
     practiceUrl:
       "https://us.prairielearn.com/pl/course_instance/213067/instance_question/697992232/",

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:52:18
     example:
       '# Vague variable name\nx = "Alejandro"\n\n# Specific variable name\nstudent_name = "Kyle"',
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
   "variables:Variable assignment": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:58:7
     description:
     example:
-      '# Create variable1 to store a string\nvariable1 = "ABC"\n\n# Reassign variable1 to store an integer\nvariable1 = 10\n\n# Update variable1 based on its current value\nvariable1 = variable1 + 3',
+      "",
     practiceUrl: "https://us.prairielearn.com/",
   },

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:65:7
     description:
     example:
-      "x = 10\n\n# Same as x = x + 3\nx += 3\n\n# Same as x = x - 5\nx -= 5",
+      "",
     practiceUrl: "https://us.prairielearn.com/",
   },

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:82:18
     description:
       "The four basic arithmetic operators in Python are: + (add), - (subtract), * (multiply), and ** (raise to a power).",
     example: "5 + 3\n5 - 3\n5 * 3\n5 ** 3",
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
   "arithmetic-ops:Division": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:87:14
   "arithmetic-ops:Division": {
     description:
-    example: "# Evaluates to 1.25\n5 / 4\n\n# Evaluates to 1\n5 // 4",
+    example: "",
     practiceUrl: "https://us.prairielearn.com/",
   },

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:88:18
     description:
     example: "# Evaluates to 1.25\n5 / 4\n\n# Evaluates to 1\n5 // 4",
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
   "arithmetic-ops:Modulo": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:108:7
 
   "string-ops": {
     description:
-      "String operations are actions you can perform on text in Python. Python gives you tools to combine, slice, and format strings any time your program needs to work with or display text.",
+      "",
     example: 'greeting = "Hello" + " World!"\nword1 = greeting[0:5]',
     practiceUrl:

[NoCoverage] ObjectLiteral
src/main/data/conceptContent.ts:134:26
       'name = "Brennan"\n\n# Extracts Bren\nname[0:4]\n\n# Every other character: Benn\nnumbers[::2]\n\n# Reverses the string\nname[::-1]',
     practiceUrl: "https://us.prairielearn.com/",
   },
-  "string-ops:Comments": {
-    description:
-      "A comment is a note in code that Python ignores when running the program. Comments help readers understand what the code is doing and why. They are created by starting a line with a # symbol.",
-    example: "# This is a comment: Python will not run this line",
-    practiceUrl: "https://us.prairielearn.com/",
-  },
+  "string-ops:Comments": {},
 
   // ── BOOLEAN EXPRESSIONS ──────────────────────────────────────────────────────

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:137:14
   "string-ops:Comments": {
     description:
       "A comment is a note in code that Python ignores when running the program. Comments help readers understand what the code is doing and why. They are created by starting a line with a # symbol.",
-    example: "# This is a comment: Python will not run this line",
+    example: "",
     practiceUrl: "https://us.prairielearn.com/",
   },

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:154:7
     description:
     example:
-      "# Evaluate to True\n5 == 5\n5 != 3\n5 > 3\n\n# Evaluate to False\n5 < 3\n5 != 5\n5 <= 4",
+      "",
     practiceUrl: "https://us.prairielearn.com/",
   },

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:162:18
     example:
       "# Evaluate to True\nTrue and True\nnot False\nTrue or False\n\n# Evaluate to False\nTrue and False\nnot True\nFalse or False",
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
   "boolean-expr:Membership: in, not in": {

[NoCoverage] ObjectLiteral
src/main/data/conceptContent.ts:164:42
       "# Evaluate to True\nTrue and True\nnot False\nTrue or False\n\n# Evaluate to False\nTrue and False\nnot True\nFalse or False",
     practiceUrl: "https://us.prairielearn.com/",
   },
-  "boolean-expr:Membership: in, not in": {
-    description:
-      'Membership operators check whether a value exists inside a sequence, like if a character is in a string. "in" returns True if the value is found; "not in" returns True if it is not found.',
-    example:
-      "# Evaluate to True\n'P' in 'Python'\n'z' not in 'Python'\n\n# Evaluate to False\n'x' in 'Python'\n'n' not in 'Python'",
-    practiceUrl: "https://us.prairielearn.com/",
-  },
+  "boolean-expr:Membership: in, not in": {},
 
   // ── CONDITIONAL STATEMENTS ───────────────────────────────────────────────────

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:169:18
       'Membership operators check whether a value exists inside a sequence, like if a character is in a string. "in" returns True if the value is found; "not in" returns True if it is not found.',
     example:
       "# Evaluate to True\n'P' in 'Python'\n'z' not in 'Python'\n\n# Evaluate to False\n'x' in 'Python'\n'n' not in 'Python'",
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
 

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:194:18
     example:
       'test_grade = 85\n\nif test_grade >= 70:\n    class_grade = "Pass"\nelse:\n    class_grade = "Fail"',
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
   "conditionals:elif": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:210:7
     description:
     example:
-      'def greeting(name):\n    hello = "Hello, " + name\n    return(hello)',
+      "",
     practiceUrl:
       "https://us.prairielearn.com/pl/course_instance/213067/instance_question/698000004/",

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:212:7
     example:
       'def greeting(name):\n    hello = "Hello, " + name\n    return(hello)',
     practiceUrl:
-      "https://us.prairielearn.com/pl/course_instance/213067/instance_question/698000004/",
+      "",
   },
   "functions:Defining functions": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:217:14
   "functions:Defining functions": {
     description:
-    example: "def sum_function():\n    sum = 3 + 5",
+    example: "",
     practiceUrl: "https://us.prairielearn.com/",
   },

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:218:18
     description:
     example: "def sum_function():\n    sum = 3 + 5",
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
   "functions:Calling functions": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:231:7
     description:
     example:
-      "# Parameters are a and b\ndef sum_function(a, b):\n    sum = a + b\n\n# Call with inputs x and y\nx = 5\ny = 3\nsum_function(x, y)",
+      "",
     practiceUrl: "https://us.prairielearn.com/",
   },

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:263:18
       "min() returns the smallest value in a group of numbers; max() returns the largest. You can pass in multiple values separated by commas, or a single list of numbers.",
     example:
       "# Returns 4\nmin(8, 6, 13, 4)\n\nnum_list = [6, 2, 9, 12]\n\n# Returns 12\nmax(num_list)",
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
   "built-in-fns:range()": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:277:18
     example:
       '# Converts to integer 5\na = 5.2\nint(a)\n\n# Converts to float 6.0\nb = 6\nfloat(b)\n\n# Converts to string "7"\nc = 7\nstr(c)\n\n# Converts to integer 5\nd = "5"\nint(d)',
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
 

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:286:7
     description:
     example:
-      'print("This sentence will be printed out.")\nname = input("What is your name?")',
+      "",
     practiceUrl:
       "https://us.prairielearn.com/pl/course_instance/213067/instance_question/698000014/",

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:294:7
     description:
     example:
-      '# Prints "4"\nprint(2 + 2)\n\n# Prints "My name is Kate"\nname = "Kate"\nprint("My name is ", name)',
+      "",
     practiceUrl: "https://us.prairielearn.com/",
   },

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:301:7
     description:
     example:
-      'name = input("What is your name? ")\nprint("Hello, " + name + "!")\n\n# Type casting to store user input as an integer\nage = int(input("How old are you? "))\nprint(age + 1)',
+      "",
     practiceUrl: "https://us.prairielearn.com/",
   },

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:319:18
     example:
       'student = {"name": "Abby", "age": 20, "major": "Political Science"}',
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
   "dictionaries:Accessing a value": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:323:7
   },
   "dictionaries:Accessing a value": {
     description:
-      "A value in a dictionary is accessed using its key inside square brackets []. If the key doesn't exist, Python will return an error. If the key is a string, it must be in quotes.",
+      "",
     example:
       'student = {"name": "Abby", "age": 20, "major": "Political Science"}\n\n# Stores the integer 20\nAbby_age = student["age"]',

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:330:7
   },
   "dictionaries:Adding/updating a key": {
     description:
-      'A new key-value pair is added using the format: dictionary_name["new_key"] = value. If the key already exists in the dictionary, its value will be overwritten.',
+      "",
     example:
       'student = {"name": "Abby", "age": 20}\n\n# Adds key "major" with value "Political Science"\nstudent["major"] = "Political Science"',

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:332:7
     description:
       'A new key-value pair is added using the format: dictionary_name["new_key"] = value. If the key already exists in the dictionary, its value will be overwritten.',
     example:
-      'student = {"name": "Abby", "age": 20}\n\n# Adds key "major" with value "Political Science"\nstudent["major"] = "Political Science"',
+      "",
     practiceUrl: "https://us.prairielearn.com/",
   },

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:333:18
       'A new key-value pair is added using the format: dictionary_name["new_key"] = value. If the key already exists in the dictionary, its value will be overwritten.',
     example:
       'student = {"name": "Abby", "age": 20}\n\n# Adds key "major" with value "Political Science"\nstudent["major"] = "Political Science"',
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
 

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:348:14
   "lists:Creating a list": {
     description:
       "A list is created using square brackets [] with each value separated by a comma. A list can hold any data type, including a mix of different types. A list can also be empty.",
-    example: 'mixed = [1, "hello", True]\nempty = []',
+    example: "",
     practiceUrl: "https://us.prairielearn.com/",
   },

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:371:14
   "nested-lists": {
     description:
-    example: "grid = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]",
+    example: "",
     practiceUrl:
       "https://us.prairielearn.com/pl/course_instance/213067/instance_question/698000013/",

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:379:7
     description:
       "A nested list is created the same way as a regular list, except some or all of its values are themselves lists. Each inner list is separated by a comma, just like any other value.",
     example:
-      "# A list containing three lists\ngrid = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]",
+      "",
     practiceUrl: "https://us.prairielearn.com/",
   },

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:380:18
       "A nested list is created the same way as a regular list, except some or all of its values are themselves lists. Each inner list is separated by a comma, just like any other value.",
     example:
       "# A list containing three lists\ngrid = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]",
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
   "nested-lists:Accessing values": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:396:7
     description:
     example:
-      "x = 0\nwhile x < 3:\n    x += 1\n\nnum_list = [10, 5, 20, 3, 15]\ntotal = 0\n\nfor num in num_list:\n    total += num",
+      "",
     practiceUrl:
       "https://us.prairielearn.com/pl/course_instance/213067/instance_question/698000010/",

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:410:14
   "loops:While loops": {
     description:
-    example: "x = 0\nwhile x < 3:\n    x += 1",
+    example: "",
     practiceUrl: "https://us.prairielearn.com/",
   },

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:422:7
   },
   "loops:Continue": {
     description:
-      "continue skips the rest of the current loop iteration and jumps straight to the next one. Unlike break, it doesn't stop the loop entirely — it just moves on to the next item in the sequence.",
+      "",
     example:
       "num_list = [10, -5, 20, -3, 15]\ntotal = 0\n\n# Sums only positive numbers\nfor num in num_list:\n    if num < 0:\n        continue\n    total += num",

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:425:18
       "continue skips the rest of the current loop iteration and jumps straight to the next one. Unlike break, it doesn't stop the loop entirely — it just moves on to the next item in the sequence.",
     example:
       "num_list = [10, -5, 20, -3, 15]\ntotal = 0\n\n# Sums only positive numbers\nfor num in num_list:\n    if num < 0:\n        continue\n    total += num",
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
   "loops:Iteration": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:439:18
     example:
       "num_list = [10, 5, 20, 3, 15]\ntotal = 0\n\nfor num in num_list:\n    total += num",
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
 

[NoCoverage] ObjectLiteral
src/main/data/conceptContent.ts:452:42
     practiceUrl:
       "https://us.prairielearn.com/pl/course_instance/213067/instance_question/698000018/",
   },
-  "nested-loops:Creating a nested loop": {
-    description:
-      "A nested loop is created by indenting a second loop inside the block of an outer loop. The inner loop finishes all its iterations before the outer loop moves to its next one.",
-    example:
-      "x = 0\n\nwhile x < 3:\n    x += 1\n    y = 3\n    while y > 0:\n        y -= 1",
-    practiceUrl: "https://us.prairielearn.com/",
-  },
+  "nested-loops:Creating a nested loop": {},
   "nested-loops:Iterating over a nested list": {
     description:

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:474:7
     example: '# Filepath string example\n"downloads/CS8_data/data.txt"',
     practiceUrl:
-      "https://us.prairielearn.com/pl/course_instance/213067/instance_question/698000016/",
+      "",
   },
   "files:Opening & closing files": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:488:18
       ".read() returns the entire file as one string. .readlines() returns a list where each item is one line from the file as a separate string.",
     example:
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
   "files:Writing to a file": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:506:7
     example:
       'student1 = ("Alejandro", 20, "Data Science")\nstudent2 = ("Christos", 18, "Computer Science")',
     practiceUrl:
-      "https://us.prairielearn.com/pl/course_instance/213067/instance_question/697992234/",
+      "",
   },
   "tuples:Creating a tuple": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:517:7
   },
   "tuples:Accessing a value": {
     description:
-      "A value in a tuple is accessed using its index inside square brackets, just like a list. Tuple indexes start at 0, and negative indexes count from the end.",
+      "",
     example:
       "coordinates = (10, 20, 30)\n\n# Access the first value: 10\ncoordinates[0]\n\n# Access the last value: 30\ncoordinates[-1]\n\n# Access a range of values: (20, 30)\ncoordinates[1:]",

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:544:18
       "To add an element to a set, use set_variable.add(new_element). If the element already exists in the set, nothing changes — sets only store unique items.",
     example:
       'fruits = {"apple", "banana"}\n\n# Adds "cherry" to the set\nfruits.add("cherry")\n\n# Adding a duplicate has no effect\nfruits.add("apple")',
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
 

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:553:7
     description:
     example:
-      "# .add() is a built-in set method\nnum_set = {1, 2, 3}\nnum_set.add(4)",
+      "",
     practiceUrl:
       "https://us.prairielearn.com/pl/course_instance/213067/instance_question/698000007/",

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:555:7
     example:
       "# .add() is a built-in set method\nnum_set = {1, 2, 3}\nnum_set.add(4)",
     practiceUrl:
-      "https://us.prairielearn.com/pl/course_instance/213067/instance_question/698000007/",
+      "",
   },
   "methods:Calling a method": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:610:7
     description:
       ".upper() returns a new string with all characters converted to uppercase. .lower() returns a new string with all characters converted to lowercase.",
     example:
-      'name = "Nikita"\n\n# result: "NIKITA"\nuppercase_name = name.upper()\n\n# result: "nikita"\nlowercase_name = name.lower()',
+      "",
     practiceUrl: "https://us.prairielearn.com/",
   },

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:617:7
     description:
       ".replace() returns a new string with every occurrence of a specified value swapped out for a new value. Pass in the value to find and the replacement value as inputs.",
     example:
-      'sentence = "I like cats and cats like me."\n\n# result: "I like dogs and dogs like me."\nnew_sentence = sentence.replace("cats", "dogs")',
+      "",
     practiceUrl: "https://us.prairielearn.com/",
   },

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:624:7
     description:
       ".split() breaks a string into a list of smaller strings, dividing at a specified separator. By default it splits on whitespace. The separator itself is not included in the result.",
     example:
-      'sentence = "hello world"\n\n# result: ["hello", "world"]\nword_list = sentence.split()\n\ndate = "2024-05-08"\n\n# result: ["2024", "05", "08"]\ndate_list = date.split("-")',
+      "",
     practiceUrl: "https://us.prairielearn.com/",
   },

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:642:7
     description:
     example:
-      "# Import the entire module\nimport math\n\n# Import a specific function from a module\nfrom random import randint",
+      "",
     practiceUrl: "https://us.prairielearn.com/",
   },

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:656:7
     description:
     example:
-      "import math\n\n# Returns the square root: 4.0\nmath.sqrt(16)\n\n# Rounds down to the nearest integer: 3\nmath.floor(3.9)\n\n# Rounds up to the nearest integer: 4\nmath.ceil(3.1)",
+      "",
     practiceUrl: "https://us.prairielearn.com/",
   },

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:657:18
     example:
       "import math\n\n# Returns the square root: 4.0\nmath.sqrt(16)\n\n# Rounds down to the nearest integer: 3\nmath.floor(3.9)\n\n# Rounds up to the nearest integer: 4\nmath.ceil(3.1)",
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
 

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:668:7
     example:
       "def multiply(a, b):\n    return a * b\n\ndef test_multiply():\n    assert multiply(2, 3) == 6",
     practiceUrl:
-      "https://us.prairielearn.com/pl/course_instance/213067/instance_question/698000009/",
+      "",
   },
   "testing:assert statements": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:675:18
     example:
       "# This passes: no error\nassert 2 + 2 == 4\n\n# This fails and raises an AssertionError\nassert 2 + 2 == 5",
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
   "testing:Writing test functions": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:682:18
     example:
       "def add(a, b):\n    return a + b\n\ndef test_add():\n    assert add(2, 3) == 5\n    assert add(0, 0) == 0\n    assert add(-1, 1) == 0",
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
   "testing:Edge cases": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:707:18
     example:
       "# Missing colon after if statement\nif x > 5\n    x = 10\n\n# Missing closing parenthesis\nresult = (2 + 3",
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
   "errors-debugging:Runtime errors": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:721:18
     example:
       'try:\n    result = "hello" + 5\nexcept TypeError:\n    result = "hello"',
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
   "errors-debugging:Reading tracebacks": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:736:14
   "data-rep": {
     description:
-    example: "# Decimal\n10\n\n# Binary\n0b1010\n\n# Hex\n0xA",
+    example: "",
     practiceUrl:
       "https://us.prairielearn.com/pl/course_instance/213067/instance_question/697992229/",

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:756:14
   "data-rep:Decimal": {
     description:
-    example: "# A regular decimal number with no prefix\n42",
+    example: "",
     practiceUrl: "https://us.prairielearn.com/",
   },

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:757:18
     description:
     example: "# A regular decimal number with no prefix\n42",
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
   "data-rep:Converting between bases": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:773:7
     description:
     example:
-      "def fibonacci_recursive(n):\n    # Base case\n    if n <= 1:\n        return n\n\n    # Recursive step\n    return fibonacci_recursive(n - 1) + fibonacci_recursive(n - 2)",
+      "",
     practiceUrl:
       "https://us.prairielearn.com/pl/course_instance/213067/instance_question/698000011/",

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:775:7
     example:
       "def fibonacci_recursive(n):\n    # Base case\n    if n <= 1:\n        return n\n\n    # Recursive step\n    return fibonacci_recursive(n - 1) + fibonacci_recursive(n - 2)",
     practiceUrl:
-      "https://us.prairielearn.com/pl/course_instance/213067/instance_question/698000011/",
+      "",
   },
   "recursion:Base case": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:782:18
     example:
       "def countdown(n):\n    # Base case: stop when n reaches 0\n    if n == 0:\n        return 0\n    return countdown(n - 1)",
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
   "recursion:State change": {

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:796:18
     example:
       "def factorial(n):\n    # Base case: factorial of 0 is 1\n    if n == 0:\n        return 1\n    # Recursive step: multiply n by factorial of n - 1\n    return n * factorial(n - 1)",
-    practiceUrl: "https://us.prairielearn.com/",
+    practiceUrl: "",
   },
 

[NoCoverage] StringLiteral
src/main/data/conceptContent.ts:813:7
     description:
     example:
-      'def function1():\n    # Code\n\ndef function2():\n    # Code\n\nif __name__ == "__main__":\n\n    function1()\n    function2()',
+      "",
     practiceUrl: "https://us.prairielearn.com/",
   },
