[NoCoverage] ObjectLiteral
src/main/data/conceptGraph.ts:9:3
 }
 
 export const majorConcepts: MajorConcept[] = [
-  {
-    id: "data-types",
-    label: "Basic \n Data Types",
-    color: "#c99ffe",
-    subconcepts: ["Numeric (integers, floats)", "Strings", "Booleans"],
-  },
+  {},
   {
     id: "data-rep",

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:13:49
     id: "data-types",
     label: "Basic \n Data Types",
     color: "#c99ffe",
-    subconcepts: ["Numeric (integers, floats)", "Strings", "Booleans"],
+    subconcepts: ["Numeric (integers, floats)", "", "Booleans"],
   },
   {

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:13:19
     id: "data-types",
     label: "Basic \n Data Types",
     color: "#c99ffe",
-    subconcepts: ["Numeric (integers, floats)", "Strings", "Booleans"],
+    subconcepts: ["", "Strings", "Booleans"],
   },
   {

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:16:9
     subconcepts: ["Numeric (integers, floats)", "Strings", "Booleans"],
   },
   {
-    id: "data-rep",
+    id: "",
     label: "Data \n Representation",
     color: "#feaef2",

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:17:12
   },
   {
     id: "data-rep",
-    label: "Data \n Representation",
+    label: "",
     color: "#feaef2",
     subconcepts: ["Binary", "Hex", "Decimal", "Converting between bases"],

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:19:19
     id: "data-rep",
     label: "Data \n Representation",
     color: "#feaef2",
-    subconcepts: ["Binary", "Hex", "Decimal", "Converting between bases"],
+    subconcepts: ["", "Hex", "Decimal", "Converting between bases"],
   },
   {

[NoCoverage] ObjectLiteral
src/main/data/conceptGraph.ts:21:3
     color: "#feaef2",
     subconcepts: ["Binary", "Hex", "Decimal", "Converting between bases"],
   },
-  {
-    id: "variables",
-    label: "Variables",
-    color: "#feaef2",
-    subconcepts: ["Variable names", "Variable assignment", "+= and -="],
-  },
+  {},
   {
     id: "arithmetic-ops",

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:23:12
   },
   {
     id: "variables",
-    label: "Variables",
+    label: "",
     color: "#feaef2",
     subconcepts: ["Variable names", "Variable assignment", "+= and -="],

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:25:60
     id: "variables",
     label: "Variables",
     color: "#feaef2",
-    subconcepts: ["Variable names", "Variable assignment", "+= and -="],
+    subconcepts: ["Variable names", "Variable assignment", ""],
   },
   {

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:28:9
     subconcepts: ["Variable names", "Variable assignment", "+= and -="],
   },
   {
-    id: "arithmetic-ops",
+    id: "",
     label: "Arithmetic \n Operations",
     color: "#feaef2",

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:32:7
     label: "Arithmetic \n Operations",
     color: "#feaef2",
     subconcepts: [
-      "Simple arithmetic",
+      "",
       "Division",
       "Modulo",

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:34:7
     subconcepts: [
       "Simple arithmetic",
       "Division",
-      "Modulo",
+      "",
       "Order of operations",
     ],

[NoCoverage] ArrayDeclaration
src/main/data/conceptGraph.ts:53:18
     id: "boolean-expr",
     label: "Boolean \n Expressions",
     color: "#feaef2",
-    subconcepts: [
-      "Comparison: ==, <, <=, !=",
-      "Logical: and, or, not",
-      "Membership: in, not in",
-    ],
+    subconcepts: [],
   },
   {

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:55:7
     color: "#feaef2",
     subconcepts: [
       "Comparison: ==, <, <=, !=",
-      "Logical: and, or, not",
+      "",
       "Membership: in, not in",
     ],

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:56:7
     subconcepts: [
       "Comparison: ==, <, <=, !=",
       "Logical: and, or, not",
-      "Membership: in, not in",
+      "",
     ],
   },

[NoCoverage] ArrayDeclaration
src/main/data/conceptGraph.ts:63:18
     id: "conditionals",
     label: "Conditional \n Statements",
     color: "#93ebff",
-    subconcepts: ["if", "else", "elif"],
+    subconcepts: [],
   },
   {

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:63:19
     id: "conditionals",
     label: "Conditional \n Statements",
     color: "#93ebff",
-    subconcepts: ["if", "else", "elif"],
+    subconcepts: ["", "else", "elif"],
   },
   {

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:66:9
     subconcepts: ["if", "else", "elif"],
   },
   {
-    id: "functions",
+    id: "",
     label: "Functions",
     color: "#93ebff",

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:68:12
   {
     id: "functions",
     label: "Functions",
-    color: "#93ebff",
+    color: "",
     subconcepts: [
       "Defining functions",

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:70:7
     label: "Functions",
     color: "#93ebff",
     subconcepts: [
-      "Defining functions",
+      "",
       "Calling functions",
       "Function parameters",

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:72:7
     subconcepts: [
       "Defining functions",
       "Calling functions",
-      "Function parameters",
+      "",
       "Return statements",
     ],

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:73:7
       "Defining functions",
       "Calling functions",
       "Function parameters",
-      "Return statements",
+      "",
     ],
   },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:79:12
   {
     id: "built-in-fns",
     label: "Built-in \n Functions",
-    color: "#fe9a71",
+    color: "",
     subconcepts: ["len()", "min() and max()", "range()", "Type casting"],
   },

[NoCoverage] ObjectLiteral
src/main/data/conceptGraph.ts:82:3
     color: "#fe9a71",
     subconcepts: ["len()", "min() and max()", "range()", "Type casting"],
   },
-  {
-    id: "main-fn",
-    label: 'if __name__ \n == "__main__":',
-    color: "#fe9a71",
-    subconcepts: ["Program structure", 'Using if __name__ == "__main__"'],
-  },
+  {},
   {
     id: "dictionaries",

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:84:12
   },
   {
     id: "main-fn",
-    label: 'if __name__ \n == "__main__":',
+    label: "",
     color: "#fe9a71",
     subconcepts: ["Program structure", 'Using if __name__ == "__main__"'],

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:86:40
     id: "main-fn",
     label: 'if __name__ \n == "__main__":',
     color: "#fe9a71",
-    subconcepts: ["Program structure", 'Using if __name__ == "__main__"'],
+    subconcepts: ["Program structure", ""],
   },
   {

[NoCoverage] ArrayDeclaration
src/main/data/conceptGraph.ts:92:18
     id: "dictionaries",
     label: "Dictionaries",
     color: "#93ebff",
-    subconcepts: [
-      "Creating a dictionary",
-      "Accessing a value",
-      "Adding/updating a key",
-    ],
+    subconcepts: [],
   },
   {

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:101:12
   {
     id: "input-output",
     label: "Input \n & Output",
-    color: "#2bcd9c",
+    color: "",
     subconcepts: ["input()", "print()"],
   },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:102:30
     id: "input-output",
     label: "Input \n & Output",
     color: "#2bcd9c",
-    subconcepts: ["input()", "print()"],
+    subconcepts: ["input()", ""],
   },
   {

[NoCoverage] ObjectLiteral
src/main/data/conceptGraph.ts:104:3
     color: "#2bcd9c",
     subconcepts: ["input()", "print()"],
   },
-  {
-    id: "loops",
-    label: "Loops",
-    color: "#fe9a71",
-    subconcepts: [
-      "For loops",
-      "While loops",
-      "Break",
-      "Continue",
-      "Iteration",
-      "Accumulator pattern",
-    ],
-  },
+  {},
   {
     id: "lists",

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:106:12
   },
   {
     id: "loops",
-    label: "Loops",
+    label: "",
     color: "#fe9a71",
     subconcepts: [

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:107:12
   {
     id: "loops",
     label: "Loops",
-    color: "#fe9a71",
+    color: "",
     subconcepts: [
       "For loops",

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:118:9
     ],
   },
   {
-    id: "lists",
+    id: "",
     label: "Lists",
     color: "#93ebff",

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:121:19
     id: "lists",
     label: "Lists",
     color: "#93ebff",
-    subconcepts: ["Creating a list", "Accessing a value", "List slicing"],
+    subconcepts: ["", "Accessing a value", "List slicing"],
   },
   {

[NoCoverage] ObjectLiteral
src/main/data/conceptGraph.ts:123:3
     color: "#93ebff",
     subconcepts: ["Creating a list", "Accessing a value", "List slicing"],
   },
-  {
-    id: "nested-lists",
-    label: "Nested \n Lists",
-    color: "#fe9a71",
-    subconcepts: ["Creating a nested list", "Accessing values"],
-  },
+  {},
   {
     id: "nested-loops",

[NoCoverage] ArrayDeclaration
src/main/data/conceptGraph.ts:127:18
     id: "nested-lists",
     label: "Nested \n Lists",
     color: "#fe9a71",
-    subconcepts: ["Creating a nested list", "Accessing values"],
+    subconcepts: [],
   },
   {

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:131:12
   },
   {
     id: "nested-loops",
-    label: "Nested \n Loops",
+    label: "",
     color: "#2bcd9c",
     subconcepts: ["Creating a nested loop", "Iterating over a nested list"],

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:133:45
     id: "nested-loops",
     label: "Nested \n Loops",
     color: "#2bcd9c",
-    subconcepts: ["Creating a nested loop", "Iterating over a nested list"],
+    subconcepts: ["Creating a nested loop", ""],
   },
   {

[NoCoverage] ArrayDeclaration
src/main/data/conceptGraph.ts:133:18
     id: "nested-loops",
     label: "Nested \n Loops",
     color: "#2bcd9c",
-    subconcepts: ["Creating a nested loop", "Iterating over a nested list"],
+    subconcepts: [],
   },
   {

[NoCoverage] ObjectLiteral
src/main/data/conceptGraph.ts:135:3
     color: "#2bcd9c",
     subconcepts: ["Creating a nested loop", "Iterating over a nested list"],
   },
-  {
-    id: "tuples",
-    label: "Tuples",
-    color: "#93ebff",
-    subconcepts: ["Creating a tuple", "Accessing a value"],
-  },
+  {},
   {
     id: "sets",

[NoCoverage] ArrayDeclaration
src/main/data/conceptGraph.ts:139:18
     id: "tuples",
     label: "Tuples",
     color: "#93ebff",
-    subconcepts: ["Creating a tuple", "Accessing a value"],
+    subconcepts: [],
   },
   {

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:139:19
     id: "tuples",
     label: "Tuples",
     color: "#93ebff",
-    subconcepts: ["Creating a tuple", "Accessing a value"],
+    subconcepts: ["", "Accessing a value"],
   },
   {

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:143:12
   },
   {
     id: "sets",
-    label: "Sets",
+    label: "",
     color: "#93ebff",
     subconcepts: ["Creating a set", "Adding an element"],

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:145:19
     id: "sets",
     label: "Sets",
     color: "#93ebff",
-    subconcepts: ["Creating a set", "Adding an element"],
+    subconcepts: ["", "Adding an element"],
   },
   {

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:149:12
   },
   {
     id: "recursion",
-    label: "Recursion",
+    label: "",
     color: "#fe9a71",
     subconcepts: ["Base case", "State change", "Recursive step"],

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:150:12
   {
     id: "recursion",
     label: "Recursion",
-    color: "#fe9a71",
+    color: "",
     subconcepts: ["Base case", "State change", "Recursive step"],
   },

[NoCoverage] ArrayDeclaration
src/main/data/conceptGraph.ts:151:18
     id: "recursion",
     label: "Recursion",
     color: "#fe9a71",
-    subconcepts: ["Base case", "State change", "Recursive step"],
+    subconcepts: [],
   },
   {

[NoCoverage] ArrayDeclaration
src/main/data/conceptGraph.ts:157:18
     id: "files",
     label: "Files",
     color: "#2bcd9c",
-    subconcepts: [
-      "Opening & closing files",
-      "Reading a file",
-      "Writing to a file",
-    ],
+    subconcepts: [],
   },
   {

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:159:7
     color: "#2bcd9c",
     subconcepts: [
       "Opening & closing files",
-      "Reading a file",
+      "",
       "Writing to a file",
     ],

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:171:12
   },
   {
     id: "string-methods",
-    label: "String \n Methods",
+    label: "",
     color: "#2bcd9c",
     subconcepts: ["upper() and lower()", "replace()", "split()"],

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:173:42
     id: "string-methods",
     label: "String \n Methods",
     color: "#2bcd9c",
-    subconcepts: ["upper() and lower()", "replace()", "split()"],
+    subconcepts: ["upper() and lower()", "", "split()"],
   },
   {

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:177:12
   },
   {
     id: "modules",
-    label: "Imports & Modules",
+    label: "",
     color: "#2bcd9c",
     subconcepts: ["Importing modules", "random", "math"],

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:178:12
   {
     id: "modules",
     label: "Imports & Modules",
-    color: "#2bcd9c",
+    color: "",
     subconcepts: ["Importing modules", "random", "math"],
   },

[NoCoverage] ArrayDeclaration
src/main/data/conceptGraph.ts:179:18
     id: "modules",
     label: "Imports & Modules",
     color: "#2bcd9c",
-    subconcepts: ["Importing modules", "random", "math"],
+    subconcepts: [],
   },
   {

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:179:40
     id: "modules",
     label: "Imports & Modules",
     color: "#2bcd9c",
-    subconcepts: ["Importing modules", "random", "math"],
+    subconcepts: ["Importing modules", "", "math"],
   },
   {

[NoCoverage] ObjectLiteral
src/main/data/conceptGraph.ts:181:3
     color: "#2bcd9c",
     subconcepts: ["Importing modules", "random", "math"],
   },
-  {
-    id: "mutability",
-    label: "Mutability",
-    color: "#fe9a71",
-    subconcepts: ["Mutable objects", "Immutable objects"],
-  },
+  {},
   {
     id: "testing",

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:182:9
     subconcepts: ["Importing modules", "random", "math"],
   },
   {
-    id: "mutability",
+    id: "",
     label: "Mutability",
     color: "#fe9a71",

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:183:12
   },
   {
     id: "mutability",
-    label: "Mutability",
+    label: "",
     color: "#fe9a71",
     subconcepts: ["Mutable objects", "Immutable objects"],

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:196:12
   {
     id: "errors-debugging",
     label: "Errors & \n Debugging",
-    color: "#93ebff",
+    color: "",
     subconcepts: [
       "Syntax errors",

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:198:7
     label: "Errors & \n Debugging",
     color: "#93ebff",
     subconcepts: [
-      "Syntax errors",
+      "",
       "Runtime errors",
       "try / except",

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:200:7
     subconcepts: [
       "Syntax errors",
       "Runtime errors",
-      "try / except",
+      "",
       "Reading tracebacks",
     ],

[NoCoverage] ObjectLiteral
src/main/data/conceptGraph.ts:210:3
   // Up from Level 1
   { source: "data-types", target: "variables" },
   { source: "data-types", target: "arithmetic-ops" },
-  { source: "data-types", target: "data-rep" },
+  {},
   { source: "data-types", target: "boolean-expr" },
 

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:211:35
   { source: "data-types", target: "variables" },
   { source: "data-types", target: "arithmetic-ops" },
   { source: "data-types", target: "data-rep" },
-  { source: "data-types", target: "boolean-expr" },
+  { source: "data-types", target: "" },
 
   // Up from Level 2

[NoCoverage] ObjectLiteral
src/main/data/conceptGraph.ts:211:3
   { source: "data-types", target: "variables" },
   { source: "data-types", target: "arithmetic-ops" },
   { source: "data-types", target: "data-rep" },
-  { source: "data-types", target: "boolean-expr" },
+  {},
 
   // Up from Level 2

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:214:13
   { source: "data-types", target: "boolean-expr" },
 
   // Up from Level 2
-  { source: "variables", target: "lists" },
+  { source: "", target: "lists" },
   { source: "variables", target: "functions" },
   { source: "variables", target: "dictionaries" },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:214:34
   { source: "data-types", target: "boolean-expr" },
 
   // Up from Level 2
-  { source: "variables", target: "lists" },
+  { source: "variables", target: "" },
   { source: "variables", target: "functions" },
   { source: "variables", target: "dictionaries" },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:215:34
 
   // Up from Level 2
   { source: "variables", target: "lists" },
-  { source: "variables", target: "functions" },
+  { source: "variables", target: "" },
   { source: "variables", target: "dictionaries" },
   { source: "variables", target: "sets" },

[NoCoverage] ObjectLiteral
src/main/data/conceptGraph.ts:217:3
   { source: "variables", target: "lists" },
   { source: "variables", target: "functions" },
   { source: "variables", target: "dictionaries" },
-  { source: "variables", target: "sets" },
+  {},
   { source: "variables", target: "tuples" },
   { source: "variables", target: "string-ops" },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:217:13
   { source: "variables", target: "lists" },
   { source: "variables", target: "functions" },
   { source: "variables", target: "dictionaries" },
-  { source: "variables", target: "sets" },
+  { source: "", target: "sets" },
   { source: "variables", target: "tuples" },
   { source: "variables", target: "string-ops" },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:220:13
   { source: "variables", target: "sets" },
   { source: "variables", target: "tuples" },
   { source: "variables", target: "string-ops" },
-  { source: "boolean-expr", target: "conditionals" },
+  { source: "", target: "conditionals" },
   { source: "boolean-expr", target: "loops" },
   { source: "variables", target: "errors-debugging" },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:220:37
   { source: "variables", target: "sets" },
   { source: "variables", target: "tuples" },
   { source: "variables", target: "string-ops" },
-  { source: "boolean-expr", target: "conditionals" },
+  { source: "boolean-expr", target: "" },
   { source: "boolean-expr", target: "loops" },
   { source: "variables", target: "errors-debugging" },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:222:34
   { source: "variables", target: "string-ops" },
   { source: "boolean-expr", target: "conditionals" },
   { source: "boolean-expr", target: "loops" },
-  { source: "variables", target: "errors-debugging" },
+  { source: "variables", target: "" },
   { source: "arithmetic-ops", target: "errors-debugging" },
   { source: "arithmetic-ops", target: "recursion" },

[NoCoverage] ObjectLiteral
src/main/data/conceptGraph.ts:222:3
   { source: "variables", target: "string-ops" },
   { source: "boolean-expr", target: "conditionals" },
   { source: "boolean-expr", target: "loops" },
-  { source: "variables", target: "errors-debugging" },
+  {},
   { source: "arithmetic-ops", target: "errors-debugging" },
   { source: "arithmetic-ops", target: "recursion" },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:223:13
   { source: "boolean-expr", target: "conditionals" },
   { source: "boolean-expr", target: "loops" },
   { source: "variables", target: "errors-debugging" },
-  { source: "arithmetic-ops", target: "errors-debugging" },
+  { source: "", target: "errors-debugging" },
   { source: "arithmetic-ops", target: "recursion" },
   { source: "arithmetic-ops", target: "loops" },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:224:13
   { source: "boolean-expr", target: "loops" },
   { source: "variables", target: "errors-debugging" },
   { source: "arithmetic-ops", target: "errors-debugging" },
-  { source: "arithmetic-ops", target: "recursion" },
+  { source: "", target: "recursion" },
   { source: "arithmetic-ops", target: "loops" },
   { source: "arithmetic-ops", target: "string-ops" },

[NoCoverage] ObjectLiteral
src/main/data/conceptGraph.ts:225:3
   { source: "variables", target: "errors-debugging" },
   { source: "arithmetic-ops", target: "errors-debugging" },
   { source: "arithmetic-ops", target: "recursion" },
-  { source: "arithmetic-ops", target: "loops" },
+  {},
   { source: "arithmetic-ops", target: "string-ops" },
 

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:225:39
   { source: "variables", target: "errors-debugging" },
   { source: "arithmetic-ops", target: "errors-debugging" },
   { source: "arithmetic-ops", target: "recursion" },
-  { source: "arithmetic-ops", target: "loops" },
+  { source: "arithmetic-ops", target: "" },
   { source: "arithmetic-ops", target: "string-ops" },
 

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:226:13
   { source: "arithmetic-ops", target: "errors-debugging" },
   { source: "arithmetic-ops", target: "recursion" },
   { source: "arithmetic-ops", target: "loops" },
-  { source: "arithmetic-ops", target: "string-ops" },
+  { source: "", target: "string-ops" },
 
   // Up from Level 3

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:230:37
 
   // Up from Level 3
   { source: "conditionals", target: "main-fn" },
-  { source: "conditionals", target: "main-fn" },
+  { source: "conditionals", target: "" },
   { source: "conditionals", target: "recursion" },
   { source: "functions", target: "testing" },

[NoCoverage] ObjectLiteral
src/main/data/conceptGraph.ts:231:3
   // Up from Level 3
   { source: "conditionals", target: "main-fn" },
   { source: "conditionals", target: "main-fn" },
-  { source: "conditionals", target: "recursion" },
+  {},
   { source: "functions", target: "testing" },
   { source: "functions", target: "main-fn" },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:231:37
   // Up from Level 3
   { source: "conditionals", target: "main-fn" },
   { source: "conditionals", target: "main-fn" },
-  { source: "conditionals", target: "recursion" },
+  { source: "conditionals", target: "" },
   { source: "functions", target: "testing" },
   { source: "functions", target: "main-fn" },

[NoCoverage] ObjectLiteral
src/main/data/conceptGraph.ts:232:3
   { source: "conditionals", target: "main-fn" },
   { source: "conditionals", target: "main-fn" },
   { source: "conditionals", target: "recursion" },
-  { source: "functions", target: "testing" },
+  {},
   { source: "functions", target: "main-fn" },
   { source: "functions", target: "built-in-fns" },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:233:34
   { source: "conditionals", target: "main-fn" },
   { source: "conditionals", target: "recursion" },
   { source: "functions", target: "testing" },
-  { source: "functions", target: "main-fn" },
+  { source: "functions", target: "" },
   { source: "functions", target: "built-in-fns" },
   { source: "functions", target: "methods" },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:233:13
   { source: "conditionals", target: "main-fn" },
   { source: "conditionals", target: "recursion" },
   { source: "functions", target: "testing" },
-  { source: "functions", target: "main-fn" },
+  { source: "", target: "main-fn" },
   { source: "functions", target: "built-in-fns" },
   { source: "functions", target: "methods" },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:235:34
   { source: "functions", target: "testing" },
   { source: "functions", target: "main-fn" },
   { source: "functions", target: "built-in-fns" },
-  { source: "functions", target: "methods" },
+  { source: "functions", target: "" },
   { source: "functions", target: "recursion" },
   { source: "lists", target: "nested-lists" },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:236:34
   { source: "functions", target: "main-fn" },
   { source: "functions", target: "built-in-fns" },
   { source: "functions", target: "methods" },
-  { source: "functions", target: "recursion" },
+  { source: "functions", target: "" },
   { source: "lists", target: "nested-lists" },
   { source: "lists", target: "mutability" },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:237:30
   { source: "functions", target: "built-in-fns" },
   { source: "functions", target: "methods" },
   { source: "functions", target: "recursion" },
-  { source: "lists", target: "nested-lists" },
+  { source: "lists", target: "" },
   { source: "lists", target: "mutability" },
   { source: "lists", target: "loops" },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:239:13
   { source: "functions", target: "recursion" },
   { source: "lists", target: "nested-lists" },
   { source: "lists", target: "mutability" },
-  { source: "lists", target: "loops" },
+  { source: "", target: "loops" },
   { source: "dictionaries", target: "mutability" },
   { source: "tuples", target: "mutability" },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:239:30
   { source: "functions", target: "recursion" },
   { source: "lists", target: "nested-lists" },
   { source: "lists", target: "mutability" },
-  { source: "lists", target: "loops" },
+  { source: "lists", target: "" },
   { source: "dictionaries", target: "mutability" },
   { source: "tuples", target: "mutability" },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:240:37
   { source: "lists", target: "nested-lists" },
   { source: "lists", target: "mutability" },
   { source: "lists", target: "loops" },
-  { source: "dictionaries", target: "mutability" },
+  { source: "dictionaries", target: "" },
   { source: "tuples", target: "mutability" },
   { source: "sets", target: "mutability" },

[NoCoverage] ObjectLiteral
src/main/data/conceptGraph.ts:241:3
   { source: "lists", target: "mutability" },
   { source: "lists", target: "loops" },
   { source: "dictionaries", target: "mutability" },
-  { source: "tuples", target: "mutability" },
+  {},
   { source: "sets", target: "mutability" },
 

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:241:13
   { source: "lists", target: "mutability" },
   { source: "lists", target: "loops" },
   { source: "dictionaries", target: "mutability" },
-  { source: "tuples", target: "mutability" },
+  { source: "", target: "mutability" },
   { source: "sets", target: "mutability" },
 

[NoCoverage] ObjectLiteral
src/main/data/conceptGraph.ts:242:3
   { source: "lists", target: "loops" },
   { source: "dictionaries", target: "mutability" },
   { source: "tuples", target: "mutability" },
-  { source: "sets", target: "mutability" },
+  {},
 
   // Up from Level 4

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:242:13
   { source: "lists", target: "loops" },
   { source: "dictionaries", target: "mutability" },
   { source: "tuples", target: "mutability" },
-  { source: "sets", target: "mutability" },
+  { source: "", target: "mutability" },
 
   // Up from Level 4

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:245:30
   { source: "sets", target: "mutability" },
 
   // Up from Level 4
-  { source: "loops", target: "nested-loops" },
+  { source: "loops", target: "" },
   { source: "dictionaries", target: "mutability" },
   { source: "built-in-fns", target: "input-output" },

[NoCoverage] ObjectLiteral
src/main/data/conceptGraph.ts:246:3
 
   // Up from Level 4
   { source: "loops", target: "nested-loops" },
-  { source: "dictionaries", target: "mutability" },
+  {},
   { source: "built-in-fns", target: "input-output" },
   { source: "built-in-fns", target: "files" },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:246:13
 
   // Up from Level 4
   { source: "loops", target: "nested-loops" },
-  { source: "dictionaries", target: "mutability" },
+  { source: "", target: "mutability" },
   { source: "built-in-fns", target: "input-output" },
   { source: "built-in-fns", target: "files" },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:248:13
   { source: "loops", target: "nested-loops" },
   { source: "dictionaries", target: "mutability" },
   { source: "built-in-fns", target: "input-output" },
-  { source: "built-in-fns", target: "files" },
+  { source: "", target: "files" },
   { source: "methods", target: "string-methods" },
   { source: "methods", target: "modules" },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:249:32
   { source: "dictionaries", target: "mutability" },
   { source: "built-in-fns", target: "input-output" },
   { source: "built-in-fns", target: "files" },
-  { source: "methods", target: "string-methods" },
+  { source: "methods", target: "" },
   { source: "methods", target: "modules" },
   { source: "nested-lists", target: "nested-loops" },

[NoCoverage] ObjectLiteral
src/main/data/conceptGraph.ts:249:3
   { source: "dictionaries", target: "mutability" },
   { source: "built-in-fns", target: "input-output" },
   { source: "built-in-fns", target: "files" },
-  { source: "methods", target: "string-methods" },
+  {},
   { source: "methods", target: "modules" },
   { source: "nested-lists", target: "nested-loops" },

[NoCoverage] StringLiteral
src/main/data/conceptGraph.ts:250:13
   { source: "built-in-fns", target: "input-output" },
   { source: "built-in-fns", target: "files" },
   { source: "methods", target: "string-methods" },
-  { source: "methods", target: "modules" },
+  { source: "", target: "modules" },
   { source: "nested-lists", target: "nested-loops" },
 ];
