[NoCoverage] ArrowFunction
src/main/pages/HomePage.tsx:19:19
 import { conceptContent, type ConceptContent } from "../data/conceptContent";
 import { useCurrentUser } from "../utils/currentUser";
 
-const normalize = (s: string) => s.replace(/\\n/g, "\n");
+const normalize = () => undefined;
 
 function toPastel(hex: string, strength: number = 0.1): string {

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:19:52
 import { conceptContent, type ConceptContent } from "../data/conceptContent";
 import { useCurrentUser } from "../utils/currentUser";
 
-const normalize = (s: string) => s.replace(/\\n/g, "\n");
+const normalize = (s: string) => s.replace(/\\n/g, "");
 
 function toPastel(hex: string, strength: number = 0.1): string {

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:21:64
 
 const normalize = (s: string) => s.replace(/\\n/g, "\n");
 
-function toPastel(hex: string, strength: number = 0.1): string {
-  const r = parseInt(hex.slice(1, 3), 16);
-  const g = parseInt(hex.slice(3, 5), 16);
-  const b = parseInt(hex.slice(5, 7), 16);
-  return `rgb(${Math.round(r * strength + 255 * (1 - strength))}, ${Math.round(g * strength + 255 * (1 - strength))}, ${Math.round(b * strength + 255 * (1 - strength))})`;
-}
+function toPastel(hex: string, strength: number = 0.1): string {}
 
 // Walk the prereq graph upward from tagged concepts to include all ancestors

[NoCoverage] MethodExpression
src/main/pages/HomePage.tsx:22:22
 const normalize = (s: string) => s.replace(/\\n/g, "\n");
 
 function toPastel(hex: string, strength: number = 0.1): string {
-  const r = parseInt(hex.slice(1, 3), 16);
+  const r = parseInt(hex, 16);
   const g = parseInt(hex.slice(3, 5), 16);
   const b = parseInt(hex.slice(5, 7), 16);

[NoCoverage] ArithmeticOperator
src/main/pages/HomePage.tsx:25:43
   const r = parseInt(hex.slice(1, 3), 16);
   const g = parseInt(hex.slice(3, 5), 16);
   const b = parseInt(hex.slice(5, 7), 16);
-  return `rgb(${Math.round(r * strength + 255 * (1 - strength))}, ${Math.round(g * strength + 255 * (1 - strength))}, ${Math.round(b * strength + 255 * (1 - strength))})`;
+  return `rgb(${Math.round(r * strength + 255 / (1 - strength))}, ${Math.round(g * strength + 255 * (1 - strength))}, ${Math.round(b * strength + 255 * (1 - strength))})`;
 }
 

[NoCoverage] ArithmeticOperator
src/main/pages/HomePage.tsx:25:95
   const r = parseInt(hex.slice(1, 3), 16);
   const g = parseInt(hex.slice(3, 5), 16);
   const b = parseInt(hex.slice(5, 7), 16);
-  return `rgb(${Math.round(r * strength + 255 * (1 - strength))}, ${Math.round(g * strength + 255 * (1 - strength))}, ${Math.round(b * strength + 255 * (1 - strength))})`;
+  return `rgb(${Math.round(r * strength + 255 * (1 - strength))}, ${Math.round(g * strength + 255 / (1 - strength))}, ${Math.round(b * strength + 255 * (1 - strength))})`;
 }
 

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:29:60
 }
 
 // Walk the prereq graph upward from tagged concepts to include all ancestors
-function computeSubgraph(taggedIds: string[]): Set<string> {
-  const result = new Set<string>(taggedIds);
-  let changed = true;
-  while (changed) {
-    changed = false;
-    for (const { source, target } of prereqEdgeData) {
-      if (result.has(target) && !result.has(source)) {
-        result.add(source);
-        changed = true;
-      }
-    }
-  }
-  return result;
-}
+function computeSubgraph(taggedIds: string[]): Set<string> {}
 
 interface SavedDetailCard {

[NoCoverage] BooleanLiteral
src/main/pages/HomePage.tsx:31:17
 // Walk the prereq graph upward from tagged concepts to include all ancestors
 function computeSubgraph(taggedIds: string[]): Set<string> {
   const result = new Set<string>(taggedIds);
-  let changed = true;
+  let changed = false;
   while (changed) {
     changed = false;

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:32:19
 function computeSubgraph(taggedIds: string[]): Set<string> {
   const result = new Set<string>(taggedIds);
   let changed = true;
-  while (changed) {
-    changed = false;
-    for (const { source, target } of prereqEdgeData) {
-      if (result.has(target) && !result.has(source)) {
-        result.add(source);
-        changed = true;
-      }
-    }
-  }
+  while (changed) {}
   return result;
 }

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:32:10
 function computeSubgraph(taggedIds: string[]): Set<string> {
   const result = new Set<string>(taggedIds);
   let changed = true;
-  while (changed) {
+  while (false) {
     changed = false;
     for (const { source, target } of prereqEdgeData) {

[NoCoverage] BooleanLiteral
src/main/pages/HomePage.tsx:33:15
   const result = new Set<string>(taggedIds);
   let changed = true;
   while (changed) {
-    changed = false;
+    changed = true;
     for (const { source, target } of prereqEdgeData) {
       if (result.has(target) && !result.has(source)) {

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:34:54
   let changed = true;
   while (changed) {
     changed = false;
-    for (const { source, target } of prereqEdgeData) {
-      if (result.has(target) && !result.has(source)) {
-        result.add(source);
-        changed = true;
-      }
-    }
+    for (const { source, target } of prereqEdgeData) {}
   }
   return result;

[NoCoverage] LogicalOperator
src/main/pages/HomePage.tsx:35:11
   while (changed) {
     changed = false;
     for (const { source, target } of prereqEdgeData) {
-      if (result.has(target) && !result.has(source)) {
+      if (result.has(target) || !result.has(source)) {
         result.add(source);
         changed = true;

[NoCoverage] BooleanLiteral
src/main/pages/HomePage.tsx:35:33
   while (changed) {
     changed = false;
     for (const { source, target } of prereqEdgeData) {
-      if (result.has(target) && !result.has(source)) {
+      if (result.has(target) && result.has(source)) {
         result.add(source);
         changed = true;

[NoCoverage] BooleanLiteral
src/main/pages/HomePage.tsx:37:19
     for (const { source, target } of prereqEdgeData) {
       if (result.has(target) && !result.has(source)) {
         result.add(source);
-        changed = true;
+        changed = false;
       }
     }

[NoCoverage] OptionalChaining
src/main/pages/HomePage.tsx:56:33
 export default function HomePage() {
   const currentUser = useCurrentUser();
   // Derive the numeric id from the users table; null when not logged in.
-  const userId: number | null = currentUser?.loggedIn
+  const userId: number | null = currentUser.loggedIn
     ? ((currentUser.root as { user?: { id?: number } })?.user?.id ?? null)
     : null;

[NoCoverage] OptionalChaining
src/main/pages/HomePage.tsx:57:8
   const currentUser = useCurrentUser();
   // Derive the numeric id from the users table; null when not logged in.
   const userId: number | null = currentUser?.loggedIn
-    ? ((currentUser.root as { user?: { id?: number } })?.user?.id ?? null)
+    ? ((currentUser.root as {
+  user?: {
+    id?: number;
+  };
+})?.user.id ?? null)
     : null;
 

[NoCoverage] OptionalChaining
src/main/pages/HomePage.tsx:57:8
   const currentUser = useCurrentUser();
   // Derive the numeric id from the users table; null when not logged in.
   const userId: number | null = currentUser?.loggedIn
-    ? ((currentUser.root as { user?: { id?: number } })?.user?.id ?? null)
+    ? ((currentUser.root as {
+  user?: {
+    id?: number;
+  };
+}).user?.id ?? null)
     : null;
 

[NoCoverage] ArrayDeclaration
src/main/pages/HomePage.tsx:60:64
     ? ((currentUser.root as { user?: { id?: number } })?.user?.id ?? null)
     : null;
 
-  const [assessments, setAssessments] = useState<Assessment[]>([]);
+  const [assessments, setAssessments] = useState<Assessment[]>(["Stryker was here"]);
   const [questions, setQuestions] = useState<Question[]>([]);
   const [selectedAssessmentId, setSelectedAssessmentId] = useState("");

[NoCoverage] BooleanLiteral
src/main/pages/HomePage.tsx:73:52
   >(new Map());
   const [selectedItem, setSelectedItem] = useState<string | null>(null);
   const [starredIds, setStarredIds] = useState<Set<string>>(new Set());
-  const [closeHovered, setCloseHovered] = useState(false);
+  const [closeHovered, setCloseHovered] = useState(true);
   const [savedDetailCards, setSavedDetailCards] = useState<SavedDetailCard[]>(
     [],

[NoCoverage] ArrayDeclaration
src/main/pages/HomePage.tsx:75:5
   const [starredIds, setStarredIds] = useState<Set<string>>(new Set());
   const [closeHovered, setCloseHovered] = useState(false);
   const [savedDetailCards, setSavedDetailCards] = useState<SavedDetailCard[]>(
-    [],
+    ["Stryker was here"],
   );
   const [initialDetailCards, setInitialDetailCards] = useState<

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:88:19
   );
 
   const masteredSubconceptsRef = useRef<Set<string>>(masteredSubconcepts);
-  useEffect(() => {
-    masteredSubconceptsRef.current = masteredSubconcepts;
-  }, [masteredSubconcepts]);
+  useEffect(() => {}, [masteredSubconcepts]);
 
   const starredIdsRef = useRef<Set<string>>(starredIds);

[NoCoverage] ArrayDeclaration
src/main/pages/HomePage.tsx:90:6
   const masteredSubconceptsRef = useRef<Set<string>>(masteredSubconcepts);
   useEffect(() => {
     masteredSubconceptsRef.current = masteredSubconcepts;
-  }, [masteredSubconcepts]);
+  }, []);
 
   const starredIdsRef = useRef<Set<string>>(starredIds);

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:93:19
   }, [masteredSubconcepts]);
 
   const starredIdsRef = useRef<Set<string>>(starredIds);
-  useEffect(() => {
-    starredIdsRef.current = starredIds;
-  }, [starredIds]);
+  useEffect(() => {}, [starredIds]);
 
   const savedDetailCardsRef = useRef<SavedDetailCard[]>(savedDetailCards);

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:98:19
   }, [starredIds]);
 
   const savedDetailCardsRef = useRef<SavedDetailCard[]>(savedDetailCards);
-  useEffect(() => {
-    savedDetailCardsRef.current = savedDetailCards;
-  }, [savedDetailCards]);
+  useEffect(() => {}, [savedDetailCards]);
 
   // Load the user's saved state once on login.

[NoCoverage] ArrayDeclaration
src/main/pages/HomePage.tsx:100:6
   const savedDetailCardsRef = useRef<SavedDetailCard[]>(savedDetailCards);
   useEffect(() => {
     savedDetailCardsRef.current = savedDetailCards;
-  }, [savedDetailCards]);
+  }, []);
 
   // Load the user's saved state once on login.

[NoCoverage] BooleanLiteral
src/main/pages/HomePage.tsx:103:37
   }, [savedDetailCards]);
 
   // Load the user's saved state once on login.
-  const userStateLoadedRef = useRef(false);
+  const userStateLoadedRef = useRef(true);
   useEffect(() => {
     if (!userId || userStateLoadedRef.current) return;

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:104:19
 
   // Load the user's saved state once on login.
   const userStateLoadedRef = useRef(false);
-  useEffect(() => {
-    if (!userId || userStateLoadedRef.current) return;
-    userStateLoadedRef.current = true;
-
-    logUserActivity({
-      userid: userId,
-      event_type: "login",
-      payload: { consented: true },
-    });
-
-    fetchUserState(userId).then((data) => {
-      if (data) {
-        setStarredIds(new Set(data.starred_ids as string[]));
-        const cards = (data.detail_cards as SavedDetailCard[]) ?? [];
-        setSavedDetailCards(cards);
-        setAddedDetailKeys(
-          new Set(cards.map((c) => `${c.cardType}:${c.itemLabel}`)),
-        );
-        setInitialDetailCards(cards);
-        setMasteredSubconcepts(
-          new Set((data.mastered_subconcepts ?? []) as string[]),
-        );
-      }
-    });
-  }, [userId]);
+  useEffect(() => {}, [userId]);
 
   const persistState = useCallback(

[NoCoverage] BooleanLiteral
src/main/pages/HomePage.tsx:105:9
   // Load the user's saved state once on login.
   const userStateLoadedRef = useRef(false);
   useEffect(() => {
-    if (!userId || userStateLoadedRef.current) return;
+    if (userId || userStateLoadedRef.current) return;
     userStateLoadedRef.current = true;
 

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:105:9
   // Load the user's saved state once on login.
   const userStateLoadedRef = useRef(false);
   useEffect(() => {
-    if (!userId || userStateLoadedRef.current) return;
+    if (true) return;
     userStateLoadedRef.current = true;
 

[NoCoverage] BooleanLiteral
src/main/pages/HomePage.tsx:106:34
   const userStateLoadedRef = useRef(false);
   useEffect(() => {
     if (!userId || userStateLoadedRef.current) return;
-    userStateLoadedRef.current = true;
+    userStateLoadedRef.current = false;
 
     logUserActivity({

[NoCoverage] ObjectLiteral
src/main/pages/HomePage.tsx:108:21
     if (!userId || userStateLoadedRef.current) return;
     userStateLoadedRef.current = true;
 
-    logUserActivity({
-      userid: userId,
-      event_type: "login",
-      payload: { consented: true },
-    });
+    logUserActivity({});
 
     fetchUserState(userId).then((data) => {

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:110:19
 
     logUserActivity({
       userid: userId,
-      event_type: "login",
+      event_type: "",
       payload: { consented: true },
     });

[NoCoverage] BooleanLiteral
src/main/pages/HomePage.tsx:111:29
     logUserActivity({
       userid: userId,
       event_type: "login",
-      payload: { consented: true },
+      payload: { consented: false },
     });
 

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:114:43
       payload: { consented: true },
     });
 
-    fetchUserState(userId).then((data) => {
-      if (data) {
-        setStarredIds(new Set(data.starred_ids as string[]));
-        const cards = (data.detail_cards as SavedDetailCard[]) ?? [];
-        setSavedDetailCards(cards);
-        setAddedDetailKeys(
-          new Set(cards.map((c) => `${c.cardType}:${c.itemLabel}`)),
-        );
-        setInitialDetailCards(cards);
-        setMasteredSubconcepts(
-          new Set((data.mastered_subconcepts ?? []) as string[]),
-        );
-      }
-    });
+    fetchUserState(userId).then((data) => {});
   }, [userId]);
 

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:115:11
     });
 
     fetchUserState(userId).then((data) => {
-      if (data) {
+      if (false) {
         setStarredIds(new Set(data.starred_ids as string[]));
         const cards = (data.detail_cards as SavedDetailCard[]) ?? [];

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:115:11
     });
 
     fetchUserState(userId).then((data) => {
-      if (data) {
+      if (true) {
         setStarredIds(new Set(data.starred_ids as string[]));
         const cards = (data.detail_cards as SavedDetailCard[]) ?? [];

[NoCoverage] LogicalOperator
src/main/pages/HomePage.tsx:117:23
     fetchUserState(userId).then((data) => {
       if (data) {
         setStarredIds(new Set(data.starred_ids as string[]));
-        const cards = (data.detail_cards as SavedDetailCard[]) ?? [];
+        const cards = data.detail_cards as SavedDetailCard[] && [];
         setSavedDetailCards(cards);
         setAddedDetailKeys(

[NoCoverage] ArrowFunction
src/main/pages/HomePage.tsx:120:29
         const cards = (data.detail_cards as SavedDetailCard[]) ?? [];
         setSavedDetailCards(cards);
         setAddedDetailKeys(
-          new Set(cards.map((c) => `${c.cardType}:${c.itemLabel}`)),
+          new Set(cards.map(() => undefined)),
         );
         setInitialDetailCards(cards);

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:120:36
         const cards = (data.detail_cards as SavedDetailCard[]) ?? [];
         setSavedDetailCards(cards);
         setAddedDetailKeys(
-          new Set(cards.map((c) => `${c.cardType}:${c.itemLabel}`)),
+          new Set(cards.map((c) => ``)),
         );
         setInitialDetailCards(cards);

[NoCoverage] ArrayDeclaration
src/main/pages/HomePage.tsx:128:6
         );
       }
     });
-  }, [userId]);
+  }, []);
 
   const persistState = useCallback(

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:135:10
       stars: Set<string>,
       cards: SavedDetailCard[],
       mastered: Set<string> = masteredSubconceptsRef.current,
-    ) => {
-      if (!userId) return;
-      await saveUserState({
-        userid: userId,
-        starred_ids: Array.from(stars),
-        detail_cards: cards,
-        mastered_subconcepts: Array.from(mastered),
-      });
-    },
+    ) => {},
     [userId],
   );

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:136:11
       cards: SavedDetailCard[],
       mastered: Set<string> = masteredSubconceptsRef.current,
     ) => {
-      if (!userId) return;
+      if (true) return;
       await saveUserState({
         userid: userId,

[NoCoverage] BooleanLiteral
src/main/pages/HomePage.tsx:136:11
       cards: SavedDetailCard[],
       mastered: Set<string> = masteredSubconceptsRef.current,
     ) => {
-      if (!userId) return;
+      if (userId) return;
       await saveUserState({
         userid: userId,

[NoCoverage] ObjectLiteral
src/main/pages/HomePage.tsx:137:27
       mastered: Set<string> = masteredSubconceptsRef.current,
     ) => {
       if (!userId) return;
-      await saveUserState({
-        userid: userId,
-        starred_ids: Array.from(stars),
-        detail_cards: cards,
-        mastered_subconcepts: Array.from(mastered),
-      });
+      await saveUserState({});
     },
     [userId],

[NoCoverage] ArrayDeclaration
src/main/pages/HomePage.tsx:144:5
         mastered_subconcepts: Array.from(mastered),
       });
     },
-    [userId],
+    [],
   );
 

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:147:53
     [userId],
   );
 
-  const handleSubconceptMastered = (sub: string) => {
-    setMasteredSubconcepts((prev) => {
-      const next = new Set(prev);
-      if (next.has(sub)) {
-        next.delete(sub);
-      } else {
-        next.add(sub);
-      }
-      persistState(starredIdsRef.current, savedDetailCardsRef.current, next);
-      return next;
-    });
-  };
+  const handleSubconceptMastered = (sub: string) => {};
 
   const logActivity = useCallback(

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:148:38
   );
 
   const handleSubconceptMastered = (sub: string) => {
-    setMasteredSubconcepts((prev) => {
-      const next = new Set(prev);
-      if (next.has(sub)) {
-        next.delete(sub);
-      } else {
-        next.add(sub);
-      }
-      persistState(starredIdsRef.current, savedDetailCardsRef.current, next);
-      return next;
-    });
+    setMasteredSubconcepts((prev) => {});
   };
 

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:150:11
   const handleSubconceptMastered = (sub: string) => {
     setMasteredSubconcepts((prev) => {
       const next = new Set(prev);
-      if (next.has(sub)) {
+      if (true) {
         next.delete(sub);
       } else {

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:150:11
   const handleSubconceptMastered = (sub: string) => {
     setMasteredSubconcepts((prev) => {
       const next = new Set(prev);
-      if (next.has(sub)) {
+      if (false) {
         next.delete(sub);
       } else {

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:152:14
       const next = new Set(prev);
       if (next.has(sub)) {
         next.delete(sub);
-      } else {
-        next.add(sub);
-      }
+      } else {}
       persistState(starredIdsRef.current, savedDetailCardsRef.current, next);
       return next;

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:161:51
   };
 
   const logActivity = useCallback(
-    async (eventType: string, payload: object) => {
-      if (!userId) return;
-      await logUserActivity({ userid: userId, event_type: eventType, payload });
-    },
+    async (eventType: string, payload: object) => {},
     [userId],
   );

[NoCoverage] BooleanLiteral
src/main/pages/HomePage.tsx:162:11
 
   const logActivity = useCallback(
     async (eventType: string, payload: object) => {
-      if (!userId) return;
+      if (userId) return;
       await logUserActivity({ userid: userId, event_type: eventType, payload });
     },

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:162:11
 
   const logActivity = useCallback(
     async (eventType: string, payload: object) => {
-      if (!userId) return;
+      if (true) return;
       await logUserActivity({ userid: userId, event_type: eventType, payload });
     },

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:168:33
     [userId],
   );
 
-  const handlePaneClick = () => {
-    if (!selectedQuestionId) {
-      setSelectedConceptId(null);
-      setSelectedItem(null);
-      setHighlightedIds(new Set());
-    }
-  };
+  const handlePaneClick = () => {};
 
   useEffect(() => {

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:169:9
   );
 
   const handlePaneClick = () => {
-    if (!selectedQuestionId) {
+    if (true) {
       setSelectedConceptId(null);
       setSelectedItem(null);

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:169:30
   );
 
   const handlePaneClick = () => {
-    if (!selectedQuestionId) {
-      setSelectedConceptId(null);
-      setSelectedItem(null);
-      setHighlightedIds(new Set());
-    }
+    if (!selectedQuestionId) {}
   };
 

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:176:19
     }
   };
 
-  useEffect(() => {
-    fetchAssessments().then(setAssessments);
-  }, []);
+  useEffect(() => {}, []);
 
   useEffect(() => {

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:180:19
     fetchAssessments().then(setAssessments);
   }, []);
 
-  useEffect(() => {
-    if (!selectedAssessmentId) {
-      // eslint-disable-next-line react-hooks/set-state-in-effect
-      setQuestions([]);
-      return;
-    }
-    fetchQuestions(selectedAssessmentId).then(setQuestions);
-    setSelectedQuestionId("");
-    setHighlightedIds(new Set());
-    setSelectedConceptId(null);
-    setHighlightedSubconcepts(new Map());
-  }, [selectedAssessmentId]);
+  useEffect(() => {}, [selectedAssessmentId]);
 
   useEffect(() => {

[NoCoverage] BooleanLiteral
src/main/pages/HomePage.tsx:181:9
   }, []);
 
   useEffect(() => {
-    if (!selectedAssessmentId) {
+    if (selectedAssessmentId) {
       // eslint-disable-next-line react-hooks/set-state-in-effect
       setQuestions([]);

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:181:32
   }, []);
 
   useEffect(() => {
-    if (!selectedAssessmentId) {
-      // eslint-disable-next-line react-hooks/set-state-in-effect
-      setQuestions([]);
-      return;
-    }
+    if (!selectedAssessmentId) {}
     fetchQuestions(selectedAssessmentId).then(setQuestions);
     setSelectedQuestionId("");

[NoCoverage] ArrayDeclaration
src/main/pages/HomePage.tsx:183:20
   useEffect(() => {
     if (!selectedAssessmentId) {
       // eslint-disable-next-line react-hooks/set-state-in-effect
-      setQuestions([]);
+      setQuestions(["Stryker was here"]);
       return;
     }

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:193:19
     setHighlightedSubconcepts(new Map());
   }, [selectedAssessmentId]);
 
-  useEffect(() => {
-    if (!selectedQuestionId) {
-      // eslint-disable-next-line react-hooks/set-state-in-effect
-      setHighlightedIds(new Set());
-
-      setHighlightedSubconcepts(new Map());
-      return;
-    }
-    fetchQuestionConcepts(selectedQuestionId).then((concepts) => {
-      setHighlightedIds(computeSubgraph(concepts.map((c) => c.concept_id)));
-      const subMap = new Map<string, Set<string>>();
-      concepts.forEach((c) => {
-        if (c.subconcept_label) {
-          if (!subMap.has(c.concept_id)) subMap.set(c.concept_id, new Set());
-          subMap.get(c.concept_id)!.add(normalize(c.subconcept_label));
-        }
-      });
-      setHighlightedSubconcepts(subMap);
-    });
-    setSelectedConceptId(null);
-    logActivity("question_viewed", { questionId: selectedQuestionId });
-  }, [logActivity, selectedQuestionId]);
+  useEffect(() => {}, [logActivity, selectedQuestionId]);
 
   useEffect(() => {

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:194:9
   }, [selectedAssessmentId]);
 
   useEffect(() => {
-    if (!selectedQuestionId) {
+    if (true) {
       // eslint-disable-next-line react-hooks/set-state-in-effect
       setHighlightedIds(new Set());

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:194:30
   }, [selectedAssessmentId]);
 
   useEffect(() => {
-    if (!selectedQuestionId) {
-      // eslint-disable-next-line react-hooks/set-state-in-effect
-      setHighlightedIds(new Set());
-
-      setHighlightedSubconcepts(new Map());
-      return;
-    }
+    if (!selectedQuestionId) {}
     fetchQuestionConcepts(selectedQuestionId).then((concepts) => {
       setHighlightedIds(computeSubgraph(concepts.map((c) => c.concept_id)));

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:201:66
       setHighlightedSubconcepts(new Map());
       return;
     }
-    fetchQuestionConcepts(selectedQuestionId).then((concepts) => {
-      setHighlightedIds(computeSubgraph(concepts.map((c) => c.concept_id)));
-      const subMap = new Map<string, Set<string>>();
-      concepts.forEach((c) => {
-        if (c.subconcept_label) {
-          if (!subMap.has(c.concept_id)) subMap.set(c.concept_id, new Set());
-          subMap.get(c.concept_id)!.add(normalize(c.subconcept_label));
-        }
-      });
-      setHighlightedSubconcepts(subMap);
-    });
+    fetchQuestionConcepts(selectedQuestionId).then((concepts) => {});
     setSelectedConceptId(null);
     logActivity("question_viewed", { questionId: selectedQuestionId });

[NoCoverage] ArrowFunction
src/main/pages/HomePage.tsx:202:54
       return;
     }
     fetchQuestionConcepts(selectedQuestionId).then((concepts) => {
-      setHighlightedIds(computeSubgraph(concepts.map((c) => c.concept_id)));
+      setHighlightedIds(computeSubgraph(concepts.map(() => undefined)));
       const subMap = new Map<string, Set<string>>();
       concepts.forEach((c) => {

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:204:31
     fetchQuestionConcepts(selectedQuestionId).then((concepts) => {
       setHighlightedIds(computeSubgraph(concepts.map((c) => c.concept_id)));
       const subMap = new Map<string, Set<string>>();
-      concepts.forEach((c) => {
-        if (c.subconcept_label) {
-          if (!subMap.has(c.concept_id)) subMap.set(c.concept_id, new Set());
-          subMap.get(c.concept_id)!.add(normalize(c.subconcept_label));
-        }
-      });
+      concepts.forEach((c) => {});
       setHighlightedSubconcepts(subMap);
     });

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:205:13
       setHighlightedIds(computeSubgraph(concepts.map((c) => c.concept_id)));
       const subMap = new Map<string, Set<string>>();
       concepts.forEach((c) => {
-        if (c.subconcept_label) {
+        if (false) {
           if (!subMap.has(c.concept_id)) subMap.set(c.concept_id, new Set());
           subMap.get(c.concept_id)!.add(normalize(c.subconcept_label));

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:205:13
       setHighlightedIds(computeSubgraph(concepts.map((c) => c.concept_id)));
       const subMap = new Map<string, Set<string>>();
       concepts.forEach((c) => {
-        if (c.subconcept_label) {
+        if (true) {
           if (!subMap.has(c.concept_id)) subMap.set(c.concept_id, new Set());
           subMap.get(c.concept_id)!.add(normalize(c.subconcept_label));

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:206:15
       const subMap = new Map<string, Set<string>>();
       concepts.forEach((c) => {
         if (c.subconcept_label) {
-          if (!subMap.has(c.concept_id)) subMap.set(c.concept_id, new Set());
+          if (true) subMap.set(c.concept_id, new Set());
           subMap.get(c.concept_id)!.add(normalize(c.subconcept_label));
         }

[NoCoverage] BooleanLiteral
src/main/pages/HomePage.tsx:206:15
       const subMap = new Map<string, Set<string>>();
       concepts.forEach((c) => {
         if (c.subconcept_label) {
-          if (!subMap.has(c.concept_id)) subMap.set(c.concept_id, new Set());
+          if (subMap.has(c.concept_id)) subMap.set(c.concept_id, new Set());
           subMap.get(c.concept_id)!.add(normalize(c.subconcept_label));
         }

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:213:17
       setHighlightedSubconcepts(subMap);
     });
     setSelectedConceptId(null);
-    logActivity("question_viewed", { questionId: selectedQuestionId });
+    logActivity("", { questionId: selectedQuestionId });
   }, [logActivity, selectedQuestionId]);
 

[NoCoverage] ObjectLiteral
src/main/pages/HomePage.tsx:213:36
       setHighlightedSubconcepts(subMap);
     });
     setSelectedConceptId(null);
-    logActivity("question_viewed", { questionId: selectedQuestionId });
+    logActivity("question_viewed", {});
   }, [logActivity, selectedQuestionId]);
 

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:216:19
     logActivity("question_viewed", { questionId: selectedQuestionId });
   }, [logActivity, selectedQuestionId]);
 
-  useEffect(() => {
-    // eslint-disable-next-line react-hooks/set-state-in-effect
-    setSelectedItem(null);
-  }, [selectedConceptId]);
+  useEffect(() => {}, [selectedConceptId]);
 
   useEffect(() => {

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:221:19
     setSelectedItem(null);
   }, [selectedConceptId]);
 
-  useEffect(() => {
-    if (!selectedItem || !selectedConceptId) return;
-    logActivity("detail_visited", {
-      conceptId: selectedConceptId,
-      itemLabel: selectedItem,
-    });
-  }, [logActivity, selectedConceptId, selectedItem]);
+  useEffect(() => {}, [logActivity, selectedConceptId, selectedItem]);
 
   const selectedConcept = selectedConceptId
