[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:222:9
   }, [selectedConceptId]);
 
   useEffect(() => {
-    if (!selectedItem || !selectedConceptId) return;
+    if (true) return;
     logActivity("detail_visited", {
       conceptId: selectedConceptId,

[NoCoverage] BooleanLiteral
src/main/pages/HomePage.tsx:222:9
   }, [selectedConceptId]);
 
   useEffect(() => {
-    if (!selectedItem || !selectedConceptId) return;
+    if (selectedItem || !selectedConceptId) return;
     logActivity("detail_visited", {
       conceptId: selectedConceptId,

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:223:17
 
   useEffect(() => {
     if (!selectedItem || !selectedConceptId) return;
-    logActivity("detail_visited", {
+    logActivity("", {
       conceptId: selectedConceptId,
       itemLabel: selectedItem,

[NoCoverage] ObjectLiteral
src/main/pages/HomePage.tsx:223:35
 
   useEffect(() => {
     if (!selectedItem || !selectedConceptId) return;
-    logActivity("detail_visited", {
-      conceptId: selectedConceptId,
-      itemLabel: selectedItem,
-    });
+    logActivity("detail_visited", {});
   }, [logActivity, selectedConceptId, selectedItem]);
 

[NoCoverage] ArrayDeclaration
src/main/pages/HomePage.tsx:227:6
       conceptId: selectedConceptId,
       itemLabel: selectedItem,
     });
-  }, [logActivity, selectedConceptId, selectedItem]);
+  }, []);
 
   const selectedConcept = selectedConceptId

[NoCoverage] ArrowFunction
src/main/pages/HomePage.tsx:230:26
   }, [logActivity, selectedConceptId, selectedItem]);
 
   const selectedConcept = selectedConceptId
-    ? majorConcepts.find((c) => c.id === selectedConceptId)
+    ? majorConcepts.find(() => undefined)
     : null;
 

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:230:33
   }, [logActivity, selectedConceptId, selectedItem]);
 
   const selectedConcept = selectedConceptId
-    ? majorConcepts.find((c) => c.id === selectedConceptId)
+    ? majorConcepts.find((c) => true)
     : null;
 

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:233:46
     ? majorConcepts.find((c) => c.id === selectedConceptId)
     : null;
 
-  const handleConceptClick = (id: string) => {
-    setSelectedConceptId(id);
-    if (!selectedQuestionId) {
-      setHighlightedIds(computeSubgraph([id]));
-    }
-    logActivity("concept_clicked", { conceptId: id });
-  };
+  const handleConceptClick = (id: string) => {};
 
   const handleStarClick = (id: string) => {

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:235:9
 
   const handleConceptClick = (id: string) => {
     setSelectedConceptId(id);
-    if (!selectedQuestionId) {
+    if (true) {
       setHighlightedIds(computeSubgraph([id]));
     }

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:235:30
 
   const handleConceptClick = (id: string) => {
     setSelectedConceptId(id);
-    if (!selectedQuestionId) {
-      setHighlightedIds(computeSubgraph([id]));
-    }
+    if (!selectedQuestionId) {}
     logActivity("concept_clicked", { conceptId: id });
   };

[NoCoverage] ArrayDeclaration
src/main/pages/HomePage.tsx:236:41
   const handleConceptClick = (id: string) => {
     setSelectedConceptId(id);
     if (!selectedQuestionId) {
-      setHighlightedIds(computeSubgraph([id]));
+      setHighlightedIds(computeSubgraph([]));
     }
     logActivity("concept_clicked", { conceptId: id });

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:241:43
     logActivity("concept_clicked", { conceptId: id });
   };
 
-  const handleStarClick = (id: string) => {
-    setStarredIds((prev) => {
-      const next = new Set(prev);
-      if (next.has(id)) {
-        next.delete(id);
-      } else {
-        next.add(id);
-      }
-      persistState(next, savedDetailCardsRef.current);
-      return next;
-    });
-  };
+  const handleStarClick = (id: string) => {};
 
   const handleReset = () => {

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:242:29
   };
 
   const handleStarClick = (id: string) => {
-    setStarredIds((prev) => {
-      const next = new Set(prev);
-      if (next.has(id)) {
-        next.delete(id);
-      } else {
-        next.add(id);
-      }
-      persistState(next, savedDetailCardsRef.current);
-      return next;
-    });
+    setStarredIds((prev) => {});
   };
 

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:254:29
     });
   };
 
-  const handleReset = () => {
-    setStarredIds(new Set());
-    setHighlightedIds(new Set());
-    setHighlightedSubconcepts(new Map());
-    setSelectedConceptId(null);
-    setSelectedItem(null);
-    setSelectedQuestionId("");
-    setSavedDetailCards([]);
-    setAddedDetailKeys(new Set());
-    setMasteredSubconcepts(new Set());
-    persistState(new Set(), [], new Set());
-  };
+  const handleReset = () => {};
 
   const handleDetailAdded = (card: SavedDetailCard) => {

[NoCoverage] ArrayDeclaration
src/main/pages/HomePage.tsx:264:29
     setSavedDetailCards([]);
     setAddedDetailKeys(new Set());
     setMasteredSubconcepts(new Set());
-    persistState(new Set(), [], new Set());
+    persistState(new Set(), ["Stryker was here"], new Set());
   };
 

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:267:56
     persistState(new Set(), [], new Set());
   };
 
-  const handleDetailAdded = (card: SavedDetailCard) => {
-    const key = `${card.cardType}:${card.itemLabel}`;
-    setAddedDetailKeys((prev) => new Set([...prev, key]));
-    setSavedDetailCards((prev) => {
-      const next = [...prev, card];
-      persistState(starredIdsRef.current, next);
-      return next;
-    });
-    logActivity("detail_added_to_graph", {
-      cardType: card.cardType,
-      itemLabel: card.itemLabel,
-      conceptId: card.conceptId,
-    });
-  };
+  const handleDetailAdded = (card: SavedDetailCard) => {};
 
   const handleDetailDeleted = (cardType: string, itemLabel: string) => {

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:268:17
   };
 
   const handleDetailAdded = (card: SavedDetailCard) => {
-    const key = `${card.cardType}:${card.itemLabel}`;
+    const key = ``;
     setAddedDetailKeys((prev) => new Set([...prev, key]));
     setSavedDetailCards((prev) => {

[NoCoverage] ArrowFunction
src/main/pages/HomePage.tsx:269:24
 
   const handleDetailAdded = (card: SavedDetailCard) => {
     const key = `${card.cardType}:${card.itemLabel}`;
-    setAddedDetailKeys((prev) => new Set([...prev, key]));
+    setAddedDetailKeys(() => undefined);
     setSavedDetailCards((prev) => {
       const next = [...prev, card];

[NoCoverage] ArrayDeclaration
src/main/pages/HomePage.tsx:269:42
 
   const handleDetailAdded = (card: SavedDetailCard) => {
     const key = `${card.cardType}:${card.itemLabel}`;
-    setAddedDetailKeys((prev) => new Set([...prev, key]));
+    setAddedDetailKeys((prev) => new Set([]));
     setSavedDetailCards((prev) => {
       const next = [...prev, card];

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:270:35
   const handleDetailAdded = (card: SavedDetailCard) => {
     const key = `${card.cardType}:${card.itemLabel}`;
     setAddedDetailKeys((prev) => new Set([...prev, key]));
-    setSavedDetailCards((prev) => {
-      const next = [...prev, card];
-      persistState(starredIdsRef.current, next);
-      return next;
-    });
+    setSavedDetailCards((prev) => {});
     logActivity("detail_added_to_graph", {
       cardType: card.cardType,

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:282:72
     });
   };
 
-  const handleDetailDeleted = (cardType: string, itemLabel: string) => {
-    const key = `${cardType}:${itemLabel}`;
-    setAddedDetailKeys((prev) => {
-      const s = new Set(prev);
-      s.delete(key);
-      return s;
-    });
-    setSavedDetailCards((prev) => {
-      const next = prev.filter(
-        (c) => !(c.cardType === cardType && c.itemLabel === itemLabel),
-      );
-      persistState(starredIdsRef.current, next);
-      return next;
-    });
-  };
+  const handleDetailDeleted = (cardType: string, itemLabel: string) => {};
 
   const handleDetailMoved = (

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:283:17
   };
 
   const handleDetailDeleted = (cardType: string, itemLabel: string) => {
-    const key = `${cardType}:${itemLabel}`;
+    const key = ``;
     setAddedDetailKeys((prev) => {
       const s = new Set(prev);

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:284:34
 
   const handleDetailDeleted = (cardType: string, itemLabel: string) => {
     const key = `${cardType}:${itemLabel}`;
-    setAddedDetailKeys((prev) => {
-      const s = new Set(prev);
-      s.delete(key);
-      return s;
-    });
+    setAddedDetailKeys((prev) => {});
     setSavedDetailCards((prev) => {
       const next = prev.filter(

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:289:35
       s.delete(key);
       return s;
     });
-    setSavedDetailCards((prev) => {
-      const next = prev.filter(
-        (c) => !(c.cardType === cardType && c.itemLabel === itemLabel),
-      );
-      persistState(starredIdsRef.current, next);
-      return next;
-    });
+    setSavedDetailCards((prev) => {});
   };
 

[NoCoverage] MethodExpression
src/main/pages/HomePage.tsx:290:20
       return s;
     });
     setSavedDetailCards((prev) => {
-      const next = prev.filter(
-        (c) => !(c.cardType === cardType && c.itemLabel === itemLabel),
-      );
+      const next = prev;
       persistState(starredIdsRef.current, next);
       return next;

[NoCoverage] LogicalOperator
src/main/pages/HomePage.tsx:291:18
     });
     setSavedDetailCards((prev) => {
       const next = prev.filter(
-        (c) => !(c.cardType === cardType && c.itemLabel === itemLabel),
+        (c) => !(c.cardType === cardType || c.itemLabel === itemLabel),
       );
       persistState(starredIdsRef.current, next);

[NoCoverage] EqualityOperator
src/main/pages/HomePage.tsx:291:18
     });
     setSavedDetailCards((prev) => {
       const next = prev.filter(
-        (c) => !(c.cardType === cardType && c.itemLabel === itemLabel),
+        (c) => !(c.cardType !== cardType && c.itemLabel === itemLabel),
       );
       persistState(starredIdsRef.current, next);

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:303:8
     itemLabel: string,
     posX: number,
     posY: number,
-  ) => {
-    setSavedDetailCards((prev) => {
-      const next = prev.map((c) =>
-        c.cardType === cardType && c.itemLabel === itemLabel
-          ? { ...c, posX, posY }
-          : c,
-      );
-      persistState(starredIdsRef.current, next);
-      return next;
-    });
-  };
+  ) => {};
 
   if (!currentUser?.loggedIn) {

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:304:35
     posX: number,
     posY: number,
   ) => {
-    setSavedDetailCards((prev) => {
-      const next = prev.map((c) =>
-        c.cardType === cardType && c.itemLabel === itemLabel
-          ? { ...c, posX, posY }
-          : c,
-      );
-      persistState(starredIdsRef.current, next);
-      return next;
-    });
+    setSavedDetailCards((prev) => {});
   };
 

[NoCoverage] ArrowFunction
src/main/pages/HomePage.tsx:305:29
     posY: number,
   ) => {
     setSavedDetailCards((prev) => {
-      const next = prev.map((c) =>
-        c.cardType === cardType && c.itemLabel === itemLabel
-          ? { ...c, posX, posY }
-          : c,
+      const next = prev.map(() => undefined,
       );
       persistState(starredIdsRef.current, next);

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:306:9
   ) => {
     setSavedDetailCards((prev) => {
       const next = prev.map((c) =>
-        c.cardType === cardType && c.itemLabel === itemLabel
+        true
           ? { ...c, posX, posY }
           : c,

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:306:9
   ) => {
     setSavedDetailCards((prev) => {
       const next = prev.map((c) =>
-        c.cardType === cardType && c.itemLabel === itemLabel
+        true && c.itemLabel === itemLabel
           ? { ...c, posX, posY }
           : c,

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:315:31
     });
   };
 
-  if (!currentUser?.loggedIn) {
-    return <ConsentScreen />;
-  }
+  if (!currentUser?.loggedIn) {}
 
   return (

[NoCoverage] OptionalChaining
src/main/pages/HomePage.tsx:315:8
     });
   };
 
-  if (!currentUser?.loggedIn) {
+  if (!currentUser.loggedIn) {
     return <ConsentScreen />;
   }

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:324:16
       style={{
         display: "flex",
         flexDirection: "column",
-        width: "100%",
+        width: "",
         flex: 1,
         minHeight: 0,

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:336:20
           height: 60,
           flexShrink: 0,
           background: "#f4e87b",
-          display: "flex",
+          display: "",
           alignItems: "center",
           gap: 12,

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:339:20
           display: "flex",
           alignItems: "center",
           gap: 12,
-          padding: "0 20px",
+          padding: "",
         }}
       >

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:348:25
             fontWeight: 800,
             fontSize: 20,
             color: "#1E293B",
-            background: "#d9f9ff",
+            background: "",
             padding: "4px 12px",
             borderRadius: 8,

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:362:29
         <AssessmentSelect
           assessments={assessments}
           selectedAssessmentId={selectedAssessmentId}
-          onSelect={(id) => {
-            setSelectedAssessmentId(id);
-            setSelectedQuestionId("");
-          }}
+          onSelect={(id) => {}}
         />
         <div style={{ flex: 1, maxWidth: 300 }}>

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:364:35
           selectedAssessmentId={selectedAssessmentId}
           onSelect={(id) => {
             setSelectedAssessmentId(id);
-            setSelectedQuestionId("");
+            setSelectedQuestionId("Stryker was here!");
           }}
         />

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:372:23
             questions={questions}
             selectedQuestionId={selectedQuestionId}
             onSelect={setSelectedQuestionId}
-            disabled={!selectedAssessmentId || questions.length === 0}
+            disabled={true}
           />
         </div>

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:372:48
             questions={questions}
             selectedQuestionId={selectedQuestionId}
             onSelect={setSelectedQuestionId}
-            disabled={!selectedAssessmentId || questions.length === 0}
+            disabled={!selectedAssessmentId || false}
           />
         </div>

[NoCoverage] ObjectLiteral
src/main/pages/HomePage.tsx:376:18
           />
         </div>
         <div
-          style={{
-            display: "flex",
-            alignItems: "center",
-            gap: 8,
-            marginLeft: "auto",
-            paddingRight: 0,
-          }}
+          style={{}}
         >
           <div

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:380:25
             display: "flex",
             alignItems: "center",
             gap: 8,
-            marginLeft: "auto",
+            marginLeft: "",
             paddingRight: 0,
           }}

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:389:26
               width: 28,
               height: 28,
               borderRadius: 6,
-              borderTop: "1.5px solid #1E293B",
+              borderTop: "",
               borderLeft: "1.5px solid #1E293B",
               borderRight: "4px solid #1E293B",

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:394:24
               borderRight: "4px solid #1E293B",
               borderBottom: "4px solid #1E293B",
               background: "#FACC15",
-              display: "flex",
+              display: "",
               alignItems: "center",
               justifyContent: "center",

[NoCoverage] ObjectLiteral
src/main/pages/HomePage.tsx:429:19
       </div>
 
       {/* ── Graph ── */}
-      <div style={{ flex: 1, minHeight: 0, background: "#ffffff" }}>
+      <div style={{}}>
         <ConceptGraph
           highlightedIds={highlightedIds}

[NoCoverage] ObjectLiteral
src/main/pages/HomePage.tsx:449:16
 
       {/* ── Bottom toolbar ── */}
       <div
-        style={{
-          position: "relative",
-          zIndex: 20,
-          flexShrink: 0,
-          background: "#f4e87b",
-        }}
+        style={{}}
       >
         {/* Main toolbar row */}

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:453:23
           position: "relative",
           zIndex: 20,
           flexShrink: 0,
-          background: "#f4e87b",
+          background: "",
         }}
       >

[NoCoverage] ArrowFunction
src/main/pages/HomePage.tsx:470:26
             <>
               {/* Main concept button */}
               <button
-                onClick={() =>
-                  setSelectedItem(
-                    selectedItem === selectedConcept.id
-                      ? null
-                      : selectedConcept.id,
-                  )
+                onClick={() => undefined
                 }
                 style={{

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:472:21
               <button
                 onClick={() =>
                   setSelectedItem(
-                    selectedItem === selectedConcept.id
+                    true
                       ? null
                       : selectedConcept.id,

[NoCoverage] EqualityOperator
src/main/pages/HomePage.tsx:472:21
               <button
                 onClick={() =>
                   setSelectedItem(
-                    selectedItem === selectedConcept.id
+                    selectedItem !== selectedConcept.id
                       ? null
                       : selectedConcept.id,

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:479:21
                 }
                 style={{
                   background:
-                    selectedItem === selectedConcept.id
+                    false
                       ? selectedConcept.color
                       : "#ffffff",

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:479:21
                 }
                 style={{
                   background:
-                    selectedItem === selectedConcept.id
+                    true
                       ? selectedConcept.color
                       : "#ffffff",

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:481:25
                   background:
                     selectedItem === selectedConcept.id
                       ? selectedConcept.color
-                      : "#ffffff",
+                      : "",
                   color: "#000000",
                   borderTop: "1.5px solid #1E293B",

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:488:28
                   borderRight: "4px solid #1E293B",
                   borderBottom: "4px solid #1E293B",
                   borderRadius: 6,
-                  padding: "5px 14px",
+                  padding: "",
                   fontSize: 15,
                   fontWeight: 700,

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:491:31
                   padding: "5px 14px",
                   fontSize: 15,
                   fontWeight: 700,
-                  fontFamily: "Helvetica, Arial, sans-serif",
+                  fontFamily: "",
                   cursor: "pointer",
                   flexShrink: 0,

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:492:27
                   fontSize: 15,
                   fontWeight: 700,
                   fontFamily: "Helvetica, Arial, sans-serif",
-                  cursor: "pointer",
+                  cursor: "",
                   flexShrink: 0,
                   whiteSpace: "nowrap",

[NoCoverage] ObjectLiteral
src/main/pages/HomePage.tsx:502:24
 
               {/* Divider */}
               <div
-                style={{
-                  width: 1,
-                  alignSelf: "stretch",
-                  background: "#00000033",
-                  flexShrink: 0,
-                }}
+                style={{}}
               />
 

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:505:31
                 style={{
                   width: 1,
                   alignSelf: "stretch",
-                  background: "#00000033",
+                  background: "",
                   flexShrink: 0,
                 }}

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:514:28
               <div
                 style={{
                   flex: 1,
-                  display: "flex",
+                  display: "",
                   flexWrap: "wrap",
                   gap: 8,

[NoCoverage] ArrowFunction
src/main/pages/HomePage.tsx:520:50
                   alignItems: "flex-start",
                 }}
               >
-                {selectedConcept.subconcepts.map((sub) => (
-                  <button
-                    key={sub}
-                    onClick={() =>
-                      setSelectedItem(selectedItem === sub ? null : sub)
-                    }
-                    style={{
-                      background:
-                        selectedItem === sub
-                          ? selectedConcept.color
-                          : "#ffffff",
-                      color: "#000000",
-                      border: "1px solid #000000",
-                      borderRadius: 6,
-                      padding: "5px 14px",
-                      fontSize: 14,
-                      fontWeight: 500,
-                      fontFamily: "Helvetica, Arial, sans-serif",
-                      cursor: "pointer",
-                    }}
-                  >
-                    {sub.replace(/\n/g, " ")}
-                  </button>
-                ))}
+                {selectedConcept.subconcepts.map(() => undefined)}
               </div>
 

[NoCoverage] ArrowFunction
src/main/pages/HomePage.tsx:523:30
                 {selectedConcept.subconcepts.map((sub) => (
                   <button
                     key={sub}
-                    onClick={() =>
-                      setSelectedItem(selectedItem === sub ? null : sub)
+                    onClick={() => undefined
                     }
                     style={{

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:524:39
                   <button
                     key={sub}
                     onClick={() =>
-                      setSelectedItem(selectedItem === sub ? null : sub)
+                      setSelectedItem(true ? null : sub)
                     }
                     style={{

[NoCoverage] EqualityOperator
src/main/pages/HomePage.tsx:524:39
                   <button
                     key={sub}
                     onClick={() =>
-                      setSelectedItem(selectedItem === sub ? null : sub)
+                      setSelectedItem(selectedItem !== sub ? null : sub)
                     }
                     style={{

[NoCoverage] ObjectLiteral
src/main/pages/HomePage.tsx:526:28
                     onClick={() =>
                       setSelectedItem(selectedItem === sub ? null : sub)
                     }
-                    style={{
-                      background:
-                        selectedItem === sub
-                          ? selectedConcept.color
-                          : "#ffffff",
-                      color: "#000000",
-                      border: "1px solid #000000",
-                      borderRadius: 6,
-                      padding: "5px 14px",
-                      fontSize: 14,
-                      fontWeight: 500,
-                      fontFamily: "Helvetica, Arial, sans-serif",
-                      cursor: "pointer",
-                    }}
+                    style={{}}
                   >
                     {sub.replace(/\n/g, " ")}

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:528:25
                     }
                     style={{
                       background:
-                        selectedItem === sub
+                        true
                           ? selectedConcept.color
                           : "#ffffff",

[NoCoverage] EqualityOperator
src/main/pages/HomePage.tsx:528:25
                     }
                     style={{
                       background:
-                        selectedItem === sub
+                        selectedItem !== sub
                           ? selectedConcept.color
                           : "#ffffff",

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:548:32
 
               {/* Close button */}
               <div
-                onClick={() => {
-                  setSelectedConceptId(null);
-                  setSelectedItem(null);
-                  setCloseHovered(false);
-                  if (!selectedQuestionId) setHighlightedIds(new Set());
-                }}
+                onClick={() => {}}
                 onMouseEnter={() => setCloseHovered(true)}
                 onMouseLeave={() => setCloseHovered(false)}

[NoCoverage] BooleanLiteral
src/main/pages/HomePage.tsx:551:35
                 onClick={() => {
                   setSelectedConceptId(null);
                   setSelectedItem(null);
-                  setCloseHovered(false);
+                  setCloseHovered(true);
                   if (!selectedQuestionId) setHighlightedIds(new Set());
                 }}

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:552:23
                   setSelectedConceptId(null);
                   setSelectedItem(null);
                   setCloseHovered(false);
-                  if (!selectedQuestionId) setHighlightedIds(new Set());
+                  if (false) setHighlightedIds(new Set());
                 }}
                 onMouseEnter={() => setCloseHovered(true)}

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:552:23
                   setSelectedConceptId(null);
                   setSelectedItem(null);
                   setCloseHovered(false);
-                  if (!selectedQuestionId) setHighlightedIds(new Set());
+                  if (true) setHighlightedIds(new Set());
                 }}
                 onMouseEnter={() => setCloseHovered(true)}

[NoCoverage] ObjectLiteral
src/main/pages/HomePage.tsx:556:24
                 }}
                 onMouseEnter={() => setCloseHovered(true)}
                 onMouseLeave={() => setCloseHovered(false)}
-                style={{
-                  width: 28,
-                  height: 28,
-                  borderRadius: 6,
-                  borderTop: "1.5px solid #1E293B",
-                  borderLeft: "1.5px solid #1E293B",
-                  borderRight: "4px solid #1E293B",
-                  borderBottom: "4px solid #1E293B",
-                  background: closeHovered ? "#ef4444" : "#ffffff",
-                  display: "flex",
-                  alignItems: "center",
-                  justifyContent: "center",
-                  cursor: "pointer",
-                  flexShrink: 0,
-                  transition: "background 0.15s",
-                }}
+                style={{}}
               >
                 <svg

[NoCoverage] ObjectLiteral
src/main/pages/HomePage.tsx:589:25
               </div>
             </>
           ) : (
-            <div style={{ color: "#000000", fontSize: 13, lineHeight: "36px" }}>
+            <div style={{}}>
               {selectedQuestionId
                 ? "Click a concept card to explore it."

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:589:71
               </div>
             </>
           ) : (
-            <div style={{ color: "#000000", fontSize: 13, lineHeight: "36px" }}>
+            <div style={{ color: "#000000", fontSize: 13, lineHeight: "" }}>
               {selectedQuestionId
                 ? "Click a concept card to explore it."

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:592:19
             <div style={{ color: "#000000", fontSize: 13, lineHeight: "36px" }}>
               {selectedQuestionId
                 ? "Click a concept card to explore it."
-                : "Select a question, or click any concept card to explore it."}
+                : ""}
             </div>
           )}

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:598:10
         </div>
 
         {/* Expanded cards — only shown when a button is clicked */}
-        {selectedConcept &&
-          selectedItem !== null &&
+        {true &&
           (() => {
             const selectedItemLabel =

[NoCoverage] LogicalOperator
src/main/pages/HomePage.tsx:598:10
         </div>
 
         {/* Expanded cards — only shown when a button is clicked */}
-        {selectedConcept &&
-          selectedItem !== null &&
+        {selectedConcept || selectedItem !== null &&
           (() => {
             const selectedItemLabel =

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:599:11
 
         {/* Expanded cards — only shown when a button is clicked */}
         {selectedConcept &&
-          selectedItem !== null &&
+          true &&
           (() => {
             const selectedItemLabel =

[NoCoverage] EqualityOperator
src/main/pages/HomePage.tsx:599:11
 
         {/* Expanded cards — only shown when a button is clicked */}
         {selectedConcept &&
-          selectedItem !== null &&
+          selectedItem === null &&
           (() => {
             const selectedItemLabel =
