[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:602:15
           selectedItem !== null &&
           (() => {
             const selectedItemLabel =
-              selectedItem === selectedConcept.id
+              false
                 ? selectedConcept.label.replace(/\n/g, " ")
                 : (selectedItem ?? "");

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:602:15
           selectedItem !== null &&
           (() => {
             const selectedItemLabel =
-              selectedItem === selectedConcept.id
+              true
                 ? selectedConcept.label.replace(/\n/g, " ")
                 : (selectedItem ?? "");

[NoCoverage] LogicalOperator
src/main/pages/HomePage.tsx:604:20
             const selectedItemLabel =
               selectedItem === selectedConcept.id
                 ? selectedConcept.label.replace(/\n/g, " ")
-                : (selectedItem ?? "");
+                : (selectedItem && "");
             const contentKey =
               selectedItem === selectedConcept.id

[NoCoverage] EqualityOperator
src/main/pages/HomePage.tsx:606:15
                 ? selectedConcept.label.replace(/\n/g, " ")
                 : (selectedItem ?? "");
             const contentKey =
-              selectedItem === selectedConcept.id
+              selectedItem !== selectedConcept.id
                 ? selectedConcept.id
                 : `${selectedConcept.id}:${selectedItem}`;

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:606:15
                 ? selectedConcept.label.replace(/\n/g, " ")
                 : (selectedItem ?? "");
             const contentKey =
-              selectedItem === selectedConcept.id
+              false
                 ? selectedConcept.id
                 : `${selectedConcept.id}:${selectedItem}`;

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:608:19
             const contentKey =
               selectedItem === selectedConcept.id
                 ? selectedConcept.id
-                : `${selectedConcept.id}:${selectedItem}`;
+                : ``;
             const content = conceptContent[contentKey];
             const isMajorConcept = selectedItem === selectedConcept.id;

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:610:36
                 ? selectedConcept.id
                 : `${selectedConcept.id}:${selectedItem}`;
             const content = conceptContent[contentKey];
-            const isMajorConcept = selectedItem === selectedConcept.id;
+            const isMajorConcept = false;
 
             return (

[NoCoverage] EqualityOperator
src/main/pages/HomePage.tsx:610:36
                 ? selectedConcept.id
                 : `${selectedConcept.id}:${selectedItem}`;
             const content = conceptContent[contentKey];
-            const isMajorConcept = selectedItem === selectedConcept.id;
+            const isMajorConcept = selectedItem !== selectedConcept.id;
 
             return (

[NoCoverage] ArrayDeclaration
src/main/pages/HomePage.tsx:614:18
 
             return (
               <div style={{ padding: "0 20px 20px", display: "flex", gap: 12 }}>
-                {[
-                  { label: "Description", key: "description" },
-                  { label: "Example", key: "example" },
-                ].map((card) => {
+                {[].map((card) => {
                   const isAdded = addedDetailKeys.has(
                     `${card.label}:${selectedItemLabel}`,

[NoCoverage] ObjectLiteral
src/main/pages/HomePage.tsx:616:19
               <div style={{ padding: "0 20px 20px", display: "flex", gap: 12 }}>
                 {[
                   { label: "Description", key: "description" },
-                  { label: "Example", key: "example" },
+                  {},
                 ].map((card) => {
                   const isAdded = addedDetailKeys.has(

[NoCoverage] BooleanLiteral
src/main/pages/HomePage.tsx:624:34
                   return (
                     <div
                       key={card.key}
-                      draggable={!isAdded}
+                      draggable={isAdded}
                       onDragStart={
                         isAdded

[NoCoverage] BlockStatement
src/main/pages/HomePage.tsx:628:36
                       onDragStart={
                         isAdded
                           ? undefined
-                          : (e) => {
-                              e.dataTransfer.setData(
-                                "application/scaffold-card",
-                                JSON.stringify({
-                                  cardType: card.label,
-                                  itemLabel: selectedItemLabel,
-                                  conceptId: selectedConcept.id,
-                                  conceptColor: selectedConcept.color,
-                                  cardContent:
-                                    content?.[
-                                      card.key as keyof ConceptContent
-                                    ] ?? "",
-                                }),
-                              );
-                              e.dataTransfer.effectAllowed = "move";
-                            }
+                          : (e) => {}
                       }
                       style={{

[NoCoverage] LogicalOperator
src/main/pages/HomePage.tsx:637:37
                                   conceptId: selectedConcept.id,
                                   conceptColor: selectedConcept.color,
                                   cardContent:
-                                    content?.[
-                                      card.key as keyof ConceptContent
-                                    ] ?? "",
+                                    content?.[card.key as keyof ConceptContent] && "",
                                 }),
                               );

[NoCoverage] OptionalChaining
src/main/pages/HomePage.tsx:637:37
                                   conceptId: selectedConcept.id,
                                   conceptColor: selectedConcept.color,
                                   cardContent:
-                                    content?.[
-                                      card.key as keyof ConceptContent
-                                    ] ?? "",
+                                    content[card.key as keyof ConceptContent] ?? "",
                                 }),
                               );

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:642:62
                                     ] ?? "",
                                 }),
                               );
-                              e.dataTransfer.effectAllowed = "move";
+                              e.dataTransfer.effectAllowed = "";
                             }
                       }

[NoCoverage] ObjectLiteral
src/main/pages/HomePage.tsx:645:30
                               e.dataTransfer.effectAllowed = "move";
                             }
                       }
-                      style={{
-                        flex: 1,
-                        background: toPastel(selectedConcept.color),
-                        borderRadius: 8,
-                        border: "1px solid #000000",
-                        padding: "10px 14px",
-                        textAlign: "left",
-                        cursor: isAdded ? "default" : "grab",
-                        opacity: isAdded ? 0.8 : 1,
-                      }}
+                      style={{}}
                     >
                       <span

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:649:33
                         flex: 1,
                         background: toPastel(selectedConcept.color),
                         borderRadius: 8,
-                        border: "1px solid #000000",
+                        border: "",
                         padding: "10px 14px",
                         textAlign: "left",

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:651:36
                         borderRadius: 8,
                         border: "1px solid #000000",
                         padding: "10px 14px",
-                        textAlign: "left",
+                        textAlign: "",
                         cursor: isAdded ? "default" : "grab",
                         opacity: isAdded ? 0.8 : 1,

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:652:55
                         border: "1px solid #000000",
                         padding: "10px 14px",
                         textAlign: "left",
-                        cursor: isAdded ? "default" : "grab",
+                        cursor: isAdded ? "default" : "",
                         opacity: isAdded ? 0.8 : 1,
                       }}

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:652:43
                         border: "1px solid #000000",
                         padding: "10px 14px",
                         textAlign: "left",
-                        cursor: isAdded ? "default" : "grab",
+                        cursor: isAdded ? "" : "grab",
                         opacity: isAdded ? 0.8 : 1,
                       }}

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:662:39
                           borderRadius: 100,
                           padding: "2px 10px",
                           border: "1px solid #000000",
-                          fontFamily: "Helvetica, Arial, sans-serif",
+                          fontFamily: "",
                           fontSize: 12,
                           fontWeight: 700,

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:666:39
                           fontSize: 12,
                           fontWeight: 700,
                           color: "#000000",
-                          whiteSpace: "nowrap",
+                          whiteSpace: "",
                           width: "fit-content",
                           display: "block",

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:667:34
                           fontWeight: 700,
                           color: "#000000",
                           whiteSpace: "nowrap",
-                          width: "fit-content",
+                          width: "",
                           display: "block",
                           marginBottom: 8,

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:668:36
                           color: "#000000",
                           whiteSpace: "nowrap",
                           width: "fit-content",
-                          display: "block",
+                          display: "",
                           marginBottom: 8,
                         }}

[NoCoverage] ConditionalExpression
src/main/pages/HomePage.tsx:683:26
                           whiteSpace: "pre-wrap",
                         }}
                       >
-                        {card.key === "example" ? (
+                        {true ? (
                           <pre
                             style={{

[NoCoverage] EqualityOperator
src/main/pages/HomePage.tsx:683:26
                           whiteSpace: "pre-wrap",
                         }}
                       >
-                        {card.key === "example" ? (
+                        {card.key !== "example" ? (
                           <pre
                             style={{

[NoCoverage] ObjectLiteral
src/main/pages/HomePage.tsx:685:36
                       >
                         {card.key === "example" ? (
                           <pre
-                            style={{
-                              fontFamily: "monospace",
-                              border: "1px solid #000000",
-                              fontSize: 13,
-                              background: "#e2e8f0",
-                              borderRadius: 6,
-                              padding: "8px 12px",
-                              margin: 0,
-                              whiteSpace: "pre-wrap",
-                              color: "#1E293B",
-                            }}
+                            style={{}}
                           >
                             {content?.[card.key as keyof ConceptContent] ??

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:689:43
                               fontFamily: "monospace",
                               border: "1px solid #000000",
                               fontSize: 13,
-                              background: "#e2e8f0",
+                              background: "",
                               borderRadius: 6,
                               padding: "8px 12px",

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:694:38
                               padding: "8px 12px",
                               margin: 0,
                               whiteSpace: "pre-wrap",
-                              color: "#1E293B",
+                              color: "",
                             }}
                           >

[NoCoverage] LogicalOperator
src/main/pages/HomePage.tsx:697:30
                               color: "#1E293B",
                             }}
                           >
-                            {content?.[card.key as keyof ConceptContent] ??
-                              `Example for "${selectedItemLabel}" will appear here.`}
+                            {content?.[card.key as keyof ConceptContent] && `Example for "${selectedItemLabel}" will appear here.`}
                           </pre>
                         ) : (

[NoCoverage] OptionalChaining
src/main/pages/HomePage.tsx:697:30
                               color: "#1E293B",
                             }}
                           >
-                            {content?.[card.key as keyof ConceptContent] ??
+                            {content[card.key as keyof ConceptContent] ??
                               `Example for "${selectedItemLabel}" will appear here.`}
                           </pre>

[NoCoverage] LogicalOperator
src/main/pages/HomePage.tsx:701:28
                               `Example for "${selectedItemLabel}" will appear here.`}
                           </pre>
                         ) : (
-                          (content?.[card.key as keyof ConceptContent] ??
-                          `${card.label} for "${selectedItemLabel}" will appear here.`)
+                          (content?.[card.key as keyof ConceptContent] && `${card.label} for "${selectedItemLabel}" will appear here.`)
                         )}
                       </div>

[NoCoverage] OptionalChaining
src/main/pages/HomePage.tsx:701:28
                               `Example for "${selectedItemLabel}" will appear here.`}
                           </pre>
                         ) : (
-                          (content?.[card.key as keyof ConceptContent] ??
+                          (content[card.key as keyof ConceptContent] ??
                           `${card.label} for "${selectedItemLabel}" will appear here.`)
                         )}

[NoCoverage] LogicalOperator
src/main/pages/HomePage.tsx:711:27
 
                 {isMajorConcept && (
                   <a
-                    href={content?.practiceUrl ?? "#"}
+                    href={content?.practiceUrl && "#"}
                     target="_blank"
                     rel="noopener noreferrer"

[NoCoverage] OptionalChaining
src/main/pages/HomePage.tsx:711:27
 
                 {isMajorConcept && (
                   <a
-                    href={content?.practiceUrl ?? "#"}
+                    href={content.practiceUrl ?? "#"}
                     target="_blank"
                     rel="noopener noreferrer"

[NoCoverage] ObjectLiteral
src/main/pages/HomePage.tsx:714:28
                     href={content?.practiceUrl ?? "#"}
                     target="_blank"
                     rel="noopener noreferrer"
-                    style={{
-                      flex: "0 0 auto",
-                      alignSelf: "center",
-                      background: selectedConcept.color,
-                      borderRadius: 8,
-                      borderTop: "1.5px solid #1E293B",
-                      borderLeft: "1.5px solid #1E293B",
-                      borderRight: "4px solid #1E293B",
-                      borderBottom: "4px solid #1E293B",
-                      display: "flex",
-                      alignItems: "center",
-                      justifyContent: "center",
-                      textAlign: "center",
-                      fontFamily: "Helvetica, Arial, sans-serif",
-                      fontSize: 15,
-                      fontWeight: 700,
-                      color: "#1E293B",
-                      cursor: content?.practiceUrl ? "pointer" : "default",
-                      textDecoration: "none",
-                      padding: "10px 14px",
-                      opacity: content?.practiceUrl ? 1 : 0.4,
-                    }}
+                    style={{}}
                   >
                     Practice with a <br />

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:715:29
                     target="_blank"
                     rel="noopener noreferrer"
                     style={{
-                      flex: "0 0 auto",
+                      flex: "",
                       alignSelf: "center",
                       background: selectedConcept.color,

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:723:32
                       borderLeft: "1.5px solid #1E293B",
                       borderRight: "4px solid #1E293B",
                       borderBottom: "4px solid #1E293B",
-                      display: "flex",
+                      display: "",
                       alignItems: "center",
                       justifyContent: "center",

[NoCoverage] OptionalChaining
src/main/pages/HomePage.tsx:731:31
                       fontSize: 15,
                       fontWeight: 700,
                       color: "#1E293B",
-                      cursor: content?.practiceUrl ? "pointer" : "default",
+                      cursor: content.practiceUrl ? "pointer" : "default",
                       textDecoration: "none",
                       padding: "10px 14px",

[NoCoverage] StringLiteral
src/main/pages/HomePage.tsx:731:54
                       fontSize: 15,
                       fontWeight: 700,
                       color: "#1E293B",
-                      cursor: content?.practiceUrl ? "pointer" : "default",
+                      cursor: content?.practiceUrl ? "" : "default",
                       textDecoration: "none",
                       padding: "10px 14px",

[NoCoverage] OptionalChaining
src/main/pages/HomePage.tsx:734:32
                       cursor: content?.practiceUrl ? "pointer" : "default",
                       textDecoration: "none",
                       padding: "10px 14px",
-                      opacity: content?.practiceUrl ? 1 : 0.4,
+                      opacity: content.practiceUrl ? 1 : 0.4,
                     }}
                   >
