[Killed] BlockStatement
src/main/utils/currentUser.ts:5:34
 import axios from "axios";
 import { useNavigate } from "react-router-dom";
 
-export function useCurrentUser() {
-  const queryResults = useQuery({
-    queryKey: ["current user"],
-    queryFn: async () => {
-      try {
-        const response = await axios.get("/api/currentUser");
-        const rolesList: string[] =
-          response.data.roles?.map((r: { authority: string }) => r.authority) ??
-          [];
-        return { loggedIn: true, root: { ...response.data, rolesList } };
-      } catch (e: unknown) {
-        const err = e as { status?: number };
-        if (err.status === 403) {
-          return { loggedIn: false, root: {} };
-        }
-        throw e;
-      }
-    },
-    initialData: { loggedIn: false, root: null },
-  });
-  return queryResults.data;
-}
+export function useCurrentUser() {}
 
 export function useLogout() {
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser returns initialData when request is pending
statusReason: expected undefined to deeply equal { loggedIn: false, root: null }

[Killed] ArrayDeclaration
src/main/utils/currentUser.ts:7:15
 
 export function useCurrentUser() {
   const queryResults = useQuery({
-    queryKey: ["current user"],
+    queryKey: [],
     queryFn: async () => {
       try {
killedBy: AppNavbar tests renders user email and Log Out button when logged in
statusReason: Unable to find an element with the text: cgaucho@ucsb.edu. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <header
      style="background: rgb(255, 255, 255); border-bottom: 1px solid var(--border);"
    >

[Killed] BlockStatement
src/main/utils/currentUser.ts:8:26
 export function useCurrentUser() {
   const queryResults = useQuery({
     queryKey: ["current user"],
-    queryFn: async () => {
-      try {
-        const response = await axios.get("/api/currentUser");
-        const rolesList: string[] =
-          response.data.roles?.map((r: { authority: string }) => r.authority) ??
-          [];
-        return { loggedIn: true, root: { ...response.data, rolesList } };
-      } catch (e: unknown) {
-        const err = e as { status?: number };
-        if (err.status === 403) {
-          return { loggedIn: false, root: {} };
-        }
-        throw e;
-      }
-    },
+    queryFn: async () => {},
     initialData: { loggedIn: false, root: null },
   });
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser returns user data from API
statusReason: expected { loggedIn: false, root: null } to deeply equal { loggedIn: true, root: { …(3) } }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/main/utils/currentUser.ts:9:11
   const queryResults = useQuery({
     queryKey: ["current user"],
     queryFn: async () => {
-      try {
-        const response = await axios.get("/api/currentUser");
-        const rolesList: string[] =
-          response.data.roles?.map((r: { authority: string }) => r.authority) ??
-          [];
-        return { loggedIn: true, root: { ...response.data, rolesList } };
-      } catch (e: unknown) {
+      try {} catch (e: unknown) {
         const err = e as { status?: number };
         if (err.status === 403) {
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser returns user data from API
statusReason: expected { loggedIn: false, root: null } to deeply equal { loggedIn: true, root: { …(3) } }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ArrowFunction
src/main/utils/currentUser.ts:12:36
       try {
         const response = await axios.get("/api/currentUser");
         const rolesList: string[] =
-          response.data.roles?.map((r: { authority: string }) => r.authority) ??
+          response.data.roles?.map(() => undefined) ??
           [];
         return { loggedIn: true, root: { ...response.data, rolesList } };
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser returns user data from API
statusReason: expected { loggedIn: true, root: { …(3) } } to deeply equal { loggedIn: true, root: { …(3) } }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] LogicalOperator
src/main/utils/currentUser.ts:12:11
       try {
         const response = await axios.get("/api/currentUser");
         const rolesList: string[] =
-          response.data.roles?.map((r: { authority: string }) => r.authority) ??
-          [];
+          response.data.roles?.map((r: {
+  authority: string;
+}) => r.authority) && [];
         return { loggedIn: true, root: { ...response.data, rolesList } };
       } catch (e: unknown) {
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser returns user data from API
statusReason: expected { loggedIn: true, root: { …(3) } } to deeply equal { loggedIn: true, root: { …(3) } }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/main/utils/currentUser.ts:14:28
         const rolesList: string[] =
           response.data.roles?.map((r: { authority: string }) => r.authority) ??
           [];
-        return { loggedIn: true, root: { ...response.data, rolesList } };
+        return { loggedIn: false, root: { ...response.data, rolesList } };
       } catch (e: unknown) {
         const err = e as { status?: number };
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser returns user data from API
statusReason: expected { loggedIn: false, root: { …(3) } } to deeply equal { loggedIn: true, root: { …(3) } }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ObjectLiteral
src/main/utils/currentUser.ts:14:16
         const rolesList: string[] =
           response.data.roles?.map((r: { authority: string }) => r.authority) ??
           [];
-        return { loggedIn: true, root: { ...response.data, rolesList } };
+        return {};
       } catch (e: unknown) {
         const err = e as { status?: number };
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser returns user data from API
statusReason: expected {} to deeply equal { loggedIn: true, root: { …(3) } }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/main/utils/currentUser.ts:43:12
 export function hasRole(
   currentUser: ReturnType<typeof useCurrentUser>,
   role: string,
-): boolean {
-  if (currentUser == null) return false;
-  return (
-    (currentUser.root as { rolesList?: string[] })?.rolesList?.includes(role) ??
-    false
-  );
-}
+): boolean {}
 
killedBy: utils/currentUser tests hasRole tests hasRole returns correct values for properly-defined currentUser
statusReason: expected undefined to be truthy

[Killed] BooleanLiteral
src/main/utils/currentUser.ts:44:35
   currentUser: ReturnType<typeof useCurrentUser>,
   role: string,
 ): boolean {
-  if (currentUser == null) return false;
+  if (currentUser == null) return true;
   return (
     (currentUser.root as { rolesList?: string[] })?.rolesList?.includes(role) ??
killedBy: utils/currentUser tests hasRole tests hasRole returns false for null/undefined/empty currentUser
statusReason: expected true to be falsy

[Killed] EqualityOperator
src/main/utils/currentUser.ts:44:7
   currentUser: ReturnType<typeof useCurrentUser>,
   role: string,
 ): boolean {
-  if (currentUser == null) return false;
+  if (currentUser != null) return false;
   return (
     (currentUser.root as { rolesList?: string[] })?.rolesList?.includes(role) ??
killedBy: utils/currentUser tests hasRole tests hasRole returns false for null/undefined/empty currentUser
statusReason: Cannot read properties of null (reading 'root')

[Killed] OptionalChaining
src/main/utils/currentUser.ts:46:5
 ): boolean {
   if (currentUser == null) return false;
   return (
-    (currentUser.root as { rolesList?: string[] })?.rolesList?.includes(role) ??
+    (currentUser.root as {
+  rolesList?: string[];
+}).rolesList?.includes(role) ??
     false
   );
killedBy: utils/currentUser tests hasRole tests hasRole returns false for null/undefined/empty currentUser
statusReason: Cannot read properties of undefined (reading 'rolesList')

[Killed] OptionalChaining
src/main/utils/currentUser.ts:46:5
 ): boolean {
   if (currentUser == null) return false;
   return (
-    (currentUser.root as { rolesList?: string[] })?.rolesList?.includes(role) ??
+    (currentUser.root as {
+  rolesList?: string[];
+})?.rolesList.includes(role) ??
     false
   );
killedBy: utils/currentUser tests hasRole tests hasRole returns false for null/undefined/empty currentUser
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] BooleanLiteral
src/main/utils/currentUser.ts:47:5
   if (currentUser == null) return false;
   return (
     (currentUser.root as { rolesList?: string[] })?.rolesList?.includes(role) ??
-    false
+    true
   );
 }
killedBy: utils/currentUser tests hasRole tests hasRole returns false for null/undefined/empty currentUser
statusReason: expected true to be falsy
