[NoCoverage] ObjectLiteral
src/main/utils/layout.ts:6:19
 
 const positions: Record<string, { x: number; y: number }> = {
   // Row 5
-  "nested-loops": { x: 645, y: 0 },
+  "nested-loops": {},
   "input-output": { x: 955, y: 0 },
   files: { x: 1265, y: 0 },

[NoCoverage] ObjectLiteral
src/main/utils/layout.ts:7:19
 const positions: Record<string, { x: number; y: number }> = {
   // Row 5
   "nested-loops": { x: 645, y: 0 },
-  "input-output": { x: 955, y: 0 },
+  "input-output": {},
   files: { x: 1265, y: 0 },
   modules: { x: 1575, y: 0 },

[NoCoverage] ObjectLiteral
src/main/utils/layout.ts:9:12
   "nested-loops": { x: 645, y: 0 },
   "input-output": { x: 955, y: 0 },
   files: { x: 1265, y: 0 },
-  modules: { x: 1575, y: 0 },
+  modules: {},
   "string-methods": { x: 1885, y: 0 },
   // Row 4

[NoCoverage] ObjectLiteral
src/main/utils/layout.ts:14:14
   // Row 4
   "main-fn": { x: 180, y: 300 },
   loops: { x: 490, y: 300 },
-  recursion: { x: 800, y: 300 },
+  recursion: {},
   "nested-lists": { x: 1110, y: 300 },
   "built-in-fns": { x: 1420, y: 300 },

[NoCoverage] ObjectLiteral
src/main/utils/layout.ts:17:12
   recursion: { x: 800, y: 300 },
   "nested-lists": { x: 1110, y: 300 },
   "built-in-fns": { x: 1420, y: 300 },
-  methods: { x: 1730, y: 300 },
+  methods: {},
   mutability: { x: 2040, y: 300 },
   testing: { x: 2350, y: 300 },

[NoCoverage] ObjectLiteral
src/main/utils/layout.ts:21:17
   mutability: { x: 2040, y: 300 },
   testing: { x: 2350, y: 300 },
   // Row 3
-  conditionals: { x: 180, y: 650 },
+  conditionals: {},
   "errors-debugging": { x: 490, y: 650 },
   lists: { x: 800, y: 650 },

[NoCoverage] ObjectLiteral
src/main/utils/layout.ts:22:23
   testing: { x: 2350, y: 300 },
   // Row 3
   conditionals: { x: 180, y: 650 },
-  "errors-debugging": { x: 490, y: 650 },
+  "errors-debugging": {},
   lists: { x: 800, y: 650 },
   functions: { x: 1110, y: 650 },

[NoCoverage] ObjectLiteral
src/main/utils/layout.ts:24:14
   conditionals: { x: 180, y: 650 },
   "errors-debugging": { x: 490, y: 650 },
   lists: { x: 800, y: 650 },
-  functions: { x: 1110, y: 650 },
+  functions: {},
   "string-ops": { x: 1420, y: 650 },
   dictionaries: { x: 1730, y: 650 },

[NoCoverage] ArrowFunction
src/main/utils/layout.ts:39:43
 };
 
 export function buildGraphElements(): { nodes: Node[]; edges: Edge[] } {
-  const nodes: Node[] = majorConcepts.map((concept) => ({
-    id: concept.id,
-    type: "major",
-    position: positions[concept.id] ?? { x: 0, y: 0 },
-    data: {
-      label: concept.label,
-      color: concept.color,
-      subconcepts: concept.subconcepts,
-    },
-    sourcePosition: Position.Top,
-    targetPosition: Position.Bottom,
-  }));
+  const nodes: Node[] = majorConcepts.map(() => undefined);
 
   const edges: Edge[] = prereqEdgeData.map((e) => ({

[NoCoverage] LogicalOperator
src/main/utils/layout.ts:42:15
   const nodes: Node[] = majorConcepts.map((concept) => ({
     id: concept.id,
     type: "major",
-    position: positions[concept.id] ?? { x: 0, y: 0 },
+    position: positions[concept.id] && {
+  x: 0,
+  y: 0
+},
     data: {
       label: concept.label,

[NoCoverage] ArrowFunction
src/main/utils/layout.ts:52:44
     targetPosition: Position.Bottom,
   }));
 
-  const edges: Edge[] = prereqEdgeData.map((e) => ({
-    id: `prereq-${e.source}-${e.target}`,
-    source: e.source,
-    target: e.target,
-    sourceHandle: "top",
-    targetHandle: "bottom",
-    type: "smooth",
-    style: {
-      stroke: majorConcepts.find((c) => c.id === e.source)?.color,
-      strokeWidth: 4,
-    },
-    markerEnd: {
-      type: MarkerType.ArrowClosed,
-      color: majorConcepts.find((c) => c.id === e.source)?.color,
-    },
-  }));
+  const edges: Edge[] = prereqEdgeData.map(() => undefined);
 
   return { nodes, edges };

[NoCoverage] StringLiteral
src/main/utils/layout.ts:53:9
   }));
 
   const edges: Edge[] = prereqEdgeData.map((e) => ({
-    id: `prereq-${e.source}-${e.target}`,
+    id: ``,
     source: e.source,
     target: e.target,

[NoCoverage] StringLiteral
src/main/utils/layout.ts:56:19
     id: `prereq-${e.source}-${e.target}`,
     source: e.source,
     target: e.target,
-    sourceHandle: "top",
+    sourceHandle: "",
     targetHandle: "bottom",
     type: "smooth",

[NoCoverage] EqualityOperator
src/main/utils/layout.ts:60:41
     targetHandle: "bottom",
     type: "smooth",
     style: {
-      stroke: majorConcepts.find((c) => c.id === e.source)?.color,
+      stroke: majorConcepts.find((c) => c.id !== e.source)?.color,
       strokeWidth: 4,
     },

[NoCoverage] ArrowFunction
src/main/utils/layout.ts:60:34
     targetHandle: "bottom",
     type: "smooth",
     style: {
-      stroke: majorConcepts.find((c) => c.id === e.source)?.color,
+      stroke: majorConcepts.find(() => undefined)?.color,
       strokeWidth: 4,
     },

[NoCoverage] OptionalChaining
src/main/utils/layout.ts:65:14
     },
     markerEnd: {
       type: MarkerType.ArrowClosed,
-      color: majorConcepts.find((c) => c.id === e.source)?.color,
+      color: majorConcepts.find(c => c.id === e.source).color,
     },
   }));

[NoCoverage] EqualityOperator
src/main/utils/layout.ts:65:40
     },
     markerEnd: {
       type: MarkerType.ArrowClosed,
-      color: majorConcepts.find((c) => c.id === e.source)?.color,
+      color: majorConcepts.find((c) => c.id !== e.source)?.color,
     },
   }));

[NoCoverage] ObjectLiteral
src/main/utils/layout.ts:69:10
     },
   }));
 
-  return { nodes, edges };
+  return {};
 }
 
