[Killed] BlockStatement
main/components/Nav/Footer.tsx:1:34
-export default function Footer() {
-  return (
-    <footer
-      style={{
-        background: "#ffffff",
-        borderTop: "1px solid var(--border)",
-      }}
-    >
-      <div
-        style={{
-          width: "1126px",
-          maxWidth: "100%",
-          margin: "0 auto",
-          padding: "16px 20px",
-          color: "#475569",
-          fontSize: "0.95rem",
-        }}
-      >
-        Scaffold is a UCSB Computer Science project.
-      </div>
-    </footer>
-  );
-}
+export default function Footer() {}
 
killedBy: BasicLayout tests renders Footer inside layout
statusReason: Unable to find an element with the text: /UCSB Computer Science project/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="min-height: 100svh; display: flex; flex-direction: column;"
    >

[Survived] ObjectLiteral
main/components/Nav/Footer.tsx:10:16
       }}
     >
       <div
-        style={{
-          width: "1126px",
-          maxWidth: "100%",
-          margin: "0 auto",
-          padding: "16px 20px",
-          color: "#475569",
-          fontSize: "0.95rem",
-        }}
+        style={{}}
       >
         Scaffold is a UCSB Computer Science project.

[Survived] StringLiteral
main/components/Nav/Footer.tsx:15:18
           maxWidth: "100%",
           margin: "0 auto",
           padding: "16px 20px",
-          color: "#475569",
+          color: "",
           fontSize: "0.95rem",
         }}
