[Survived] ObjectLiteral
main/layouts/BasicLayout/BasicLayout.tsx:12:14
 export default function BasicLayout({ children }: BasicLayoutProps) {
   return (
     <div
-      style={{
-        minHeight: "100svh",
-        display: "flex",
-        flexDirection: "column",
-      }}
+      style={{}}
     >
       <AppNavbar />

[Survived] StringLiteral
main/layouts/BasicLayout/BasicLayout.tsx:13:20
   return (
     <div
       style={{
-        minHeight: "100svh",
+        minHeight: "",
         display: "flex",
         flexDirection: "column",

[Survived] StringLiteral
main/layouts/BasicLayout/BasicLayout.tsx:14:18
     <div
       style={{
         minHeight: "100svh",
-        display: "flex",
+        display: "",
         flexDirection: "column",
       }}

[Survived] StringLiteral
main/layouts/BasicLayout/BasicLayout.tsx:22:21
       <main
         style={{
           width: "1126px",
-          maxWidth: "100%",
+          maxWidth: "",
           margin: "0 auto",
           borderInline: "1px solid var(--border)",

[Survived] StringLiteral
main/layouts/BasicLayout/BasicLayout.tsx:24:25
           width: "1126px",
           maxWidth: "100%",
           margin: "0 auto",
-          borderInline: "1px solid var(--border)",
+          borderInline: "",
           background: "#f7ede1",
           flex: 1,
